
local needmoney = {
    {0,1000,0}, -- 创建帮派
    {10,0,0}, -- 挂机加速
    {20,0,0}, -- 额外阵图
    {40,0,0}, -- 额外阵图
    {60,0,0}, -- 额外阵图
    {20,0,0}, -- 额外副本
    {40,0,0}, -- 额外副本
    {60,0,0}, -- 额外副本
    {2,0,0}, -- 立即完成副本
    {0,1500,0}, -- 副本自动
    {0,2500,0}, -- 副本自动
    {0,4000,0}, -- 副本自动
    {0,6000,0}, -- 副本自动
    {0,8500,0}, -- 副本自动
    {0,11500,0}, -- 副本自动
    {1,0,0}, -- 立即通天塔
    {0,1500,0}, -- 通天塔自动
    {0,2500,0}, -- 通天塔自动
    {0,4000,0}, -- 通天塔自动
    {0,6000,0}, -- 通天塔自动
    {0,8500,0}, -- 通天塔自动
    {1,0,0}, -- 师门立即完成
    {1,0,0}, -- 衙门立即完成
    {1,0,0}, -- 帮派立即完成
    {5,0,0}, -- 师门刷新
    {5,0,0}, -- 衙门刷新
    {20,0,0},-- 酒馆
    {0,50,0},-- 地图跳转
    {0,50,0},-- 书商刷新
    {0,10,0},-- 装备强化
    {0,10,0},-- 宝石合成
    {0,10,0},-- 宝石拆卸
    {0,10,0},-- 装备分解
    {0,0,0}
}

function GetMoney()
    return needmoney
end

