--升阶消耗
local UpCost = {
    --武器
    [1]={
        --目标阶数
        [1]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [2]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [3]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [4]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
    },
    --盾牌
    [2]={
        --目标阶数
        [1]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [2]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [3]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [4]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
    },
    --帽子
    [3]={
        --目标阶数
        [1]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [2]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [3]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [4]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
    },
    --胸甲
    [4]={
        --目标阶数
        [1]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [2]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [3]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [4]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
    },
    --鞋子
    [5]={
        --目标阶数
        [1]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [2]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [3]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [4]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
    },
    --项链
    [6]={
        --目标阶数
        [1]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [2]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [3]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
        [4]={
                --物品及数量
                [1]={{1,1},{2,1},{3,1}},
            },
    },
}

function UpgradeCost(player, cls, index, lev)
    local package = player:GetPackage()
    local cls = player:Get
    if index > #UpCost then
        return false
    end

    if lev > #UpCost[index] then
        return false
    end

    if cls > #UpCost[index][lev] then
        return false
    end
    
    local items = UpCost[index][lev][cls]

    for k = 1,#items do
        local count = package:GetItemCount(items[1][1])
        if count < items[1][2] then
            return false
        end
    end

    for k = 1,#items do
        local count = package:DelAllItem(items[1][1], items[1][2])
    end
    return true
end
