
local tripodaward = 
{
    -- 橙       紫      蓝      绿
    {50003,         50002,      50001,      50000}, -- 干材烈火
    {50007,         50006,      50005,      50004}, -- 貅目鑫火
    {50011,         50010,      50009,      50008}, -- 极地冽火
    {50015,         50014,      50013,      50012}, -- 盘木玄火
    {50019,         50018,      50017,      50016}, -- 炼狱冥火
    {50023,         50022,      50021,      50020}, -- 三昧真火
    {50027,         50026,      50025,      50024}  -- 九天离火
}

function GetTripodAward(fire)
    return tripodaward[fire]
end

