
AttrExtra = {
    strength = 0,
    physique = 0,
    agility = 0,
    intelligence = 0,
    will = 0,
    soul = 0,
    aura = 0,
    auraMax = 0,
    attack = 0,
    magatk = 0,
    defend = 0,
    magdef = 0,
    hp = 0,
    tough = 0,
    action = 0,
    hitrate = 0,
    evade = 0,
    critical = 0,
    criticaldmg = 0,
    pierce = 0,
    counter = 0,
    magres = 0
};

function AttrExtra:Instance(o)
	o = o or {};
	setmetatable(o, self);
	self.__index = self;
	return o;	
end

local minLevel = 40

local rareAnimals = {
    -- 力量 耐力 敏捷 智力 意志 元神 作用士气 最大灵气 物攻 法术攻击 物防 法术防御 HP 坚韧 身法 命中 闪避 暴击 暴击伤害 击破/护甲穿透 反击 法术抵抗
    [5489] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0},60,120,1},
    [5490] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0,0},60,150,1},
    [5491] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0},60,180,1},
    [5492] = {{0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0},60,210,1},
    [5493] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0,0,0},60,240,1},
    [5494] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0},60,270,2},
    [5495] = {{0,0,0,0,0,0,0,0,0,0,0,0,5,0,0,0,0,0,0,0,0,0},60,300,2},
    [5496] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0},60,330,2},
    [5497] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0},60,360,2},
    [5498] = {{0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0,0},60,390,2},
    [5499] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0},60,420,3},
    [5500] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,0,0,0,0,0,0,0},60,450,3},
    [5501] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,0},60,480,3},
    [5502] = {{5,0,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},60,510,3},
    [5503] = {{0,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,0,0,0,0,0,0},60,540,3},
    [5504] = {{0,0,5,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},60,570,4},
    [5505] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,0,0},60,600,4},
    [5506] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,0,0,0,0},60,600,4},
    [5507] = {{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,0,0,0,0,0},60,600,4},
    [5508] = {{0,0,0,0,0,0,25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},60,600,4},
}

--  奖励
local awards = {
    -- 物品ID 物品个数 概率
    {18, 10, 100},
    {19, 10, 100},
    {1210, 1, 100},
    {20, 11, 23},
    {12, 1, 250},
    {54, 1, 200},
    {1220, 1, 100},
    {0, 0, 0}, --  这一行必不可少
}

function loadRareAnimals()
    local attr = AttrExtra:Instance(AttrExtra)
    for k,v in pairs(rareAnimals)
    do
        attr.strength = v[1][1]
        attr.physique = v[1][2]
        attr.agility = v[1][3]
        attr.intelligence = v[1][4]
        attr.will = v[1][5]
        attr.soul = v[1][6]
        attr.aura = v[1][7]
        attr.auraMax = v[1][8]
        attr.attack = v[1][9]
        attr.magatk = v[1][10]
        attr.defend = v[1][11]
        attr.magdef = v[1][12]
        attr.hp = v[1][13]
        attr.tough = v[1][14]
        attr.action = v[1][15]
        attr.hitrate = v[1][16]
        attr.evade = v[1][17]
        attr.critical = v[1][18]
        attr.criticaldmg = v[1][19]
        attr.pierce = v[1][20]
        attr.counter = v[1][21]
        attr.magres = v[1][22]
        setRareAnimals(v[4], k, attr, v[2], v[3]);
    end

    -- here ^_^
    loadHIAwardsCfg()
end

function loadHIAwardsCfg()
    for k,v in pairs(awards)
    do
        addHIAwardsCfg(v[1], v[2], v[3]);
    end
end

