--id ->Heaven npcid, Inferno npcid, name, low_lev, hig_lev, count, maxQuality， flushGlod
LoopTasksDesc = {
	[1003] = {244+4096, 244+4096, "经验循环任务", 40, 120, 100, 10, 10},
	[1004] = {4212, 4212, "日常货币任务", 40, 100, 4, 0, 0},
};

--FIXME----------------
--TODO-----------------
--峨眉， 昆仑	
LoopTasksSet = {
	--[1001] = { {70101, 70102, 70103, 70104, 70105}, {70201, 70202, 70203, 70204, 70205} },
	--[1002] = { {70501}, {70502} },
	[1003] = { {70301, 70302, 70303, 70304, 70305, 70306, 70307, 70308, 70309, 70310}, 
			   {70301, 70302, 70303, 70304, 70305, 70306, 70307, 70308, 70309, 70310}
			 },
	[1004] = { {70317},
			   {70317}
			 },
	--[1005] = { {70503}, {70503} },
	--[1006] = { {70504}, {70504} },
};
	
--NPC -> LoopTaskId
LoopTasksNpc = {
	--[251+4096] = 1001,
	--[252+4096] = 1001,
	--[  4+4096] = 1002,
	--[250+4096] = 1002,
	[244+4096] = 1003,
	[4212] = 1004,
	--[116+4096] = 1005,
	--[115+4096] = 1006,
	};
	
--LoopTaskId -> AutoTaskId
LoopTasksAutoTaskId = {
	--[1001] = {70100, 70200},
	[1003] = {70300, 70300},
	--[1004] = {70400, 70400},
};

--TasksAutoTaskIdSet = { 70100, 70200, 70300, 70400  };
TasksAutoTaskIdSet = { 70300  };
--自动循环任务
	

--系统刷新任务颜色概率
--[4/10]:白色 [5/10]:绿色 [1/10]:蓝色
Task_Quality_Bound = {4, 9, 10};
Task_Quality_Faces = 10;

--手动白色->绿色概率
Task_Quality_White_Bound = {1};
Task_Quality_White_Faces = {1};

--手动绿色->蓝色概率
Task_Quality_Green_Bound = {1, 1, 1, 1, 1};
Task_Quality_Green_Faces = {5, 4, 3, 2, 1};

--手动蓝色->紫色概率
Task_Quality_Blue_Bound = { 1,  1,  1,  1,  1,  2,  2,  2,  2,  2,  3,  3, 3, 3, 3};
Task_Quality_Blue_Faces = {30, 29, 28, 27, 26, 25, 23, 21, 19, 17, 15, 12, 9, 6, 3};

--手动紫色->橙色概率
Task_Quality_Purple_Bound = {  1,   1,   1,   1,   2,   2,   2,   5,   5,   5,   5,   5,   5,   5,  10,  10,  10,  10,  15,  20, 20, 20, 15, 10, 10, 1, 1, 1, 1, 1};
Task_Quality_Purple_Faces = {200, 199, 198, 197, 196, 194, 192, 190, 185, 180, 175, 170, 165, 160, 155, 145, 135, 125, 115, 100, 80, 60, 40, 25, 15, 5, 4, 3, 2, 1};

--[[
--FOR CONFIG FILE	
function LoadAllLoopTasks()
	return {1001, 1002, 1003, 1004, 1005, 1006};
end
]]--
function LoadAllLoopTasks()
	return {1003, 1004};
end

function LoadAllLoopTaskTasks(loopTask)
	return LoopTasksSet[loopTask];
end


function LoadUnCheckTaskRelationTasks()
	return { 70101, 70102, 70103, 70104, 70105, 70201, 70202, 70203, 70204, 70205, 70301, 70302, 70303, 70304, 70305, 70306, 70307, 70308, 70309, 70310, 70311, 70312, 70313, 70314, 70315, 70316, 70317, 70318, 70319, 70320, 70100, 70200, 70300, 70400};
end
	

