sysMsg:set(10, 0x20, "[p:%u:%s] 招募了散仙 [f:%u:%s]")
sysMsg:set(11, 0x20, "[p:%u:%s] 解雇了散仙 [f:%u:%s]")

sysMsg:set(100, 0x35, "获得经验值%u")
sysMsg:set(101, 0x35, "升到了%u级")
sysMsg:set(102, 0x35, "获得了[4:%u]x%u")
sysMsg:set(103, 0x35, "获得了[4:%u]")
sysMsg:set(104, 0x35, "使用了[4:%u]")
sysMsg:set(105, 0x35, "获得荣誉%u")
sysMsg:set(106, 0x35, "花费了荣誉%u")
sysMsg:set(107, 0x35, "接受任务[5:%u]")
sysMsg:set(108, 0x35, "任务失败")
sysMsg:set(109, 0x35, "完成任务[5:%u]")
sysMsg:set(110, 0x35, "获得散仙[f:%u:%s]")
sysMsg:set(111, 0x35, "已解雇散仙[f:%u:%s]")
sysMsg:set(112, 0x35, "出价成功")
sysMsg:set(113, 0x35, "出价被超过")
sysMsg:set(114, 0x35, "背包已满")
sysMsg:set(115, 0x35, "物品已放入九疑鼎")
sysMsg:set(116, 0x35, "已出售物品")
sysMsg:set(117, 0x35, "")
sysMsg:set(118, 0x35, "该物品无法出售")
sysMsg:set(119, 0x35, "已发送申请加入「%s」")
sysMsg:set(120, 0x35, "创建帮派成功")
sysMsg:set(121, 0x35, "加入了帮派「%s」")
sysMsg:set(122, 0x35, "帮派被解散")
sysMsg:set(124, 0x35, "已退出帮派")
sysMsg:set(125, 0x35, "已被从帮派中移除")
sysMsg:set(126, 0x35, "帮派职位变更")
sysMsg:set(128, 0x35, "帮主职位移交")
sysMsg:set(129, 0x35, "成为了帮主")
sysMsg:set(130, 0x35, "")
sysMsg:set(131, 0x35, "")
sysMsg:set(132, 0x35, "添加好友成功")
sysMsg:set(133, 0x35, "添加好友失败")
sysMsg:set(134, 0x35, "删除好友成功")
sysMsg:set(135, 0x35, "添加黑名单成功")
sysMsg:set(136, 0x35, "添加黑名单失败")
sysMsg:set(137, 0x35, "有新的邮件")
sysMsg:set(138, 0x35, "邮件发送成功")
sysMsg:set(139, 0x35, "邮件删除成功")
sysMsg:set(140, 0x35, "邮箱已满")
sysMsg:set(141, 0x35, "已进入战场")
sysMsg:set(142, 0x35, "已退出战场")
sysMsg:set(144, 0x35, "已被[p:%u:%s]击败回城")
sysMsg:set(145, 0x35, "")
sysMsg:set(146, 0x35, "获得兽神感应+%u")
sysMsg:set(147, 0x35, "获得状态「%s」")
sysMsg:set(148, 0x35, "消耗仙缘%u")
sysMsg:set(149, 0x35, "获得仙石%u")
sysMsg:set(150, 0x35, "消费仙石%u")
sysMsg:set(151, 0x35, "获得银币%u")
sysMsg:set(152, 0x35, "消费银币%u")
sysMsg:set(153, 0x35, "")
sysMsg:set(154, 0x35, "")
sysMsg:set(155, 0x35, "获得礼券%u")
sysMsg:set(156, 0x35, "消费礼券%u")
sysMsg:set(157, 0x35, "消耗凤髓%u")
sysMsg:set(158, 0x35, "消耗龙元%u")
sysMsg:set(159, 0x35, "获得龙元%u")
sysMsg:set(160, 0x35, "获得凤髓%u")
sysMsg:set(161, 0x35, "获得仙缘%u")
sysMsg:set(162, 0x35, "学会[7:%u%u]")
sysMsg:set(163, 0x35, "消费龙魂%u")
sysMsg:set(164, 0x35, "获得龙魂%u")
sysMsg:set(165, 0x35, "消费帮派贡献%u")
sysMsg:set(166, 0x35, "获得帮派贡献%u")
sysMsg:set(167, 0x35, "获得天劫积分%u")
sysMsg:set(168, 0x35, "获得天劫贡献%u")
sysMsg:set(169, 1, "获得天劫积分%u")
sysMsg:set(170, 1, "获得天劫贡献%u")
sysMsg:set(171, 0x35, "不能放入九疑鼎")
sysMsg:set(172, 0x35, "不能出售物品")
sysMsg:set(173, 0x35, "获得末日之战血印%u")
sysMsg:set(174, 1, "获得末日之战血印%u")
sysMsg:set(175, 0x35, "获得仙蕴精华%u")
sysMsg:set(176, 1, "获得仙蕴精华%u")
sysMsg:set(177, 0x35, "消耗仙蕴精华%u")
sysMsg:set(178, 1, "消耗仙蕴精华%u")

sysMsg:set(181, 0x35, "未通过防沉迷认证，获得经验值减半")
sysMsg:set(182, 0x35, "未通过防沉迷认证，获得银币减半%u")
sysMsg:set(183, 0x35, "未通过防沉迷认证，获得减半铜钱%u")
sysMsg:set(184, 0x35, "未通过防沉迷认证，没有获得收益")

sysMsg:set(185, 0x35, "您获得%u点声望")
sysMsg:set(186, 0x35, "您消费%u点声望")

sysMsg:set(190, 0x35, "")

sysMsg:set(1000, 1, "[f:%u:%s]获得经验值%u")
sysMsg:set(1001, 1, "[f:%u:%s]升级了，等级提升到了%u")
sysMsg:set(1002, 1, "您获得了[4:%u]x%u")
sysMsg:set(1003, 1, "您获得了[4:%u]")
sysMsg:set(1004, 1, "您使用了[4:%u]")
sysMsg:set(1005, 1, "您获得%u点荣誉")
sysMsg:set(1006, 1, "您消费%u点荣誉")
sysMsg:set(1007, 1, "您接取了任务[5:%u]")
sysMsg:set(1008, 1, "任务[5:%u]失败了")
sysMsg:set(1009, 1, "您完成了任务[5:%u]")
sysMsg:set(1010, 1, "您招募了散仙[f:%u:%s]")
sysMsg:set(1011, 1, "您解雇了散仙[f:%u:%s]")
sysMsg:set(1012, 1, "您对[f:%u:%s]的竞拍成功")
sysMsg:set(1013, 1, "您对[f:%u:%s]的竞价被超过了")
sysMsg:set(1014, 1, "您的背包已满，无法再获得物品")
sysMsg:set(1015, 1, "物品成功加入九疑鼎")
sysMsg:set(1016, 1, "出售物品成功")
sysMsg:set(1017, 1, "")
sysMsg:set(1018, 1, "物品[4:%u]不可出售")
sysMsg:set(1019, 1, "申请加入「%s」成功")
sysMsg:set(1020, 1, "创建帮派「%s」成功")
sysMsg:set(1021, 1, "您加入了帮派「%s」")
sysMsg:set(1022, 1, "您解散了帮派「%s」")
sysMsg:set(1023, 1, "您所在的帮派「%s」被解散了")
sysMsg:set(1024, 1, "您退出了帮派「%s」")
sysMsg:set(1025, 1, "您被[p:%u:%s]从「%s」移除了")
sysMsg:set(1026, 1, "您被提升到「%s」")
sysMsg:set(1027, 1, "您被降为「%s」")
sysMsg:set(1028, 1, "您将帮主位置转让给了[p:%u:%s]")
sysMsg:set(1029, 1, "[p:%u:%s]将帮主的位置转让给您了，您成为了「%s」的帮主")
sysMsg:set(1030, 1, "")
sysMsg:set(1031, 1, "")
sysMsg:set(1032, 1, "您将[p:%u:%s]添加到好友名单")
sysMsg:set(1033, 1, "添加好友[p:%u:%s]失败")
sysMsg:set(1034, 1, "您从好友名单中移除了[p:%u:%s]")
sysMsg:set(1035, 1, "您将[p:%u:%s]添加到黑名单")
sysMsg:set(1036, 1, "添加[p:%u:%s]到黑名单失败")
sysMsg:set(1037, 1, "您收到新的邮件")
sysMsg:set(1040, 1, "您的信箱已满，无法接收更多邮件")
sysMsg:set(1041, 1, "您加入了阵营战，为[3:%u]出战")
sysMsg:set(1042, 1, "您离开了阵营战场")
sysMsg:set(1043, 1, "您在决斗中战胜了[p:%u:%s]")
sysMsg:set(1044, 1, "[p:%u:%s]在决斗中战胜了您")
sysMsg:set(1045, 1, "")
sysMsg:set(1046, 1, "您获得%u点兽神感应")
sysMsg:set(1047, 1, "您获得了「%s」效果")
sysMsg:set(1048, 1, "您消耗%u仙缘")
sysMsg:set(1049, 1, "您获得%u仙石")
sysMsg:set(1050, 1, "您消费%u仙石")
sysMsg:set(1051, 1, "您获得%u银币")
sysMsg:set(1052, 1, "您消费%u银币")
sysMsg:set(1053, 1, "")
sysMsg:set(1054, 1, "")
sysMsg:set(1055, 1, "您获得%u礼券")
sysMsg:set(1056, 1, "您消费%u礼券")
sysMsg:set(1057, 1, "您消耗%u凤髓")
sysMsg:set(1058, 1, "您消耗%u龙元")
sysMsg:set(1059, 1, "您获得%u龙元")
sysMsg:set(1060, 1, "您获得%u凤髓")
sysMsg:set(1061, 1, "您获得%u仙缘")
sysMsg:set(1062, 1, "[f:%u:%s]学会了[7:%u%u]")
sysMsg:set(1063, 1, "您消费%u龙魂")
sysMsg:set(1064, 1, "您获得%u龙魂")
sysMsg:set(1065, 1, "您消费%u帮派贡献")
sysMsg:set(1066, 1, "您获得%u帮派贡献")

sysMsg:set(1081, 1, "您未通过防沉迷认证，获得经验值减半")
sysMsg:set(1082, 1, "您未通过防沉迷认证，获得银币减半%u")
sysMsg:set(1083, 1, "您未通过防沉迷认证，获得减半铜钱%u")
sysMsg:set(1084, 1, "您未通过防沉迷认证，没有获得收益")

sysMsg:set(1090, 1, "您获得%u点声望")
sysMsg:set(1091, 1, "您消费%u点声望")

sysMsg:set(1092, 0x1, "QQ大厅特权额外获得%u经验")
sysMsg:set(1093, 0x35, "QQ大厅特权额外获得%u经验")
sysMsg:set(1094, 0x1, "3366特权额外获得%u经验")
sysMsg:set(1095, 0x35, "3366特权额外获得%u经验")
sysMsg:set(1096, 0x1, "QQ空间特权额外获得%u经验")
sysMsg:set(1097, 0x35, "QQ空间特权额外获得%u经验")
sysMsg:set(1098, 0x1, "朋友网特权额外获得%u经验")
sysMsg:set(1099, 0x35, "朋友网特权额外获得%u经验")
sysMsg:set(200, 0, "竞拍成功")
sysMsg:set(201, 0, "散仙名: %s\n请确认并接收散仙。")
sysMsg:set(202, 0, "竞拍价被超越")
sysMsg:set(203, 0, "您参与竞拍的散仙 %s 出价已经被超过。\n您之前出价的%u银币已经被退还。")
sysMsg:set(204, 0, "您的 %s 已经自动完成，请回到任务npc处交付并领取丰厚奖励。\n祝您游戏愉快！")
sysMsg:set(205, 0, "")
sysMsg:set(206, 0, "")
sysMsg:set(207, 0, "来自 [p:%u:%s] 的好友邀请")
sysMsg:set(208, 0, "[p:%u:%s] 邀请您成为好友。\n是否接受邀请？")
sysMsg:set(210, 0, "经验循环任务")
sysMsg:set(211, 0, "")
sysMsg:set(212, 0, "您已经接受了邀请")
sysMsg:set(213, 0, "您已经拒绝了邀请")
sysMsg:set(214, 0, "")
sysMsg:set(215, 0, "")
sysMsg:set(216, 0, "")
sysMsg:set(217, 0, "")
sysMsg:set(218, 0, "")
sysMsg:set(219, 0, "")
sysMsg:set(220, 0, "")
sysMsg:set(221, 0, "")
sysMsg:set(222, 0, "")
sysMsg:set(223, 0, "玩家 「%s」 申请加入帮派")
sysMsg:set(224, 0, "玩家 「%s」 申请加入您的帮派，请在帮派审请面板里查看。\n祝您游戏愉快！")
sysMsg:set(225, 0, "加入帮派的申请通过")
sysMsg:set(226, 0, "您的申请已被批准，恭喜加入帮派 「%s」。\n祝您游戏愉快！")
sysMsg:set(227, 0, "加入帮派的申请被拒绝")
sysMsg:set(228, 0, "您加入帮派 「%s」 的申请已被拒绝，请重新申请加入其他帮派。\n祝您游戏愉快！")
sysMsg:set(229, 0, "您已经被开除出帮派 「%s」")
sysMsg:set(230, 0, "很遗憾您已被开除出帮派 「%s」，您可以重新申请加入或创建帮派。\n祝您游戏愉快！")
sysMsg:set(231, 0, "击退强敌的奖励")
sysMsg:set(232, 0, "在本次帮派战中，您表现优异，获得累计 %u 经验\n在本次战斗%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(233, 0, "在本次帮派战中，您表现优异，获得高级挂机加速符、 %s、%s 和 累计 %u 经验\n在本次战斗%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(234, 0, "帮派奖励分配")
sysMsg:set(235, 0, "帮主给您分配了一些奖励物品，去帮派仓库查看吧！")
sysMsg:set(236, 0, "散仙经验返还提示")
sysMsg:set(237, 0, "%u级的散仙[f:%u:%s]离开之后，将自己一半经验值转为经验丹及60%的修为值转为修为丹赠送给您，请点击接受获取")

sysMsg:set(238, 0x16, "蜀山论剑即将开始，请各位玩家去斗剑擂台报名！")
sysMsg:set(239, 0x16, "蜀山论剑还剩%u分钟就要打响，请尽快报名！")

sysMsg:set(240, 0x16, "阵营战即将开始，请各位玩家去斗剑擂台报名！")
sysMsg:set(241, 0x16, "阵营战还剩%u分钟就要打响，请尽快报名！")
sysMsg:set(242, 0x16, "帮派战即将打响，大家快去报名啊！")
sysMsg:set(243, 0x16, "帮派战还有%u分钟就要打响，请尽快报名！")
sysMsg:set(244, 0x17, "[1:%u]对您说:我正在蜀山的[2:%u]，您有兴趣的话就快来找我吧。")
sysMsg:set(245, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n哥正无所事事，有没有人放马过来啊。")
sysMsg:set(246, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n哥等的不是寂寞，是收服。")
sysMsg:set(247, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n您们都怕了吗，哥只能孤独求败了吗。")
sysMsg:set(248, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n哥就是想看看，到底有没有人愿意在我面前大显身手。")
sysMsg:set(249, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n天下英雄，惟使君与操耳。我已在此，使君何在？")
sysMsg:set(250, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n您若想要太平盛世，就别来惹我！")
sysMsg:set(251, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n姐等了好久了，怎么还没有人来啊，您们都别打酱油了。")
sysMsg:set(252, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n姐就是不想再宅在这里了，怎么就没个人成全下呢。")
sysMsg:set(253, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n妾身在此已千年之久，望有心人士快快寻来。")

sysMsg:set(254, 0, "首次充值有礼")
sysMsg:set(255, 0, "亲爱的玩家您好：\n感谢您对《蜀山传奇》的热情支持，您的首次充值礼包可以点击下方接受领取。在接受礼物的时候请为背包预留足够的空间哦。首次充值礼包内含：高级挂机加速符x2，太乙精金x10，五行真金x10，补髓益元丹x2，凝神易筋丹x2，让您畅游蜀山剑侠的世界，谱写自己传奇。")

sysMsg:set(256, 0, "VIP充值有礼")
sysMsg:set(257, 0, "亲爱的玩家您好：\n感谢您支持《蜀山传奇》，请点击下方接受领取您的 [4:%u]。在接受礼物的时候请为背包预留足够的空间哦。")

sysMsg:set(259, 0x16, "发生在[2:%u]的阵营战已结束，最终不相上下打成平手。双方所有参战玩家都将获得一定经验加成奖励。")
sysMsg:set(260, 0x16, "发生在[2:%u]的阵营战已结束，[3:%u]赢得了胜利。双方所有参战玩家都将获得一定经验加成奖励。")
sysMsg:set(261, 0, "阵营奖励")
sysMsg:set(262, 0, "感谢您参加今日的阵营战，您的神勇使门派取得了最终胜利，也为您赢得 %u 荣誉与 %u 个高级挂机加速符。您赢了%u场，输了%u场。最高连胜%u场")
sysMsg:set(263, 0, "感谢您参加今日的阵营战，虽然您的门派输掉了阵营战，但您的英勇表现仍然为您赢得了 %u 荣誉与 %u 个初级挂机加速符。您赢了%u场，输了%u场。最高连胜%u场")
sysMsg:set(264, 0, "感谢您参加今日的阵营战，双方僵持良久不相上下，您的奋战为您赢得 %u 荣誉与 %u 个初级挂机加速符。您赢了%u场，输了%u场。最高连胜%u场")

sysMsg:set(265, 0x17, "世界BOSS目前伤害排名：第一名[p:%u:%s] %u%%、第二名[p:%u:%s] %u%%、第三名[p:%u:%s] %u%%")
sysMsg:set(266, 0x17, "世界BOSS目前伤害排名：第一名[p:%u:%s] %u%%、第二名[p:%u:%s] %u%%")
sysMsg:set(267, 0x17, "世界BOSS目前伤害排名：第一名[p:%u:%s] %u%%")
sysMsg:set(268, 0, "蜀山论剑奖励")
sysMsg:set(269, 0, "您在本次蜀山论剑中，共获胜 %u 场，失败 %u 场，最高达到 %u 连杀，完成 %u 个成就（成就荣誉 %u )，共获得荣誉 %u ；您的荣誉徽章为 %u 级，可额外获得 %u 荣誉以及相应道具奖励！")

sysMsg:set(270, 0x17, "[p:%u:%s]历尽了千难万险，在副本\"%s\"第%u层获得了%s")
sysMsg:set(271, 0x17, "[p:%u:%s]幸运地从[4:%u]中开出了[4:%u]")
sysMsg:set(272, 0x17, "恭喜[p:%u:%s]首次打败\"%s\"的最终Boss，通关胜利！")

sysMsg:set(275, 0x27, "[p:%u:%s]强化[4:%u]到+%u成功！")

sysMsg:set(276, 0, "在本次帮派战中，您表现优异，获得高级挂机加速符、 %s 和 累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(278, 0, "在本次帮派战中，您表现优异，获得%s和累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(279, 0x17, "今日帮派战%s的第1名是[p:%u:%s]，他将获得%s、%s。排名第2的是[p:%u:%s]，排名第3的是[p:%u:%s]。")
sysMsg:set(280, 0, "恭喜您在帮派战中，身先士卒，第一个对%s造成伤害，特此奖励您50银币")
sysMsg:set(281, 0, "恭喜您在帮派战中，身先士卒，第一个对%s造成伤害，特此奖励您%s")
sysMsg:set(282, 0x17, "[p:%u:%s]身先士卒，第一个对%s造成伤害，获得特殊奖励。")

sysMsg:set(283, 0, "蓝钻贵族每日寻宝令")
sysMsg:set(284, 0, "通过有游戏内蓝钻按钮开通蓝钻会员每日都可领取寻宝令，还有更多精彩特权（每日礼包，购买仙石8折优惠，vip特权专享）等你来体验。")
sysMsg:set(285, 0, "黄钻会员每日寻宝令")
sysMsg:set(286, 0, "通过有游戏内黄钻按钮开通黄钻会员每日都可领取寻宝令，还有更多精彩特权（每日礼包，购买仙石8折优惠，vip特权专享）等你来体验。")
sysMsg:set(287, 0, "QQ会员每日寻宝令")
sysMsg:set(288, 0, "通过有游戏内QQ会员按钮开通QQ会员每日都可领取寻宝令，还有更多精彩特权（每日礼包，购买仙石8折优惠，vip特权专享）等你来体验。")

sysMsg:set(289, 0, "蜀山论剑荣誉王奖励")
sysMsg:set(290, 0, "恭喜您获得了本次蜀山论剑的荣誉王，可额外获得宝箱大礼一份，请注意接收！")
sysMsg:set(291, 0, "蜀山论剑连杀王奖励")
sysMsg:set(292, 0, "恭喜您获得了本次蜀山论剑的连杀王，可额外获得宝箱大礼一份，请注意接收！")
sysMsg:set(293, 0x17, "恭喜[p:%u:%s]在本次蜀山论剑中获得【%u】荣誉，获得本次蜀山论剑荣誉王！富有四海，万人称颂！")
sysMsg:set(294, 0x17, "恭喜[p:%u:%s]在本次蜀山论剑中达到【%u】连杀，获得本次蜀山论剑连杀王！论剑天下，谁与争锋！")
sysMsg:set(295, 0x27, "恭喜玩家[p:%u:%s]在水晶宫探宝时获得了[4:%u]x1，真是人品大爆发啊！")
sysMsg:set(296, 0, "金蛇献瑞 聚福兆祥")
sysMsg:set(297, 0, "恭喜您参加此次活动，请点击领取您的奖励。此次是第 %u 次（一共可领取 %u 次）")
sysMsg:set(298, 0, "金蛇献瑞活动额外奖励")
sysMsg:set(299, 0, "您好，本邮件是金蛇献瑞，聚福兆祥活动领完%u次奖励之后的额外奖励，请查收！")
sysMsg:set(300, 0x17, "恭喜[p:%u:%s]从女娲石盘中获得了【%u】礼券！大家一起来沾沾他的福气吧～")

sysMsg:set(304, 0, "交易成功,背包已满")
sysMsg:set(305, 0, "交易失败,背包已满")
sysMsg:set(306, 0, "您有%d件物品需要接受!")

sysMsg:set(307, 0, "购买成功")
sysMsg:set(308, 0, "您成功购买了%s")
sysMsg:set(309, 0, "寄售失败")
sysMsg:set(310, 0, "您撤销了寄售物品%s")
sysMsg:set(311, 0, "您的寄售时间已到，请收回物品")
sysMsg:set(312, 0, "寄售成功")
sysMsg:set(313, 0, "")
sysMsg:set(314, 0, "恭喜，您成功将%s出售给%s，所得%u仙石已入账，无需邮件接取。")

-- 斗剑场（315-332 339 - 342）
sysMsg:set(315, 0, "经验")
sysMsg:set(316, 0, "银币")
sysMsg:set(317, 0, "礼券")
sysMsg:set(339, 0, "")
sysMsg:set(356, 0, "荣誉")

sysMsg:set(340, 0, "绿色%s宝箱")
sysMsg:set(341, 0, "蓝色%s宝箱")
sysMsg:set(342, 0, "紫色%s宝箱")
sysMsg:set(357, 0, "橙色%s宝箱")
sysMsg:set(358, 0x17, "[p:%u:%s] 成为了今日的跨服斗剑场霸主，夺得【跨服第一】之名，获得了[4:%u]")

sysMsg:set(318, 0, "斗剑场邮件")
sysMsg:set(319, 0, "%s在斗剑场对您发起挑战，经过一番苦战，您不幸被打败。%s抢走了您的%s，抢走%u%s。")
sysMsg:set(320, 0, "恭喜您到了30级，现在可以进入斗剑场与其他玩家进行竞技了。点击最下方工具栏中的“斗剑”按钮进入竞技。斗剑场内的所有战斗都不会有任何损耗，并且还有经验、礼券、银币宝箱等丰厚奖励。")
sysMsg:set(321, 0, "恭喜您进阶到高级斗剑场，适应等级50级以上。您的排名在新的斗剑场中将被重新排序。")
sysMsg:set(325, 0, "恭喜您保住了斗剑场第%u名的名次，今天您获得奖励：[4:%u]x%u\n请在点击接受前确保背包留出足够的空间。\n斗剑场名次越高奖励越好，祝您玩得开心！")

sysMsg:set(326, 0, "%s")
sysMsg:set(327, 0, "")
sysMsg:set(328, 0, "")
sysMsg:set(329, 0, "")
sysMsg:set(330, 0x17, "[p:%u:%s] 成为了今日的斗剑场霸主，夺得【天下第一】之名,获得了[4:%u], 第 2 名至第 10 名分别获得相应奖励")
sysMsg:set(331, 0x27, "")
sysMsg:set(332, 0x27, "")
sysMsg:set(333, 0, "")
sysMsg:set(334, 0x17, "[p:%u:%s] 成为了今日的斗剑场霸主，夺得【天下第一】之名")

sysMsg:set(322, 0x27, "%s在斗剑场连胜%d场，势不可挡。")
sysMsg:set(323, 0x27, "%s挑战斗剑场第一名%s成功，顺利登顶全服榜首！")
sysMsg:set(324, 0x27, "%s成功地守护住了自己的第一名霸主地位！")

-- 奖励系统
sysMsg:set(335, 0x27, "")
sysMsg:set(336, 0x27, "")
sysMsg:set(337, 0x27, "")
sysMsg:set(338, 0x27, "")
sysMsg:set(343, 0, "")
sysMsg:set(344, 0x27, "")
sysMsg:set(345, 0x27, "")
sysMsg:set(346, 0, "")

sysMsg:set(347, 0x27, "[p:%u:%s]成功将[p:%u:%s]击败")

sysMsg:set(348, 0, "帮派邀请")
sysMsg:set(349, 0, "%s邀请您加入帮派%s")
sysMsg:set(350, 0, "帮派结盟")
sysMsg:set(351, 0, "%s的帮主%s恳请与您结盟，您是否允诺？结盟后您的帮派将多一个朋友，在双方帮派战开放期间可进入城内参与战斗。")
sysMsg:set(352, 0, "%s的帮主%s同意了您的请求。")
sysMsg:set(353, 0, "%s的帮主%s拒绝了您的请求。")
sysMsg:set(354, 0, "%s的帮主%s与您解除同盟关系。")
sysMsg:set(355, 0, "帮派解盟")

sysMsg:set(360, 0, "")
sysMsg:set(361, 0, "")
sysMsg:set(362, 0x27, "")
sysMsg:set(363, 0, "")
sysMsg:set(364, 0, "")

sysMsg:set(370, 0x27, "")
sysMsg:set(371, 0x27, "")

sysMsg:set(375, 0x27, "")
sysMsg:set(376, 0x27, "")

sysMsg:set(10000, 0, " [p:%u:%s] ")
sysMsg:set(10001, 0, " [f:%u:%s] ")
sysMsg:set(10002, 0, " [4:%u]")
sysMsg:set(10003, 0, " [4:%u]x%u")

sysMsg:set(500, 1, "")
sysMsg:set(600, 1, "查询玩家: (%llu) %s  等级: %u")
sysMsg:set(601, 1, "所在地点: %s %s")
sysMsg:set(602, 1, "仙石: %u  礼券: %u")
sysMsg:set(603, 1, "银币: %u")
sysMsg:set(604, 1, "%u - [f:%u:%s]  等级: %u  潜力: %g")
sysMsg:set(609, 1, "国家: %u");
sysMsg:set(610, 1, "测试攻击 %s(%u) 第%u层，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(611, 1, "测试攻击 %s，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(611, 1, "测试 %s 攻击 %s，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(612, 1, "是否在线: %s")
sysMsg:set(613, 1, "免费副本次数: %u, 收费副本次数: %u")
sysMsg:set(614, 1, "免费阵图次数: %u, 收费阵图次数: %u")
sysMsg:set(620, 1, "当前在线人数: %u");
sysMsg:set(621, 1, "目标据点[0x%x]不可达");
sysMsg:set(622, 1, "所在线程: 0x%x");

sysMsg:set(623, 1, "玩家战力: %u")
sysMsg:set(624, 1, "散仙[%s]: %u")

sysMsg:set(400, 0x27, "")
sysMsg:set(401, 0x27, "")
sysMsg:set(402, 0x27, "")
sysMsg:set(403, 0x26, "")
sysMsg:set(404, 0x27, "")
sysMsg:set(405, 0x27, "")
sysMsg:set(406, 0, "散仙修炼");
sysMsg:set(407, 0, "您的散仙%s已完成修炼，花费%u仙石，获得了%u点经验。");
sysMsg:set(408, 0, "您的散仙%s已完成修炼，花费%u银币，获得了%u点经验。");
sysMsg:set(409, 0, "您的散仙%s已完成修炼，花费%u仙石，获得了%u点经验。返还仙石%u。");

sysMsg:set(410, 0, "您的散仙%s已完成修炼，花费%u银币，获得了%u点经验。返还银币%u。");
sysMsg:set(411, 0, "")
sysMsg:set(412, 0, "")
sysMsg:set(413, 0, "")
sysMsg:set(414, 0, "")
sysMsg:set(415, 0, "")
sysMsg:set(416, 0x35, "")

sysMsg:set(417, 0x35, "")
sysMsg:set(418, 0x35, "")
sysMsg:set(419, 0x35, "")
sysMsg:set(420, 0x35, "")
sysMsg:set(421, 0x35, "")
sysMsg:set(422, 0x35, "")
sysMsg:set(423, 0x35, "")
sysMsg:set(424, 0x35, "")

sysMsg:set(425, 0x35, "")

sysMsg:set(426, 0x35, "")
sysMsg:set(427, 0x35, "")
sysMsg:set(428, 0x35, "")
sysMsg:set(429, 0x45, "")
sysMsg:set(430, 0x45, "%s捐献了%u银币")
sysMsg:set(431, 0x35, "")

sysMsg:set(440, 0, "")
sysMsg:set(441, 0, "")
sysMsg:set(442, 0, "")
sysMsg:set(443, 0, "")
sysMsg:set(444, 0, "")
sysMsg:set(445, 0, "")
sysMsg:set(446, 0x35, "")
sysMsg:set(447, 0, "")
sysMsg:set(448, 0x25, "")
sysMsg:set(449, 0x25, "")
sysMsg:set(450, 0x25, "")
sysMsg:set(451, 0x25, "")
sysMsg:set(452, 0, "")
sysMsg:set(453, 0, "")
sysMsg:set(454, 0, "")
sysMsg:set(455, 0, "")
sysMsg:set(456, 0x26, "")
sysMsg:set(457, 0x26, "")
sysMsg:set(458, 0x25, "")
sysMsg:set(459, 0x25, "")

sysMsg:set(460, 0x45, "%s加入了帮派");
sysMsg:set(461, 0x45, "%s离开了帮派");
sysMsg:set(462, 0x45, "与%s结盟了");
sysMsg:set(463, 0x45, "与%s解盟了");

sysMsg:set(464, 0, "")
sysMsg:set(465, 0, "")

sysMsg:set(479, 0, "")
sysMsg:set(480, 0, "")
sysMsg:set(481, 0, "")
sysMsg:set(482, 0, "")
sysMsg:set(483, 0, "")
sysMsg:set(484, 0, "")
sysMsg:set(485, 0, "")
sysMsg:set(486, 0, "")
sysMsg:set(487, 0, "")
sysMsg:set(488, 0, "")
sysMsg:set(489, 0, "")
sysMsg:set(490, 0, "")
sysMsg:set(491, 0, "")
sysMsg:set(492, 0, "")
sysMsg:set(493, 0, "")
sysMsg:set(494, 0, "")
sysMsg:set(495, 0, "")
sysMsg:set(496, 0, "")
sysMsg:set(497, 0, "")
sysMsg:set(498, 0, "")
sysMsg:set(499, 0, "")
sysMsg:set(500, 0, "")
sysMsg:set(501, 0, "")
sysMsg:set(502, 0, "")
sysMsg:set(503, 0, "")
sysMsg:set(504, 0, "")
sysMsg:set(505, 0, "")
sysMsg:set(506, 0, "")

sysMsg:set(510, 0x25, "")
sysMsg:set(511, 0x25, "")
sysMsg:set(512, 0x25, "")
sysMsg:set(513, 0x25, "")
sysMsg:set(514, 0x25, "")
sysMsg:set(515, 0x25, "")
sysMsg:set(516, 0x25, "")
sysMsg:set(517, 0x25, "")

sysMsg:set(518, 0x35, "")
sysMsg:set(519, 0x35, "")

sysMsg:set(520, 0, "")
sysMsg:set(521, 0, "")
sysMsg:set(522, 0, "")
sysMsg:set(523, 0, "")
sysMsg:set(524, 0, "")
sysMsg:set(525, 0, "")
sysMsg:set(526, 0, "")

sysMsg:set(527, 0x26, "")
sysMsg:set(528, 0x26, "")
sysMsg:set(529, 0x26, "")
sysMsg:set(530, 0, "")

sysMsg:set(540, 0, "")
sysMsg:set(541, 0, "")

sysMsg:set(545, 0, "")
sysMsg:set(546, 0, "")
sysMsg:set(547, 0x16, "%u分钟后世界BOSS即将出现在某个神秘的地方")
sysMsg:set(548, 0x16, "玩家[p:%u:%s]已经将世界BOSS[1:%u]的血量消耗至 %u%%");
sysMsg:set(549, 0x16, "世界BOSS已经神秘地出现在[2:%u]，大家快快行动起来，把这万恶之源揪出来，杀死它，会有惊喜哦！！！")
sysMsg:set(550, 0x27, "世界BOSS[1:%u]说: 我很后悔啊，做BOSS为什么要那么高调呢？不过你们也别太得意，我会再回来的。。。");
sysMsg:set(551, 0x35, "世界BOSS已经消失");
sysMsg:set(552, 0x16, "玩家[p:%u:%s]在[2:%u]打败世界BOSS第%u个元神 [1:%u]");
sysMsg:set(553, 0x27, "世界BOSS[1:%u]说: 你们以为这么简单就可以杀死我吗？我的真身被尘封了几百年，终于得见天日，我会把你们都撕成碎片，哈哈哈！！！");
sysMsg:set(554, 0x16, "世界BOSS[1:%u]横空出世，在[2:%u]掀起腥风血雨，大家快快行动起来，把[1:%u]消灭，会有惊喜哦！！！")
sysMsg:set(557, 0x16, "世界BOSS奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u");
sysMsg:set(558, 0x27, "世界BOSS奖励，第4名~第10名获得了: [4:%u]x%u");
sysMsg:set(571, 0x27, "世界BOSS奖励，第11名~第20名获得了: [4:%u]x%u");
sysMsg:set(559, 0x27, "世界BOSS击杀奖励，[p:%u:%s]获得了: [4:%u]x%u, %u银币");
sysMsg:set(560, 0x27, "世界BOSS幸运奖励，[p:%u:%s]获得了: [4:%u]x%u");
sysMsg:set(561, 0x27, "世界BOSS幸运奖励，[p:%u:%s]获得了: [4:%u]");
sysMsg:set(562, 0, "世界BOSS幸运奖励");
sysMsg:set(563, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得幸运奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(564, 0, "世界BOSS伤害排名奖励");
sysMsg:set(565, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得伤害排名奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(566, 0, "世界BOSS击杀奖励");
sysMsg:set(567, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得击杀奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(568, 0, "世界BOSS击退奖励");
sysMsg:set(569, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得击退奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(570, 0x16, "世界BOSS[1:%u]说: 哈哈！你们太无能了！！！平平安安，又到整点！！！不陪你们玩了，我妈喊我回家吃饭了！！！");

--天劫消息
sysMsg:set(5000, 0x16, "[p:%u:%s] 升级到%u级,天地为之颤动");
sysMsg:set(5001, 0x16, "神秘声音：流星陨落，划破天际，正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5002, 0x16, "%u分钟后天劫事件将开启");
sysMsg:set(5003, 0x16, "[p:%u:%s] 成为了积分榜的第一名");
--第一个事件
sysMsg:set(5010, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5011, 0x16, "[11:%u:%u]的线索已经收集了 %u%%");
sysMsg:set(5012, 0x27, "[p:%u:%s]在[2:%u]杀死了[1:%u]");
sysMsg:set(5013, 0x16, "神秘声音：[11:%u:%u]的线索已经全部收集，这次混乱乃是劫兆，天劫将至，剑侠们请继续平息混乱，寻找破劫之法。");
sysMsg:set(5014, 0x16, "混乱暂时被平息了，但天劫依旧存在，剑侠们请寻找破劫之法。");
--第二个事件
sysMsg:set(5020, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5021, 0x16, "[11:%u:%u]已经解封 %u%%");
sysMsg:set(5022, 0x16, "神秘声音：[11:%u:%u]已经解封，但他的能量还不稳定，剑侠们请维持[11:%u:%u]的法力，这将是破劫关键");
sysMsg:set(5023, 0x16, "[11:%u:%u]已经稳定了，但还需要更多的能量才能发挥破劫的作用，剑侠们请继续维持他的法力迎接天劫。");
--第三个事件
sysMsg:set(5030, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5031, 0x16, "[11:%u:%u]已经冲破了 %u%%");
sysMsg:set(5032, 0x16, "神秘声音：[11:%u:%u]已经冲破，但不知为何他并未消失，并变得更为强大，剑侠们请速速破阵，拯救苍生，渡过天劫。");
sysMsg:set(5033, 0x16, "[11:%u:%u]的法力渐渐虚弱，但仍有复苏之象，剑侠们请保持对天雷残阵的攻势，决不能让天劫降临。");
sysMsg:set(5034, 0x27, "[p:%u:%s]打破[11:%u:%u]第%u层");
--第四个事件
sysMsg:set(5040, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5041, 0x16, "天劫被破劫皇者[p:%u:%s]成功打破，万物又回归正常，感谢你[p:%u:%s]");
--奖励和邮件
sysMsg:set(5050, 0x27, "天劫积分排名奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u");
sysMsg:set(5051, 0x27, "天劫贡献排名奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u, [4:%u]x%u");
sysMsg:set(5052, 0,    "天劫排名奖励");
sysMsg:set(5053, 0, "感谢您参加今日的天劫事件活动，您获得排名奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5054, 0,    "天劫积分奖励");
sysMsg:set(5055, 0, "感谢您参加今日的天劫事件活动，您获得积分奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5056, 0,    "天劫贡献奖励");
sysMsg:set(5057, 0, "感谢您参加天劫活动，您获得贡献奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5058, 0,    "天劫等级奖励");
sysMsg:set(5059, 0, "天劫活动结束，您等级大于天劫等级,获得了奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5060, 0x27, "天劫BOSS伤害排名奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u，贡献:%u");
sysMsg:set(5061, 0,    "劫数事件渡过奖励");
sysMsg:set(5062, 0, "感谢您参加今日的天劫事件活动，您获得劫数渡过奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5063, 0,    "破劫皇者奖励");
sysMsg:set(5064, 0, "感谢您参加天劫活动，您获得破劫皇者称号卡，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5065, 0,    "天劫贡献排名特殊奖励");
sysMsg:set(5066, 0, "感谢您参加天劫事件活动，您获得贡献排名特殊奖励，请点击“接受物品”按钮获取奖励。");
--特殊天劫的4个提示
sysMsg:set(5067, 0x16, "神秘声音：妖族在蜀山各地突然出现，剑侠们速速前往将其平息祸乱，查明事情缘由。");
sysMsg:set(5068, 0x16, "神秘声音：上古龙界中出现的龙族在到达蜀山时，被妖皇重创，需要仙元恢复，剑侠们请赶紧帮助他们。");
sysMsg:set(5069, 0x16, "龙族已经恢复 %u%%");
sysMsg:set(5070, 0x16, "神秘声音：上古龙皇已经恢复元气，但他还需要更多仙元，来治疗其他的上古龙族。");
sysMsg:set(5071, 0x16, "神秘声音：上古龙族感谢蜀山剑侠的救助，并告知了了一个惊人的事实，上古妖皇乃是不死之身，唯有龙族的上古秘箓才可将其封印，剑侠们请帮助他们。");
sysMsg:set(5072, 0x16, "百蛮山之巅中突然出现一万妖阵，意图将整个蜀山纳入妖族的控制，剑侠们速速前往阻止妖皇的阴谋。");
sysMsg:set(5073, 0x16, "万妖神国！！哈哈哈哈哈哈哈！");
sysMsg:set(5074, 0x16, "万妖皇被破劫皇者[p:%u:%s]成功封印，万物又回归正常，感谢你[p:%u:%s]");
sysMsg:set(5075, 0x16, "神秘声音：[11:%u:%u]的线索已经全部收集，所有线索均指向泰山之巅，但蜀山各地妖族肆虐，剑侠们请先平息祸乱。 ");
sysMsg:set(5076, 0x16, "各地妖族势力锐减，残党均逃向泰山，而此时泰山之巅出现一漩涡秘境，无尽的妖族从其中涌出，同时有一股神秘的龙族势力正在与他们交战，剑侠们请速速消灭妖族，寻找事情的真相。");
sysMsg:set(5077, 0x16, "神秘声音：[11:%u:%u]已经冲破，但不知为何他并未消失，并变得更为强大，剑侠们请速速破阵，拯救苍生，渡过天劫。");
sysMsg:set(5078, 0x16, "[11:%u:%u]的法力渐渐虚弱，但仍有复苏之象，剑侠们请保持对[11:%u:%u]的攻势，决不能让妖皇的阴谋得逞。");

--消费太酬宾
sysMsg:set(5100, 0, "商城消费返礼");
sysMsg:set(5101, 0, "商城消费返礼");
sysMsg:set(5102, 0, "你在商城消费大酬宾活动中消费了%u仙石,获得返礼%u礼券");
sysMsg:set(5103, 0, "商城消费返利提示");
sysMsg:set(5104, 0, "您在商城消费返礼活动中消费达到%u仙石，您将在10月24日收到返还的%u礼券，11月24日收到返还的%u礼券");

--帮派副本
sysMsg:set(800, 0, "帮派副本通关奖励");
sysMsg:set(801, 0, "帮派副本通关奖励。");
sysMsg:set(805, 0x16, "%s 成为了全服第一个夺得谪仙深渊第%u层的帮派。");
sysMsg:set(806, 0x45, "%s 开启了帮派副本，大家赶紧传送前往吧。");
sysMsg:set(807, 0x45, "%s 关闭了帮派副本。");
--帮派副本End
sysMsg:set(555, 0, "自动副本掉落物品")
sysMsg:set(556, 0, "在自动副本时掉落的物品无法放入包裹，以邮件的形式发送给玩家，请查收!")

sysMsg:set(700, 0x16, "")
sysMsg:set(701, 0x15, "")
sysMsg:set(702, 0x15, "")
sysMsg:set(703, 0x15, "")
sysMsg:set(704, 0x15, "")
sysMsg:set(705, 0x15, "")

sysMsg:set(709, 0, "")
sysMsg:set(710, 0, "天榜")
sysMsg:set(711, 0, "地榜")
sysMsg:set(712, 0, "仙界第一%s赛成功晋级%s")
sysMsg:set(713, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，获得了%d点龙魂，并成功晋级%s！（龙魂自动发放无需领取）")
sysMsg:set(714, 0, "仙界第一%s赛不幸淘汰")
sysMsg:set(715, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，获得了%d点龙魂，不幸被淘汰。（龙魂自动发放无需领取）")

sysMsg:set(716, 0, "")
sysMsg:set(717, 0, "")
sysMsg:set(718, 0, "")
sysMsg:set(719, 0, "")
sysMsg:set(720, 0, "仙界第一%s赛%s成功晋级")
sysMsg:set(721, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，并成功晋级！。")
sysMsg:set(722, 0, "仙界第一%s赛%s不幸淘汰")
sysMsg:set(723, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，不幸被淘汰，您排名奖励将会在周日仙界第一斗剑大会结束时发放")
sysMsg:set(724, 0, "仙界第一%s排名奖励")
sysMsg:set(725, 0, "感谢您参加第%d届仙界第一斗剑大会，根据您在本届比赛中排名，获得了%d点龙魂，及宝箱奖励，请点击“接受物品”按钮领取宝箱。（龙魂自动发放无需领取）")
sysMsg:set(726, 0, "")
sysMsg:set(727, 0, "")
sysMsg:set(728, 0, "")
sysMsg:set(729, 0, "")

sysMsg:set(730, 0, "仙界第一%s赛 %s 晋级")
sysMsg:set(731, 0, "感谢您关注第%d届仙界第一斗剑大会，您在本届的%s赛中支持的选手 %s 成功晋级，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(732, 0, "仙界第一%s赛 %s 未能晋级")
sysMsg:set(733, 0, "感谢您关注第%d届仙界第一斗剑大会，您在本届的%s赛中支持的选手 %s  未能晋级")
sysMsg:set(734, 0, "")

sysMsg:set(735, 0, "当前世界BOSS血量：%u")

sysMsg:set(736, 0, "场外活动奖励")
sysMsg:set(737, 0, "由于您支持的选手获得%u名，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(738, 0, "由于您最后一击补刀，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(739, 0, "活动人气奖励")
sysMsg:set(740, 0, "恭喜您在仙界第一斗剑大会比赛中，人气爆满，获得一份惊喜奖励！")

sysMsg:set(780, 0, "全球")
sysMsg:set(781, 0, "入围")
sysMsg:set(782, 0, "32强")
sysMsg:set(783, 0, "16强")
sysMsg:set(784, 0, "8强")
sysMsg:set(785, 0, "4强")
sysMsg:set(786, 0, "半决")
sysMsg:set(787, 0, "决")


sysMsg:set(871, 0, "天榜")
sysMsg:set(872, 0, "地榜")
sysMsg:set(873, 0, "金榜")
sysMsg:set(874, 0, "银榜")
sysMsg:set(875, 0, "星榜")
sysMsg:set(876, 0, "月榜")
sysMsg:set(878, 0, "胜")
sysMsg:set(879, 0, "负")

sysMsg:set(880, 0, "%s邮件提示")
sysMsg:set(881, 0, "单职业竞技")
sysMsg:set(882, 0, "策略风暴竞技")
sysMsg:set(883, 0, "全明星竞技")
sysMsg:set(884, 0, "逆转乾坤")
sysMsg:set(885, 0, "人气达人")

sysMsg:set(886, 0, "在刚刚结束的%s筛选赛中, 您经过不断的努力成功进入%s，获得了参加%s淘汰赛资格。")
sysMsg:set(887, 0, "在刚刚结束的%s筛选赛中, 您不幸落败，请继续努力，希望能在下一届活动中取得更好的名次。")
sysMsg:set(888, 0, "简报：%s")
sysMsg:set(889, 0, "%s VS %s %s")
sysMsg:set(890, 0, "在刚刚结束的%s决赛中，您经过艰难的战斗最终成功获得了%s活动的第%d名，希望再接再厉能够在接下来的活动中取得更好的名次。")

sysMsg:set(891, 0, "单职业活动奖励")
sysMsg:set(892, 0, "在本次活动中，您获得积分排名第%d名的奖励")
sysMsg:set(893, 0, "队伍%d VS 队伍%d %s")
sysMsg:set(894, 0, "在本次活动中，您获得积分排名第%d名的奖励以及 7天限时称号“儒尊”")
sysMsg:set(895, 0, "在本次活动中，您获得积分排名第%d名的奖励以及 7天限时称号“释尊”")
sysMsg:set(896, 0, "在本次活动中，您获得积分排名第%d名的奖励以及 7天限时称号“道尊”")

sysMsg:set(1071, 1, "不能放入九疑鼎")
sysMsg:set(1072, 1, "不能出售物品")

sysMsg:set(2000, 0, "修炼洞府被抢占")
sysMsg:set(2001, 0, "剑仙 %s 见您的修炼洞府灵气浓郁,便蛮横地占为己有,您无奈之下去了无主之地")
sysMsg:set(2002, 0, "火种制作成功")
sysMsg:set(2003, 0, "火种制作失败，没有相关物品")

sysMsg:set(2004, 0x35, "[f:%u:%s]获得修为值%u")
sysMsg:set(2005, 1, "[f:%u:%s]获得修为值%u")
sysMsg:set(2006, 0x35, "[f:%u:%s]消耗修为值%u")
sysMsg:set(2007, 1, "[f:%u:%s]消耗修为值%u")
sysMsg:set(2008, 0x35, "修为不够，可以通过修炼来得到修为值")

sysMsg:set(2010, 0, "散仙增益心法散功返还")
sysMsg:set(2011, 0, "%u级的散仙[f:%u:%s]将%d阶心法[%s-%d级]散功之后，将您修炼此心法的心法书和所消耗总修为的60%转为一些修为丹赠送给您。请点击接受获取修为丹")
sysMsg:set(2012, 0, "散仙技能心法散功返还")
sysMsg:set(2013, 0, "%u级的散仙[f:%u:%s]将%d阶心法[%s-%d级]散功之后，将修炼此心法的心法书和所消耗总修为和技能符文熔炼值的60%转为一些修为丹和熔炼诀赠送给您。请点击接受获取心法书、修为丹和熔炼诀")
sysMsg:set(2014, 0, "技能符文散功返还")
sysMsg:set(2015, 0, "%u级的散仙[f:%u:%s]将[%s]的技能符文散功之后，所消耗技能符文熔炼值的60%转为一些熔炼诀赠送给您。请点击接受获取熔炼诀")

sysMsg:set(2100, 0, "阵法升级失败，该阵法不可升级")
sysMsg:set(2101, 0, "阵法升级失败，物品 [%s] 不足")
sysMsg:set(2102, 0x35, "保存阵型成功")
sysMsg:set(2103, 0x35, "不可重复学习同一个阵法")
sysMsg:set(2104, 0x35, "学会新阵法 %s")
sysMsg:set(2105, 0, "散仙修为返还提示")
sysMsg:set(2106, 0, "%u级的散仙[f:%u:%s]将%d阶心法[%s-%d级]散功之后，将您修炼此心法的心法书和所消耗总修为的60%转为一些修为丹赠送给您。请点击接受获取修为丹")
sysMsg:set(2107, 0x35, "今日可接师门任务已满")
sysMsg:set(2108, 0x35, "今日可接衙门任务已满")
sysMsg:set(2109, 0x35, "等级未到，当前等级: %u, 所需等级: %u")

sysMsg:set(2110, 0, "国庆充值送大礼奖励")
sysMsg:set(2111, 0, "恭喜您获得【国庆充值送大礼】活动奖励，感谢您对我们游戏的支持。")
sysMsg:set(2112, 0, "国庆在线大礼包奖励")
sysMsg:set(2113, 0, "恭喜您今日在线累计时间达到4小时，获得【国庆在线大礼包】活动奖励，感谢您对我们游戏的支持。")
sysMsg:set(2114, 0, "!!!亲送橙装咯!!!")
sysMsg:set(2115, 0, "VIP橙装大礼包")

sysMsg:set(2116, 0x16, "英雄岛活动已经结束了！")
sysMsg:set(2117, 0x16, "英雄岛即将在%u分钟后开始！")
sysMsg:set(2118, 0x16, "英雄岛活动已开始，欢迎大家参加！")
sysMsg:set(2119, 0x35, "获得神兽元神增益效果")

sysMsg:set(2120, 0, "新手成长礼包")
sysMsg:set(2121, 0, "恭喜您达到30级!\n  修炼之路才刚刚开始,蜀山团队特别赠送您一套镶嵌了宝石的30级主将紫装,助您斩妖除魔!请点击接受物品领取奖励！\n 30级开放功能：斗剑场、帮派科技、交易；\n 40级开放功能：阵营战、英雄岛（即将开放）")

sysMsg:set(2122, 0, "万圣节登陆送活动")
sysMsg:set(2123, 0, "恭喜您获得万圣节登陆送活动奖励50礼券，请点击接受物品领取奖励！\n 10/29--11/1\n 活动期间内，每日登陆可以领取一次登陆奖励50礼券；\n 活动期间内，连续三天登陆可以领取100礼券、南瓜型稀有装扮（头部）。\n 更多游戏内容请登录论坛查询：http://sobar.soso.com/b/3007483_1226")
sysMsg:set(2124, 0, "万圣节登陆送活动")
sysMsg:set(2125, 0, "恭喜您获得万圣节连续三天登陆送活动奖励100礼券、南瓜型稀有装扮（头部），请点击接受物品领取奖励！\n 10/29--11/1 \n 活动期间内，每日登陆可以领取一次登陆奖励50礼券；\n 活动期间内，连续三天登陆可以领取100礼券、南瓜型稀有装扮（头部）。\n 更多游戏内容请登录论坛查询：http://sobar.soso.com/b/3007483_1226")

sysMsg:set(2126, 0, "装备强8 宝石送")
sysMsg:set(2127, 0, "恭喜您获得补髓益元丹X5、凝神易筋丹X5奖励，请点击接受物品领取奖励！\n 10/29--11/1 \n 活动期间内，只要将任意一件装备强化到8级就可以获得补髓益元丹X5、凝神易筋丹X5的奖励。\n 注：\n 1.每强化一件装备到8获得一次奖励，强化N件装备达到8级，可以N次奖励。\n 2.同一件装备只能获得一次奖励，装备由8级降到7级，再次强化到8级将不能再次获得奖励。")

sysMsg:set(2130, 0x35, "获得盘古之力增益效果")
sysMsg:set(2131, 0x35, "获得玲珑宝塔增益效果")
sysMsg:set(2132, 0x35, "获得混元灵怒增益效果")
sysMsg:set(2133, 0x35, "获得五行禁阵增益效果")
sysMsg:set(2134, 0x35, "使用了妙手回春技能")

sysMsg:set(2140, 0x36, "[p:%u:%s]挑战你失败，被你打的狼狈而逃")
sysMsg:set(2141, 0x36, "[p:%u:%s]挑战了你，你不幸落败")

sysMsg:set(2143, 0x36, "你挑战了[p:%u:%s]，你不幸落败")
sysMsg:set(2144, 0x36, "你挑战了[p:%u:%s]成功，被你打的狼狈而逃")

sysMsg:set(2142, 0x27, "[p:%u:%s]获得称号[t:0:%u]")

sysMsg:set(2200, 0x27, "[p:%u:%s]将[f:%u:%s]潜力洗到1.5！")
sysMsg:set(2201, 0x27, "[p:%u:%s]将[f:%u:%s]资质洗到7！")
sysMsg:set(2203, 0x27, "[p:%u:%s]将[4:%u]的附加属性洗炼至橙色！")
sysMsg:set(2204, 0x27, "[p:%u:%s]在[8:%u]秘境中经历千难万险获得[4:%u]！")

sysMsg:set(2205, 0, "光棍法宝补偿")
sysMsg:set(2206, 0, "亲爱的玩家,由于光棍法宝出现的无视防御的BUG,我们对此深表歉意,特此依据强化等级做出相应补偿,感谢您对蜀山传奇的支持,祝您游戏愉快!  1级： 五行真金x1、凝神易经丹x5、补髓益元丹x5\n 2级： 五行真金x2、凝神易经丹x5、补髓益元丹x5\n 3级： 五行真金x3、凝神易经丹x5、补髓益元丹x5\n 4级： 五行真金x5、凝神易经丹x5、补髓益元丹x5\n 5级： 五行真金x10、凝神易经丹x5、补髓益元丹x5\n 6级： 五行精金x10、凝神易经丹x5、补髓益元丹x5\n 7级： 五行精金x20、凝神易经丹x5、补髓益元丹x5\n 8级： 五行精金x30、凝神易经丹x5、补髓益元丹x5")

sysMsg:set(2207, 0, "注册七日奖励")
sysMsg:set(2208, 0, "这是您的在注册七日登录第%u天补偿，请查收！")

sysMsg:set(2210, 0x16, "帮派战报名已经开启，据报名截止还有%u分钟，请点击帮派按钮进行参与。") 
sysMsg:set(2211, 0x16, "帮派战报名已经结束。帮派战报名时间为每天20点30分-20点40分。")
sysMsg:set(2212, 0x55, "您的下一个交战帮会为：%s，请尽快对出战阵容做出调整。")
sysMsg:set(2213, 0,    "帮派战每周奖励")
sysMsg:set(2214, 0,    "本周帮派战已经结束，您的帮派本周累计获得%u分，表现出色。个人宝箱奖励已经通过本邮件发送，注意查收。同时额外奖励给帮派的宝箱已经发放到帮派仓库。")
sysMsg:set(2215, 0x55, "今天帮会战，您所在帮会报名人数少于%u人，报名失败，无法参加帮会战。")
sysMsg:set(2216, 0x55, "您被帮会管理者调整至玉珠峰战役。")
sysMsg:set(2217, 0x55, "您被帮会管理者调整至光明顶战役。")
sysMsg:set(2218, 0x55, "您被帮会管理者调整至十王峰战役。")
sysMsg:set(2219, 0x55, "您被帮会管理者调整至万佛顶战役。")
sysMsg:set(2220, 0x55, "您被帮会管理者调整至祝融峰战役。")
sysMsg:set(2221, 0x55, "您被帮会管理者调整至玉虚顶战役。")
sysMsg:set(2222, 0x16, "今天帮会战已经结束。%s")
sysMsg:set(2223, 0,    "经过激烈的争夺，截止目前，帮会战本周排名前六名的帮派为：第一名：%s")
sysMsg:set(2224, 0,    "、第二名：%s")
sysMsg:set(2225, 0,    "、第三名：%s")
sysMsg:set(2226, 0,    "、第四名：%s")
sysMsg:set(2227, 0,    "、第五名：%s")
sysMsg:set(2228, 0,    "、第六名：%s")
sysMsg:set(2229, 0,    "。")
sysMsg:set(2230, 0x55, "对不起，报名失败，一场战役单方最多%u人参加，请尝试参加其他战役。")
sysMsg:set(2233, 0x55, "您的帮派本轮轮空，本轮直接获得%u分。")
sysMsg:set(2234, 0x55, "调整失败，一场战役单方最多%u人参加，请参加其他战役。")
sysMsg:set(2235, 0x55, "对不起，退出失败。帮派战期间，无法主动离开帮派。")
sysMsg:set(2236, 0,    "帮派战每日奖励")
sysMsg:set(2237, 0,    "今日帮派战已经结束，您的帮派今日获得%u分，表现出色，个人宝箱奖励已经通过本邮件发放，注意查收。")
sysMsg:set(2238, 0,    "帮派战排名奖励")
sysMsg:set(2239, 0,    "本周帮派战已经结束，您的帮派本周表现出色，在所有帮派中排名第%u，帮派得到的宝箱奖励已经发放到您所在的帮派仓库内。")
sysMsg:set(2240, 0,    "帮派仓库空间不足")
sysMsg:set(2241, 0,    "今天是帮派战最后一天，系统将会在今日帮派战结束后发放奖励至帮派仓库，为确保您能正常的接收奖励，请确保帮派仓库至少留出25个物品空间。")
sysMsg:set(2242, 0x35, "获得%u帮派贡献度")
sysMsg:set(2243, 0x36, "你已不在此副本所在据点")
sysMsg:set(2244, 0x36, "你已不在此阵图所在据点")

sysMsg:set(2310, 0, "英雄岛前三奖励")
sysMsg:set(2311, 0, "恭喜您称霸英雄岛，获得[英雄遗迹]x1")
sysMsg:set(2312, 0x27, "今日英雄岛结束")
sysMsg:set(2313, 0x27, "第%u名：[p:%u:%s]，获得%u声望和[英雄遗迹]x%u")
sysMsg:set(2314, 0x16, "英雄殿堂被一股奇特的漩涡包围，在那里的剑侠都被冲刷至英雄岛各地。。。")
sysMsg:set(2315, 0, "恭喜您称霸英雄岛，获得[英雄遗迹]x2")

--sysMsg:set(2320, 0, "春节充值%u仙石返礼")
--sysMsg:set(2321, 0, "感谢您参加春节充值返礼活动，请点击“接受物品”按钮获取奖励")
--sysMsg:set(2320, 0, "蜀山嘉年华充值%u仙石返礼")
--sysMsg:set(2321, 0, "感谢您参加蜀山嘉年华充值返礼活动，请点击“接受物品”按钮获取奖励")
--sysMsg:set(2320, 0, "伏魔壁现，道破天劫%u仙石奖励")
--sysMsg:set(2321, 0, "伏魔壁现，道破天劫奖励")
sysMsg:set(2320, 0, "充值返礼%u仙石")
sysMsg:set(2321, 0, "恭喜您获得了%u仙石充值返礼")

sysMsg:set(2322, 0, "出生前七天充值%u仙石返礼")
sysMsg:set(2323, 0, "感谢您参加出生前七天充值返礼活动，请点击“接受物品”按钮获取奖励")

sysMsg:set(2324, 0, "六一棒棒糖")
sysMsg:set(2325, 0, "六一棒棒糖")

sysMsg:set(2330, 0x27, "[p:%u:%s]将[f:%u:%s]的天赋洗炼至橙色属性")

sysMsg:set(2331, 0, "情人节活动奖励")
sysMsg:set(2332, 0, "恭喜您，获得情人节活动称号卡奖励")

sysMsg:set(2333, 0, "修炼地变更")
sysMsg:set(2334, 0, "你被[p:%u:%s]战败并被移动到无主之地")

sysMsg:set(2335, 0, "开服五大活动")
sysMsg:set(2336, 0, "活动一：首次充值拿大礼\n\t\t角色首次在游戏里充值，将会获得【首次充值礼包】。\n活动二：新手成长礼包\n\t\t人物等级达到30级，我们就将送您一个新手成长礼包\n活动三：新人冲级赛\n\t\t开服之日起7天后，等级排行榜前10位的玩家将会得到100-1000不等的礼券\n活动四：散仙召集令\n\t\t成功招募到任意橙色散仙，都将获得1000礼券奖励\n活动五：【VIP橙装大礼包】大奉送\n\t\t等级达到40级后（包含40级），可以获得一个【VIP橙装大礼包】。\n\t\t\t\t<a target=\"_blank\" href=\"http://gamebbs.qq.com/cgi-bin/data/cgi_bbs_content.cgi?groupid=264:30921&messageid=27&page=0\"><b>]]]]]]点击查看活动详情[[[[[[</b></a>")

sysMsg:set(2343, 0, "活动一：首次充值拿大礼\n\t\t角色首次在游戏里充值，将会获得【首次充值礼包】。\n活动二：新手成长礼包\n\t\t人物等级达到30级，我们就将送您一个新手成长礼包\n活动三：新人冲级赛\n\t\t开服之日起7天后，等级排行榜前10位的玩家将会得到100-1000不等的礼券\n活动四：散仙召集令\n\t\t成功招募到任意橙色散仙，都将获得1000礼券奖励\n活动五：【VIP橙装大礼包】大奉送\n\t\t等级达到40级后（包含40级），可以获得一个【VIP橙装大礼包】。\n\t\t\t\t<a target=\"_blank\" href=\"http://bbs.soletower.net/tw/viewthread.php?tid=226887&extra=page%3D1\"><b>]]]]]]点击查看活动详情[[[[[[</b></a>")
sysMsg:set(2337, 0x27, "[p:%u:%s] 施展诸天归元禁锢之法，成功将锁妖塔第%u层妖物封印。")
sysMsg:set(2338, 0x27, "[p:%u:%s] 成功击败锁妖塔第%u层的镇妖者[p:%u:%s]，获得了[4:%u]。")

sysMsg:set(2339, 0x35, "删除密友成功")
sysMsg:set(2340, 1, "您从密友名单中移除了[p:%u:%s]")
sysMsg:set(2341, 0x35, "添加密友成功")
sysMsg:set(2342, 1, "您将[p:%u:%s]添加到密友名单")

sysMsg:set(2350, 1, "当前系统时间：%u/%u/%u %u:%u:%u 星期%u")
sysMsg:set(2351, 0x27, "[p:%u:%s]使用了先天灵石获得了[4:%u]，[4:%u]，[4:%u]")
sysMsg:set(2352, 0x27, "[p:%u:%s]使用了先天灵石获得了[4:%u]x6")

sysMsg:set(2353, 1, "-心魔");

sysMsg:set(2354, 0, "风雷罗盘的意志")
sysMsg:set(2355, 0, "我认可了您的能力，这个称号是属于你的")

sysMsg:set(2356, 0, "棒棒糖的意志")
sysMsg:set(2357, 0, "我认可了您的能力，这个称号是属于你的")

sysMsg:set(2358, 0, "恭喜您在蜀山大寻宝活动中夺宝排行第%u名")
sysMsg:set(2359, 0, "恭喜您成为夺宝排行第%u名！此刻正有无数宵小对您拥有的宝物和荣耀虎视眈眈，保住当前名次或者再加把劲即可获得永久属性仙丹及绝版专属称号“多宝仙君”哦！（点击界面右侧秘境按钮可前往寻宝）")

sysMsg:set(2360, 0, "寻宝排行榜奖励")
sysMsg:set(2361, 0, "尊敬的%s大大，您好！恭喜您在蜀山大寻宝活动中勇夺第%u名，您可以点击右侧“接受物品”按钮领取奖励，并至物品栏查收。请继续支持我们的游戏，更多活动请关注蜀山传奇官网ss.xy.com")

sysMsg:set(2362, 0, "夺宝排行名次变更")
sysMsg:set(2363, 0, "在争夺天才地宝的激烈过程中，您被%s一剑斩落云端，夺宝排名降至%u名！赶快重整旗鼓，向着永久属性仙丹及绝版专属称号更近一步吧！（点击界面右侧秘境按钮可前往寻宝）")

sysMsg:set(2364, 0, "寻宝次数奖励")
sysMsg:set(2365, 0, "您获得了蜀山大寻宝奖励（點擊界面右側秘境按鈕可继续前往尋寶）")

sysMsg:set(2366, 0, "七日目标QB大奖")
sysMsg:set(2367, 0, "恭喜您获得七日目标%uQB大奖，卡号%s密码%s。建议您立刻充值QB购买仙石享受更精彩的蜀山游戏世界")

sysMsg:set(2368, 0, "新手注册邀请好友抽奖")
sysMsg:set(2369, 0, "恭喜您在新手注册邀请好友抽奖活动中获得%uQB大奖，卡号%s密码%s。建议您立刻充值QB购买仙石享受更精彩的蜀山游戏世界!")

sysMsg:set(2370, 0, "好友邀请抽奖QB大奖")
sysMsg:set(2371, 0, "恭喜您在好友邀请抽奖中获得%uQB大奖，卡号%s密码%s。建议您立刻充值QB购买仙石享受更精彩的蜀山游戏世界!")

sysMsg:set(2372, 0, "蜀山剑侠传奖励")
sysMsg:set(2373, 0, "恭喜您进入蜀山剑侠传排名，获得蜀山剑侠奖励点击“接受物品”按钮领取奖励。")

sysMsg:set(2380, 0, "QQGAME在线奖励")
sysMsg:set(2381, 0, "QQGAME在线奖励")

sysMsg:set(2382, 0, "QQ大厅登录奖励")
sysMsg:set(2383, 0, "QQ大厅登录奖励")

sysMsg:set(3000, 1, "提升主将活动");
sysMsg:set(3001, 1, "您在【提升主将得好礼】活动中，成功将主将潜力提升至1.3资质提升至6.8，恭喜您获得奖励200礼券，蓝色法宝五火神雷，请点击右侧“接受物品”领取奖励，感谢您对我们游戏的支持。");

sysMsg:set(3002, 0, "7.13活动")
sysMsg:set(3003, 0, "心法技能改版返还")
sysMsg:set(3004, 0, "散仙%s原有的技能心法将保留，但会失去增益属性，且装备时不再消耗元神力，附件中有与其属性相同的心法，及升级至对应等级需要的修为丹，您可以学习他恢复到和以前一样的属性")

sysMsg:set(4000, 0, "君子争上游活动")
sysMsg:set(4001, 0, "%s")
sysMsg:set(4002, 0, "君子争上游奖励，恭喜你在15名之内了")
sysMsg:set(4003, 0, "君子争上游奖励，恭喜你较昨日前进了%u名")

sysMsg:set(4004, 0, "[4:%u]")
sysMsg:set(4005, 0, "神秘礼物-[4:%u]x%u")
sysMsg:set(4006, 0, "储值返仙石还剩%u天！")
sysMsg:set(4007, 0, "储值返仙石还剩最后%u天！！！此活动仅在开服举办，机会难得，错过即不在！")
sysMsg:set(4008, 0, "冲级奖励");
sysMsg:set(4009, 0, "恭喜你达到%u级，奖励%u礼券！");

sysMsg:set(4010, 0x35, "你正在战斗中，不能与好友斗剑")
sysMsg:set(4011, 0x35, "发送斗剑邀请成功")
sysMsg:set(4012, 0x35, "目标玩家正在战斗中，不能与你斗剑")
--sysMsg:set(4013, 0x35, "[p:%u:%s]向你发出斗剑邀请，是否接受？")
sysMsg:set(4014, 0x35, "对方拒绝了邀请请求")
sysMsg:set(4015, 0x35, "目标玩家正在战斗中，不能与你斗剑")
sysMsg:set(4016, 0x35, "你正在3分钟冷却中，不能与好友斗剑")
sysMsg:set(4017, 0x35, "对方正在3分钟冷却中，不能与你斗剑")
sysMsg:set(4018, 0, "新人冲级赛奖励")
sysMsg:set(4019, 0, "您在【新人冲级赛】活动中，达到等级排行第%u，恭喜您获得奖励%u礼券，感谢您对我们游戏的支持！")

sysMsg:set(4020, 0, "七夕活动排名奖励")
sysMsg:set(4021, 0, "恭喜您和 %s 在七夕活动中的姻缘录排名第%u，获得了姻缘录第%u名奖励，请点击“接受物品”按钮领取")
sysMsg:set(4022, 0, "七夕活动姻缘奖励")
sysMsg:set(4023, 0, "恭喜您和 %s 在七夕成就一段美好姻缘，各获得了姻缘奖励，请点击“接受物品”按钮领取")
sysMsg:set(4024, 0, "七夕活动积分奖励")
sysMsg:set(4025, 0, "恭喜您在七夕活动中达到了%u积分，获得了相应积分奖励，请点击“接受物品”按钮领取")

sysMsg:set(4026, 0, "充值排行第%u名奖励")
sysMsg:set(4027, 0, "充值排行第%u名奖励")
sysMsg:set(4028, 0, "宝典")

sysMsg:set(4029, 0, "[4:1530]补偿")
sysMsg:set(4030, 0, "这是您的“[4:1530]”强化【%u】级，熔炼值【%u】获得了如下的补偿，请查收！")

sysMsg:set(4031, 0, "月饼活动奖励")
sysMsg:set(4032, 0, "恭喜您在月饼活动中食用月饼最多，获得了称号卡：皎月剑仙，请点击“接受物品”按钮领取")
sysMsg:set(4033, 0x16, "充值排行第%u名: [p:%u:%s], 充值额度: %u")
sysMsg:set(4034, 0x16, "消费排行第%u名: [p:%u:%s], 消费额度: %u")
sysMsg:set(4040, 0, "镇妖封神 修仙夺宝")
sysMsg:set(4041, 0, "活动期间将锁妖塔封印至50层、60层即可获得奖励。奖励只可获得一次，不可重复领取")
sysMsg:set(9999, 0, "var: %d")

sysMsg:set(4050, 0, "万圣节活动排名奖励")
sysMsg:set(4051, 0, "恭喜您和 %s 在万圣节活动中的奇境冒险排名第%u，获得了奇境冒险第%u名奖励，请点击“接受物品”按钮领取")
sysMsg:set(4052, 0, "万圣节活动冒险资格奖励")
sysMsg:set(4053, 0, "恭喜您和 %s 在万圣节活动中寻到了给力的搭档，各获得了冒险资格奖励，请点击“接受物品”按钮领取")
sysMsg:set(4054, 0, "万圣节活动积分奖励")
sysMsg:set(4055, 0, "恭喜您在万圣节活动中达到了%u积分，获得了相应积分奖励，请点击“接受物品”按钮领取")
sysMsg:set(4056, 0, "情人节排名奖励")
sysMsg:set(4057, 0, "恭喜您和 %s 在情人节活动中的姻缘录排名第%u，获得了情人节浪漫之旅第%u名奖励，请点击“接受物品”按钮领取")
sysMsg:set(4058, 0, "情人节活动姻缘奖励")
sysMsg:set(4059, 0, "恭喜您和 %s 在情人节成就一段美好姻缘，各获得了情人节姻缘奖励，请点击“接受物品”按钮领取")

sysMsg:set(4060, 0x27, "[p:%u:%s]使用了通灵神石获得了[4:%u]，[4:%u]，[4:%u]")
sysMsg:set(4061, 0x27, "[p:%u:%s]使用了通灵神石获得了[4:%u]x6")
sysMsg:set(4062, 0, "逍遥嘉年华活动奖励")
sysMsg:set(4063, 0, "恭喜您在逍遥嘉年华活动中使用逍遥嘉年华礼包最多，获得了称号卡：逍遥仙，请点击“接受物品”按钮领取")
sysMsg:set(4064, 0, "金蛇得宝称号奖励")
sysMsg:set(4065, 0, "恭喜您获得了称号卡：金蛇郎君，请点击“接受物品”按钮领取，祝您游戏愉快！")

sysMsg:set(4066, 0, "情人节活动积分奖励")
sysMsg:set(4067, 0, "恭喜您在情人节活动中达到了%u积分，获得了相应积分奖励，请点击“接受物品”按钮领取")

sysMsg:set(4070, 0, "孤月大师赠送的钜子装备")
sysMsg:set(4071, 0, "这是墨家钜子曾经用过的装备，现在我将它赠送给你，希望对你有所帮助。点击“接受物品”按钮领取。")

sysMsg:set(4072, 0, "墨家修为异常补偿")
sysMsg:set(4073, 0, "墨家修为异常补偿。")

sysMsg:set(4098, 0, "大地的守护");
sysMsg:set(4099, 0, "恭喜您，得到了大地之神的庇佑，并获取节日套装—-大地的守护！点击“接受物品”按钮领取。");
sysMsg:set(4100, 0, "12.%u QQ大厅在线奖励");
sysMsg:set(4101, 0, "12.%u QQ大厅在线奖励");
sysMsg:set(4102, 0, "圣诞节登录奖励");
sysMsg:set(4103, 0, "祝您圣诞快乐！点击“接受物品”按钮领取。");

sysMsg:set(4104, 0, "玩《蜀山传奇》，每日登录拿奖励");
sysMsg:set(4105, 0, "亲爱的玩家，活动期间，通过活动入口每天登录蜀山传奇可获得《蜀山传奇》大礼包1个。礼包每日只能领取一次。");
sysMsg:set(4106, 0, "玩《蜀山传奇》达到40级拿奖励");
sysMsg:set(4107, 0, "亲爱的玩家，您在活动期间达到40级，特奖励您成就礼包一个。祝您游戏愉快！");

sysMsg:set(4112, 0, "堆雪人活动积分奖励");
sysMsg:set(4113, 0, "恭喜你们在圣诞堆雪人活动中达到了积分:%u, 请领取奖励,祝您游戏愉快！");
sysMsg:set(4114, 0, "堆雪人活动积分排名奖励");
sysMsg:set(4115, 0, "恭喜您和搭档[%s]在圣诞堆雪人活动中获得了第%u名, 请领取奖励，祝您游戏愉快！");

sysMsg:set(4116, 0, "灵宝概率测试:[4:%u] 随机%u次 绿色个数%u, 蓝色个数%u, 紫色个数%u, 橙色个数%u, 1条技能的灵宝数%u， 2条技能的灵宝数%u");

sysMsg:set(4117, 0x35, "获得了[e:%u:%s]")
sysMsg:set(4118, 1, "您获得了[e:%u:%s]")
sysMsg:set(4120, 0, "福禄仙师称号奖励");
sysMsg:set(4121, 0, "恭喜您获得了称号-福禄仙师，祝您游戏愉快！");
sysMsg:set(4122, 0, "九天龙王称号奖励");
sysMsg:set(4123, 0, "恭喜您获得了称号-九天龙王，祝您游戏愉快！");
sysMsg:set(4124, 0, "放弃唤灵返还");
sysMsg:set(4125, 0, "放弃唤灵返还，请点击“接受物品”按钮获得道具。");
sysMsg:set(4126, 0, "新年快乐——节日套装“福到”来");
sysMsg:set(4127, 0, "蜀山传奇祝所有玩家新年快乐～请点击“接受物品”按钮领取节日套装“福到”");
sysMsg:set(4128, 0, "情人节快乐——送节日套装");
sysMsg:set(4129, 0, "蜀山传奇祝天下有情人终成眷属～请点击“接受物品”按钮领取节日套装“恋人之链”");
sysMsg:set(4130, 0, "剑侠秘籍XXX")
sysMsg:set(4131, 0, "剑侠秘籍XXXXXXXXXXXXXXX")

sysMsg:set(4132, 0x35, "出现暴击，运行周天重数+%u！")
sysMsg:set(4133, 0x27, "恭喜玩家[p:%u:%s]获得灵宠[f:%u:%s]，战力飙升，斗剑场又能虐人了！")
sysMsg:set(4134, 1, "您获得了灵宠[f:%u:%s]")
sysMsg:set(4135, 0x27, "恭喜玩家[p:%u:%s]成功将灵宠[f:%u:%s]的根骨提升至[9:1:%u]，傲视蜀山无宠可挡！")

sysMsg:set(4140, 0, "灵宠功能上线活动");
sysMsg:set(4141, 0, "恭喜您获得系统赠送的灵宠蛋一个，请点击“接受物品”按钮领取。");
sysMsg:set(4142, 0, "愚人节活动");
sysMsg:set(4143, 0, "恭喜你在愚人节活动中使用愚公宝箱最多，获得称号：逗你玩儿，请点击“接受物品”按钮领取。");

sysMsg:set(4145, 0, "2013.%u.%u 人气排行榜奖励");
sysMsg:set(4146, 0, "截止至2013.%u.%u，有%u人对您表示崇拜。您因此获得\"名震蜀山\"称号，为期一周。");
sysMsg:set(4147, 0x16, "恭喜[p:%u:%s]在上一周人气榜名列第一位，获得\"名震蜀山\"称号，滔滔江水般的崇拜使他成功做到了小弟千万，名震蜀山！")

sysMsg:set(4148, 0x35, "恭喜，回答正确！")
sysMsg:set(4149, 0x35, "Sorry，回答错误！")
sysMsg:set(4150, 0x35, "Sorry，回答超时！")
sysMsg:set(4151, 0 , "峨眉天下秀活动");
sysMsg:set(4152, 0 , "恭喜你在峨眉天下秀活动中使用峨眉秘宝最多，获得称号：\"金顶佛光\"，请点击“接受物品”按钮领取。");
sysMsg:set(4153, 0 , "大地守护神");
sysMsg:set(4154, 0 , "大地选择了您，只有您才配得上\"大地守护神\"这个神圣的称号,请点击“接受物品”按钮领取。");

--末日之战
sysMsg:set(4200, 0, "[1:%u]已经充能%u%%");
sysMsg:set(4201, 0, "%s已经达到%u血印");
sysMsg:set(4202, 0, "帮派技能[2:%u]发动");
sysMsg:set(4203, 0, "血魔[3:%u]本源消失");
sysMsg:set(4204, 0, "血芒魔阵已达到%u%%");
sysMsg:set(4205, 0, "血魔血量被消耗到%u%%");
sysMsg:set(4210, 0x16, "%u分钟后末日之战将开启");
sysMsg:set(4211, 0x16, "仙深渊中发生惊人的异变，一股无比邪恶的力量从中蔓延出来，蜀山将迎来末日的浩劫");
sysMsg:set(4212, 0x16, "血魔出世，蜀山世界面临空前浩劫，剑侠们速速前往阻止血魔炼成血芒魔阵，生灵涂炭。");
sysMsg:set(4213, 0x17, "末日之战已结束\n帮派血印第一名：%s\n帮派血印第二名：%s\n帮派血印第三名：%s\n")

sysMsg:set(4220, 0, "末日之战帮派奖励");
sysMsg:set(4221, 0, "你的帮派在末日之战中排行第%u,帮派血印为%u,与第一名血印相差%u, 奖励已发送到帮派仓库");
sysMsg:set(4222, 0, "末日之战个人血印奖励");
sysMsg:set(4223, 0, "你在末日之战获得血印%u,请接收奖励");
sysMsg:set(4224, 0, "末日之战血魔消灭奖励");
sysMsg:set(4225, 0, "末日之战血魔消灭奖励，点击接受按钮领取奖励");
sysMsg:set(4226, 0, "你的帮派在末日之战中排行第%u,帮派血印为%u,  奖励已发送到帮派仓库");
sysMsg:set(4230, 0, "%s开始为[1:%u]充能");
sysMsg:set(4231, 0, "%s开始采集仙蕴精华");
sysMsg:set(4232, 0, "%s完成了[1:%u]充能");
sysMsg:set(4233, 0, "%s采集%u点仙蕴精华");
sysMsg:set(4234, 0, "%s的充能位被%s帮派抢占");
sysMsg:set(4235, 0, "%s的采集位被%s帮派抢占");


sysMsg:set(6000, 0x35, "获得经验值%u\n御剑特权体验额外经验%u")
sysMsg:set(6001, 1, "[f:%u:%s]获得经验值%u\n御剑特权体验额外经验%u")

sysMsg:set(6002, 0x35, "[f:%u:%s]获得修为值%u\n御剑特权体验额外修为%u")
sysMsg:set(6003, 1, "[f:%u:%s]获得修为值%u\n御剑特权体验额外修为%u")
sysMsg:set(4132, 0x35, "出现暴击，运行周天重数+%u！")

--4900-4999 回流服务器
sysMsg:set(4900, 0, "战力之王奖励")
sysMsg:set(4901, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，恭喜您获得奖励new ipad 一台，请联系游戏客服提供您的信息，我们将通过邮寄的方式把奖品送出，感谢您对我们游戏的支持。")
sysMsg:set(4902, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，恭喜您获得奖励蜀山周边之U盘，请联系游戏客服提供您的信息，我们将通过邮寄的方式把奖品送出，感谢您对我们游戏的支持。")
sysMsg:set(4903, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，恭喜您获得奖励蜀山周边马克杯，请联系游戏客服提供您的信息，我们将通过邮寄的方式把奖品送出，感谢您对我们游戏的支持。")
sysMsg:set(4904, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，请接收奖励.")

sysMsg:set(4910, 0, "开服7天充值排行奖励")
sysMsg:set(4911, 0, "你在开服7天充值排行活动中,获得第%u名,请接收奖励.")
sysMsg:set(4912, 0, "聚宝盆奖励")
sysMsg:set(4913, 0, "感谢您购买价值%u仙石的聚宝盆,请点击按钮领取您的奖励.此次是第%u次(一共可领取10次)")

sysMsg:set(4914, 0, "御剑特权体验")
sysMsg:set(4915, 0, "恭喜您已经到达%u级，开启御剑特权体验能帮助您获得双倍升级速度，迅速在众多蜀山剑侠中脱颖而出，称霸蜀山！详情请点击主界面上方特权体验活动按钮！")

--6003~6049 繁体版本占用
--8000~8200 繁体版本占用

