sysMsg:set(10, 0x10, "[p:%u:%s] 收服了名将 [f:%u:%s]")
sysMsg:set(11, 0x10, "[p:%u:%s] 解雇了名将 [f:%u:%s]")

sysMsg:set(100, 0x35, "获得经验值%u")
sysMsg:set(101, 0x35, "升到了%u级")
sysMsg:set(102, 0x35, "获得了[4:%u]x%u")
sysMsg:set(103, 0x35, "获得了[4:%u]")
sysMsg:set(104, 0x35, "使用了[4:%u]")
sysMsg:set(105, 0x35, "获得战功%u")
sysMsg:set(106, 0x35, "花费了战功%u")
sysMsg:set(107, 0x35, "接受任务[5:%u]")
sysMsg:set(108, 0x35, "任务失败")
sysMsg:set(109, 0x35, "完成任务[5:%u]")
sysMsg:set(110, 0x35, "获得将领[f:%u:%s]")
sysMsg:set(111, 0x35, "已解雇将领[f:%u:%s]")
sysMsg:set(112, 0x35, "出价成功")
sysMsg:set(113, 0x35, "出价被超过")
sysMsg:set(114, 0x35, "背包已满")
sysMsg:set(115, 0x35, "物品已放入九疑鼎")
sysMsg:set(116, 0x35, "已出售物品")
sysMsg:set(117, 0x35, "该物品无法摧毁")
sysMsg:set(118, 0x35, "该物品无法出售")
sysMsg:set(119, 0x35, "已发送申请加入「%s」")
sysMsg:set(120, 0x35, "创建宗族成功")
sysMsg:set(121, 0x35, "加入了宗族「%s」")
sysMsg:set(122, 0x35, "宗族被解散")
sysMsg:set(124, 0x35, "已退出宗族")
sysMsg:set(125, 0x35, "已被从宗族中移除")
sysMsg:set(126, 0x35, "宗族职位变更")
sysMsg:set(128, 0x35, "宗族长职位移交")
sysMsg:set(129, 0x35, "成为了宗族长")
sysMsg:set(130, 0x35, "掠夺发起成功")
sysMsg:set(131, 0x35, "掠夺警报")
sysMsg:set(132, 0x35, "添加好友成功")
sysMsg:set(133, 0x35, "添加好友失败")
sysMsg:set(134, 0x35, "删除好友成功")
sysMsg:set(135, 0x35, "添加黑名单成功")
sysMsg:set(136, 0x35, "添加黑名单失败")
sysMsg:set(137, 0x35, "有新的邮件")
sysMsg:set(138, 0x35, "邮件发送成功")
sysMsg:set(139, 0x35, "邮件删除成功")
sysMsg:set(140, 0x35, "邮箱已满")
sysMsg:set(141, 0x35, "已加入战场")
sysMsg:set(142, 0x35, "已退出战场")
sysMsg:set(144, 0x35, "已被[p:%u:%s]击败回城")
sysMsg:set(145, 0x35, "开启杀戮状态")
sysMsg:set(146, 0x35, "关闭杀戮状态")
sysMsg:set(147, 0x35, "获得状态「%s」")
-- sysMsg:set(148, 0x35, "友好值增加了%u")
sysMsg:set(149, 0x35, "获得元宝%u")
sysMsg:set(150, 0x35, "消费元宝%u")
sysMsg:set(151, 0x35, "获得银币%u")
sysMsg:set(152, 0x35, "消费银币%u")
sysMsg:set(153, 0x35, "获得铜钱%u")
sysMsg:set(154, 0x35, "消费铜钱%u")
sysMsg:set(155, 0x35, "获得礼券%u")
sysMsg:set(156, 0x35, "消费礼券%u")
sysMsg:set(157, 0x35, "添加仇人成功")
sysMsg:set(158, 0x35, "添加仇人失败")
sysMsg:set(159, 0x35, "持有铜币到达上限")
sysMsg:set(162, 0x35, "学会[7:%u%u]")

sysMsg:set(181, 0x35, "未通过防沉迷认证，获得减半经验值")
sysMsg:set(182, 0x35, "未通过防沉迷认证，获得减半银币%u")
sysMsg:set(183, 0x35, "未通过防沉迷认证，获得减半铜钱%u")
sysMsg:set(184, 0x35, "未通过防沉迷认证，没有获得收益")

sysMsg:set(190, 0x35, "已是满血状态，无需加血")

sysMsg:set(1000, 1, "[f:%u:%s]获得经验值%u")
sysMsg:set(1001, 1, "[f:%u:%s]升级了，等级提升到了%u")
sysMsg:set(1002, 1, "你获得了[4:%u]x%u")
sysMsg:set(1003, 1, "你获得了[4:%u]")
sysMsg:set(1004, 1, "你使用了[4:%u]")
sysMsg:set(1005, 1, "你获得%u点战功")
sysMsg:set(1006, 1, "你消费%u点战功")
sysMsg:set(1007, 1, "你接取了任务[5:%u]")
sysMsg:set(1008, 1, "任务[5:%u]失败了")
sysMsg:set(1009, 1, "你完成了任务[5:%u]")
sysMsg:set(1010, 1, "你获得了将领[f:%u:%s]")
sysMsg:set(1011, 1, "你解雇了将领[f:%u:%s]")
sysMsg:set(1012, 1, "你对[f:%u:%s]的竞拍成功")
sysMsg:set(1013, 1, "你对[f:%u:%s]的竞价被超过了")
sysMsg:set(1014, 1, "你的背包已满，无法再增加物品")
sysMsg:set(1015, 1, "物品成功加入九疑鼎")
sysMsg:set(1016, 1, "出售物品成功")
sysMsg:set(1017, 1, "物品[4:%u]不可摧毁")
sysMsg:set(1018, 1, "物品[4:%u]不可出售")
sysMsg:set(1019, 1, "申请加入「%s」成功")
sysMsg:set(1020, 1, "创建宗族「%s」成功")
sysMsg:set(1021, 1, "你加入了宗族「%s」")
sysMsg:set(1022, 1, "你解散了宗族「%s」")
sysMsg:set(1023, 1, "你所在的宗族「%s」被解散了")
sysMsg:set(1024, 1, "你退出了宗族「%s」")
sysMsg:set(1025, 1, "你被[p:%u:%s]从「%s」移除了")
sysMsg:set(1026, 1, "你被提升到「%s」")
sysMsg:set(1027, 1, "你被降为「%s」")
sysMsg:set(1028, 1, "你将宗族族长位置转让给了[p:%u:%s]")
sysMsg:set(1029, 1, "[p:%u:%s]将宗族族长的位置转让给你了，你成为了「%s」的族长")
sysMsg:set(1030, 1, "你向[p:%u:%s]发动了掠夺")
sysMsg:set(1031, 1, "[p:%u:%s]向你发动了掠夺")
sysMsg:set(1032, 1, "你将[p:%u:%s]添加到好友名单")
sysMsg:set(1033, 1, "添加好友[p:%u:%s]失败")
sysMsg:set(1034, 1, "你从好友名单中移除了[p:%u:%s]")
sysMsg:set(1035, 1, "你将[p:%u:%s]添加到黑名单")
sysMsg:set(1036, 1, "添加[p:%u:%s]到黑名单失败")
sysMsg:set(1037, 1, "你收到封新的邮件")
sysMsg:set(1040, 1, "你的信箱已满，无法收到更多的邮件")
sysMsg:set(1041, 1, "你加入了国战国战，为[3:%u]出战")
sysMsg:set(1042, 1, "你离开了国战战场")
sysMsg:set(1043, 1, "你在决斗中战胜了[p:%u:%s]")
sysMsg:set(1044, 1, "[p:%u:%s]在决斗中战胜了你")
sysMsg:set(1045, 1, "你开启了杀戮状态")
sysMsg:set(1046, 1, "你关闭了杀戮状态")
sysMsg:set(1047, 1, "你获得了「%s」效果")
sysMsg:set(1048, 1, "你获得[1:%u]的友好值%u")
sysMsg:set(1049, 1, "你获得%u元宝")
sysMsg:set(1050, 1, "你消费%u元宝")
sysMsg:set(1051, 1, "你获得%u银币")
sysMsg:set(1052, 1, "你消费%u银币")
sysMsg:set(1053, 1, "你获得%u铜钱")
sysMsg:set(1054, 1, "你消费%u铜钱")
sysMsg:set(1055, 1, "你获得%u礼券")
sysMsg:set(1056, 1, "你消费%u礼券")
sysMsg:set(1057, 1, "你将[p:%u:%s]添加到仇人名单")
sysMsg:set(1058, 1, "添加[p:%u:%s]到仇人名单失败")
sysMsg:set(1060, 1, "[p:%u:%s]抢劫你%u银币")
sysMsg:set(1061, 1, "[p:%u:%s]抢劫你%u战功")
sysMsg:set(1062, 1, "[f:%u:%s]学会了[7:%u%u]")
sysMsg:set(1081, 1, "你未通过防沉迷认证，获得减半经验值")
sysMsg:set(1082, 1, "你未通过防沉迷认证，获得减半银币%u")
sysMsg:set(1083, 1, "你未通过防沉迷认证，获得减半铜钱%u")
sysMsg:set(1084, 1, "你未通过防沉迷认证，没有获得收益")

sysMsg:set(200, 0, "竞拍成功")
sysMsg:set(201, 0, "武将名: %s\n请确认并接收武将。")
sysMsg:set(202, 0, "竞拍价被超越")
sysMsg:set(203, 0, "您参与竞拍的武将 %s 出价已经被超过。\n您之前的出价%u铜币已经退还。")
sysMsg:set(204, 0, "您的 %s 已经自动完成了，请回到接任务npc处交付并领取丰厚奖励。\n祝您游戏愉快！")
sysMsg:set(205, 0, "名将收服成功")
sysMsg:set(206, 0, "恭喜您终于收服 %s 成功, 从此他将心甘情愿追随你，共同战斗，点击接受就可以获得绝世名将了。\n祝您游戏愉快！")
sysMsg:set(207, 0, "来自 [p:%u:%s] 的好友邀请")
sysMsg:set(208, 0, "[p:%u:%s] 邀请您成为其好友。\n是否要接受邀请？")
sysMsg:set(210, 0, "经验循环任务")
sysMsg:set(211, 0, "铜币循环任务")
sysMsg:set(212, 0, "您已经接受了邀请")
sysMsg:set(213, 0, "您已经拒绝了邀请")
sysMsg:set(214, 0, "掠夺警告")
sysMsg:set(215, 0, "[p:%u:%s] 对你发起了掠夺，将于 %u 秒后发动！")
sysMsg:set(216, 0, "掠夺战报")
sysMsg:set(217, 0, "恭喜您在掠夺战中战胜了 [p:%u:%s]！")
sysMsg:set(218, 0, "非常遗憾，您在掠夺战中不敌 [p:%u:%s]！")
sysMsg:set(219, 0, "\n掠得银两 %u，战功 %u")
sysMsg:set(220, 0, "\n失去银两 %u，战功 %u")
sysMsg:set(221, 0, "\n，且捕获名将 ")
sysMsg:set(222, 0, "\n，且失去名将 ")
sysMsg:set(223, 0, "玩家 「%s」 申请加入宗族")
sysMsg:set(224, 0, "玩家 「%s」 申请加入您的宗族，请到宗族审核面板查看。\n祝您游戏愉快！")
sysMsg:set(225, 0, "加入宗族申请通过")
sysMsg:set(226, 0, "您的申请已被批准，恭喜加入宗族 「%s」。\n祝您游戏愉快！")
sysMsg:set(227, 0, "加入宗族申请被拒绝")
sysMsg:set(228, 0, "您加入宗族 「%s」 的申请已被拒绝，请重新申请加入其他宗族。\n祝您游戏愉快！")
sysMsg:set(229, 0, "您已被开除出宗族 「%s」")
sysMsg:set(230, 0, "很遗憾您已被开除出宗族 「%s」，您可以重新申请加入或创建宗族。\n祝您游戏愉快！")
sysMsg:set(231, 0, "击退强敌的奖励")
sysMsg:set(232, 0, "在合力击退强大怪物的战斗中，你表现优异，获得累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(233, 0, "在合力击退强大怪物的战斗中，你表现优异，获得高级升级加速符、 %s、%s 和 累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(234, 0, "宗族奖励分配")
sysMsg:set(235, 0, "宗主给你分配了一些奖励物品，快去宗族仓库查看吧！")
sysMsg:set(236, 0, "武将经验返还提示")
sysMsg:set(237, 0, "%u级的武将[f:%u:%s]离开之后，为报答之前的知遇之恩，将自己的一半经验值转为一些经验卡赠送给你。请点击接受获取经验卡")

sysMsg:set(240, 0x16, "国战即将打响，请各位去国战要塞报名！")
sysMsg:set(241, 0x16, "国战还有%u分钟就要打响，请尽快去报名！")
sysMsg:set(242, 0x16, "宗族战即将打响，大家快去报名啊！")
sysMsg:set(243, 0x16, "宗族战还有%u分钟就要打响，请尽快报名！")
sysMsg:set(244, 0x17, "[1:%u]对你说:我正在山海大陆的[2:%u]，你有兴趣的话就快来找我吧。")
sysMsg:set(245, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n哥正无所事事，有没有人放马过来啊。")
sysMsg:set(246, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n哥等的不是寂寞，是收服。")
sysMsg:set(247, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n你们都怕了吗，哥只能孤独求败了吗。")
sysMsg:set(248, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n哥就是想看看，到底有没有人愿意在我面前大显身手。")
sysMsg:set(249, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n天下英雄，惟使君与操耳。我已在此，使君何在？")
sysMsg:set(250, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n你若想要太平盛世，就别来惹我！")
sysMsg:set(251, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n姐等了好久了，怎么还没有人来啊，你们都别打酱油了。")
sysMsg:set(252, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n姐就是不想再宅在这里了，怎么就没个人成全下呢。")
sysMsg:set(253, 0x17, "[1:%u]在山海大陆的[2:%u]喊道:\n妾身在此已千年之久，望有心人士快快寻来。")

sysMsg:set(254, 0, "首次充值有礼")
sysMsg:set(255, 0, "亲爱的玩家您好：\n感谢您支持《蜀山传奇》重装上线，您的首次充值礼包请点击下方接受领取。请注意收取和打开礼包的时候为背包预留足够的空间。礼包内含：高级经验加速符 x2，中级群体增强符 x2，助您招募不同时代的英雄人物，谋划江山社稷。")

sysMsg:set(256, 0, "VIP充值有礼")
sysMsg:set(257, 0, "亲爱的玩家您好：\n感谢您支持《蜀山传奇》，请点击下方接受领取您的 %u 级VIP充值礼包。请注意收取和打开礼包的时候为背包预留足够的空间。")

sysMsg:set(259, 0x16, "发生在[2:%u]的国战已结束，最终不相上下打成平手。双方所有参战玩家都将获得一定经验加速奖励。")
sysMsg:set(260, 0x16, "发生在[2:%u]的国战已结束，[3:%u]赢得了胜利。双方所有参战玩家都将获得一定经验加速奖励。")
sysMsg:set(261, 0, "国战奖励")
sysMsg:set(262, 0, "感谢您参加今日的国战，您的神勇使得国家最终取得了胜利，也为您赢得 %u 战功与持续时间 %02u:%02u:%02u 的高级经验加速效果。您赢了%u场，输了%u场。最高连胜%u场")
sysMsg:set(263, 0, "感谢您参加今日的国战，虽然您的国家输掉了国战，您的英勇表现仍然为您赢得了 %u 战功与持续时间 %02u:%02u:%02u 的初级经验加速效果。您赢了%u场，输了%u场。最高连胜%u场")
sysMsg:set(264, 0, "感谢您参加今日的国战，双方僵持良久不相上下，您的奋战为您赢得 %u 战功与持续时间 %02u:%02u:%02u 的初级经验加速效果。您赢了%u场，输了%u场。最高连胜%u场")

sysMsg:set(265, 0x17, "截至目前伤害排名：第一名[p:%u:%s] %u%%、第二名[p:%u:%s] %u%%、第三名[p:%u:%s] %u%%")
sysMsg:set(266, 0x17, "截至目前伤害排名：第一名[p:%u:%s] %u%%、第二名[p:%u:%s] %u%%")
sysMsg:set(267, 0x17, "截至目前伤害排名：第一名[p:%u:%s] %u%%")

sysMsg:set(270, 0x17, "[p:%u:%s]历尽千难万险，在副本\"%s\"第%u层获得了%s")
sysMsg:set(271, 0x17, "[p:%u:%s]幸运地从[4:%u]中开出了[4:%u]")
sysMsg:set(272, 0x17, "恭喜[p:%u:%s]首次打败\"%s\"的最终Boss，全部通关！")

sysMsg:set(275, 0x17, "[p:%u:%s]强化[4:%u]到+%u成功！")

sysMsg:set(276, 0, "在合力击退强大怪物的战斗中，你表现优异，获得高级升级加速符、 %s 和 累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(278, 0, "在合力击退强大怪物的战斗中，你表现优异，获得%s和累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(279, 0x17, "今日击退强敌%s的第1名是[p:%u:%s]，他将获得%s、%s。排名第2的是[p:%u:%s]，排名第3的是[p:%u:%s]。")
sysMsg:set(280, 0, "恭喜你在合力击退%s的战斗中，身先士卒，第一个对%s造成伤害，特此奖励你50银币")
sysMsg:set(281, 0, "恭喜你在合力击退%s的战斗中，身先士卒，第一个对%s造成伤害，特此奖励你%s")
sysMsg:set(282, 0x17, "[p:%u:%s]身先士卒，第一个对%s造成伤害，获得特殊奖励。")

sysMsg:set(304, 0, "交易成功,背包已满")
sysMsg:set(305, 0, "交易失败,背包已满")
sysMsg:set(306, 0, "您有%d件物品需要接受!")

sysMsg:set(307, 0, "购买成功")
sysMsg:set(308, 0, "您成功购买了%s")
sysMsg:set(309, 0, "寄售失败")
sysMsg:set(310, 0, "您撤销了寄售物品%s")
sysMsg:set(311, 0, "您的寄售时间已到，请接收物品")
sysMsg:set(312, 0, "寄售成功")
sysMsg:set(313, 0, "恭喜，您成功把%s出售给%s，所得%u铜币已入账，无需邮件接取。")
sysMsg:set(314, 0, "恭喜，您成功把%s出售给%s，所得%u元宝已入账，无需邮件接取。")

--竞技场（315-332 339 - 342）
sysMsg:set(315, 0, "经验")
sysMsg:set(316, 0, "银币")
sysMsg:set(317, 0, "礼券")
sysMsg:set(339, 0, "铜币")
sysMsg:set(356, 0, "战功")

sysMsg:set(340, 0, "绿色%s宝箱")
sysMsg:set(341, 0, "蓝色%s宝箱")
sysMsg:set(342, 0, "紫色%s宝箱")
sysMsg:set(357, 0, "橙色%s宝箱")

sysMsg:set(318, 0, "竞技场邮件")
sysMsg:set(319, 0, "%s在竞技场对您发起了挑战，经过一番恶战，您不幸被打败。%s抢走了您的%s，抢走%u%s。")
sysMsg:set(320, 0, "恭喜您已经升级到了30级，您现在可以进入竞技场与其他玩家进行竞技了。点击最下方工具栏中的“竞技”按钮进入竞技场。竞技场内的所有战斗都不会有任何损耗，并且还有经验、礼券、银币宝箱等丰厚奖励。")
sysMsg:set(321, 0, "恭喜您进阶到高级竞技场，适应等级50级以上。你的排名在新的竞技场中将被重新排序。")
sysMsg:set(325, 0, "恭喜您保住了竞技场第%u名的名次，今天您获得奖励：%s\n请在点击接受前确保背包留出足够的空间。\n竞技场名次越高奖励越好，祝您玩得开心！")

sysMsg:set(326, 0, "%sx3、潜力提升符x3、%sx%u、高级群体增强符x1、潜力保护符x1")
sysMsg:set(327, 0, "%sx2、潜力提升符x2、%sx%u、高级群体增强符x1")
sysMsg:set(328, 0, "%sx1、潜力提升符x1、%sx%u、高级群体增强符x1")
sysMsg:set(329, 0, "%sx1、高级群体增强符x1")
sysMsg:set(330, 0x17, "今日竞技场第一名是[p:%u:%s]，他将获得橙色喜好品、潜力提升保护符、橙装等至尊奖励。排名第二的是[p:%u:%s]，排名第三的是[p:%u:%s]，有人来挑战他们的王者地位吗？")
sysMsg:set(331, 0x17, "今日竞技场第一名是[p:%u:%s]，他将获得橙色喜好品、潜力提升保护符、橙装等至尊奖励。排名第二的是[p:%u:%s]，有人来挑战他们的王者地位吗？")
sysMsg:set(332, 0x17, "今日竞技场第一名是[p:%u:%s]，他将获得橙色喜好品、潜力提升保护符、橙装等至尊奖励。有人来挑战他的王者地位吗？")
sysMsg:set(333, 0, "系统已帮你自动领取竞技场宝箱，获得%u%s。")

sysMsg:set(322, 0x27, "%s在竞技场连胜%d场，势不可挡。")
sysMsg:set(323, 0x27, "%s挑战竞技场第一名%s成功，顺利登顶全服榜首！")
sysMsg:set(324, 0x27, "%s成功地守护住了自己的第一名霸主地位！")

--奖励系统
sysMsg:set(335, 0x17, "刷橙色任务，得礼券大礼：玩家[p:%u:%s]在山河城>武行馆中轻而易举地刷出了橙色任务，获得了%u元宝奖励。大家一起恭喜他吧。")
sysMsg:set(336, 0x17, "国战连胜，无人能敌：玩家[p:%u:%s]在国战中连胜次数达到了，获得了%u礼券奖励。大家一起膜拜他吧。")
sysMsg:set(337, 0x17, "强化极品装备，得礼券大礼：[p:%u:%s]成为了第%u个在铁匠铺里强化+8武器的玩家，威风八面。")
sysMsg:set(338, 0x17, "元宝大派送，你得装备我付账：[p:%u:%s]成为了第%u个探险出橙色装备的玩家，得装备又元宝，大家一起围观他吧。")
sysMsg:set(343, 0, "恭喜您获得了开服新人王称号，奖励%u元宝")
sysMsg:set(344, 0x17, "恭喜[p:%u:%s]，[p:%u:%s]，[p:%u:%s]分别荣膺了等级新人王称号，分别获得了元宝大礼。大家一起祝贺他们吧")
sysMsg:set(345, 0x17, "恭喜[p:%u:%s]，[p:%u:%s]，[p:%u:%s]分别荣膺了竞技场新人王称号，分别获得了元宝大礼。大家一起祝贺他们吧")
sysMsg:set(346, 0, "新人王邮件")

sysMsg:set(347, 0x17, "[p:%u:%s]成功将[p:%u:%s]击飞回城")

sysMsg:set(348, 0, "宗族邀请")
sysMsg:set(349, 0, "%s邀请你加入宗族%s")
sysMsg:set(350, 0, "宗族结盟")
sysMsg:set(351, 0, "%s的族长%s恳请与您结盟共商大事，你是否允诺？结盟后你的宗族将多一个朋友，在双方宗族城开放期间都可进入城内参与防守。")
sysMsg:set(352, 0, "%s的族长%s同意了你的请求。")
sysMsg:set(353, 0, "%s的族长%s拒绝了你的请求。")
sysMsg:set(354, 0, "%s的族长%s与你解除同盟关系。")
sysMsg:set(355, 0, "宗族解盟")

-------------------
sysMsg:set(360, 0, "竞技场NO1元宝奖励")
sysMsg:set(361, 0, "恭喜您成功的守住了竞技场第一名，获得了%u元宝奖励！再接再厉吧！")
sysMsg:set(362, 0x17, "今日竞技场第一名是[p:%u:%s]，恭喜他获得了%u元宝奖励，大家恭喜他！")
sysMsg:set(363, 0, "开服探险奖励")
sysMsg:set(364, 0, "在今日的探险中，你的豪迈为你赢得了%u礼券的奖励，酷毙了！")

sysMsg:set(370, 0x17, "[p:%u:%s]乘[p:%u:%s]不备，暗下杀手偷袭，却未曾料到反遭羞辱，被[p:%u:%s]击飞回城。")
sysMsg:set(371, 0x17, "[p:%u:%s]行刺[p:%u:%s]失败，被[p:%u:%s]轻描淡写的一击回城。")

sysMsg:set(375, 0x27, "恭喜！[p:%u:%s]是第一位挑战演武场第%u层成功的勇士！")
sysMsg:set(376, 0x27, "恭喜！[p:%u:%s]是第一位挑战演武场第%u层成功的勇士！获得%u礼券和%u个[4:%u]！")

sysMsg:set(10000, 0, " [p:%u:%s] ")
sysMsg:set(10001, 0, " [f:%u:%s] ")
sysMsg:set(10002, 0, " [4:%u]")
sysMsg:set(10003, 0, " [4:%u]x%u")

sysMsg:set(500, 1, "午夜派发礼券咯! 每人 %u!")
sysMsg:set(600, 1, "查询玩家: (%llu) %s  等级: %u")
sysMsg:set(601, 1, "所在地点: %s %s")
sysMsg:set(602, 1, "元宝: %u  礼券: %u")
sysMsg:set(603, 1, "银币: %u  铜币: %u")
sysMsg:set(604, 1, "%u - [f:%u:%s]  等级: %u  潜力: %g")
sysMsg:set(610, 1, "测试攻击 %s(%u) 第%u层，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(611, 1, "测试攻击 %s，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(611, 1, "测试 %s 攻击 %s，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")

sysMsg:set(400, 0x17, "不好了，恐怖的怪物[1:%u]出现在[2:%u]!");
sysMsg:set(401, 0x17, "[1:%u]终于被英雄[p:%u:%s]打败了，世界又恢复了平静! [1:%u]的绝叫:“我一定会回来的!”");
sysMsg:set(402, 0x17, "[1:%u]消失在山海大陆: 你们太弱了，大爷不陪你们玩了!");
sysMsg:set(403, 0x16, "[1:%u]在山海大陆的[2:%u]: 吼吼，天下无敌!");
sysMsg:set(404, 0x17, "山海大陆的[2:%u]感受到一股邪恶力量的侵袭，[1:%u]即将诞生");
sysMsg:set(405, 0x17, "通过浴血奋战，神勇无比的[p:%u:%s]已经将[1:%u]的HP消耗到%u%%以下");
sysMsg:set(406, 0, "武将修炼");
sysMsg:set(407, 0, "你的将领%s已完成修炼，花费%u元宝，获得了%u点经验。");
sysMsg:set(408, 0, "你的将领%s已完成修炼，花费%u银币，获得了%u点经验。");
sysMsg:set(409, 0, "你的将领%s已完成修炼，花费%u元宝，获得了%u点经验。返还元宝%u。");

sysMsg:set(410, 0, "你的将领%s已完成修炼，花费%u银币，获得了%u点经验。返还银币%u。");
sysMsg:set(411, 0, "宗祠");
sysMsg:set(412, 0, "南门");
sysMsg:set(413, 0, "北门");
sysMsg:set(414, 0, "南门守护者");
sysMsg:set(415, 0, "北门守护者");
sysMsg:set(416, 0x35, "需要打破城门才可进入宗祠");

sysMsg:set(417, 0x35, "%s在宗祠%s已经三杀了，吼吼。");
sysMsg:set(418, 0x35, "%s在宗祠%s已经四杀，太变态了。");
sysMsg:set(419, 0x35, "%s在宗祠%s连杀5个了，天呐谁来阻挡他一下。");
sysMsg:set(420, 0x35, "%s在宗祠%s已经6杀了，6杀了？");
sysMsg:set(421, 0x35, "%s在宗祠%s已经7杀，看不下去了。");
sysMsg:set(422, 0x35, "%s在宗祠%s已经8杀了...");
sysMsg:set(423, 0x35, "%s在宗祠%s已经9杀了，不知道用了多少群体增强符哦。");
sysMsg:set(424, 0x35, "%s在宗祠%s已经10杀，超越武圣。");

sysMsg:set(425, 0x35, "%s在宗祠%s结束了%s的三杀。");

sysMsg:set(426, 0x35, "宗族升级了。");
sysMsg:set(427, 0x35, "你不能攻击城门，还有人在防守。");
sysMsg:set(428, 0x35, "宗祠正在被攻击。");
sysMsg:set(429, 0x45, "%s为宗族捐献了%u战功");
sysMsg:set(430, 0x45, "%s为宗族捐献了%u银币");
sysMsg:set(431, 0x35, "你不能攻击宗祠，还有人在防守。");

sysMsg:set(440, 0, "宗族战邮件");
sysMsg:set(441, 0, "恭喜你，你的宗族齐心协力在宗族战中防守成功，宗祠完好无缺。");
sysMsg:set(442, 0, "很遗憾，你的宗族防守失败，宗祠被攻破，宗族损失战功%u");
sysMsg:set(443, 0, "再接再厉，你的宗族城防守成功，宗祠虽破损但不损失战功");
sysMsg:set(444, 0, "宗族战个人奖励");
sysMsg:set(445, 0, "恭喜你在刚才的宗族战中战斗胜利并获得小银票。小银票在同一个宗族战内最多获得1张，每天最多可以获得3次。");
sysMsg:set(446, 0x35, "获得%u点经验");
sysMsg:set(447, 0, "你在本次宗族战中夺得战功%u，战功已捐献到你的宗族等级中。另获得%u经验。");
sysMsg:set(448, 0x15, "今日宗族战已结束，恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。第三名宗族%s获得1个宗族宝箱。");
sysMsg:set(449, 0x15, "今日宗族战已结束，恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。");
sysMsg:set(450, 0x15, "今日宗族战已结束，恭喜宗族%s夺得第一，获得3个宗族宝箱。");
sysMsg:set(451, 0x15, "【%s】的宗祠被攻破了，胜利与他们失之交臂");
sysMsg:set(452, 0, "一");
sysMsg:set(453, 0, "二");
sysMsg:set(454, 0, "三");
sysMsg:set(455, 0, "恭喜，你的宗族今日夺得第%s，获得%u个宗族宝箱。");
sysMsg:set(456, 0x16, "宗族战5分钟后打响，请参加战役的各位提早做好准备");
sysMsg:set(457, 0x16, "宗族战打响了, 让战火在这片山海大陆上熊熊燃烧");
sysMsg:set(458, 0x15, "【%s】的城门已被攻破啦，局势会朝什么方向发展完全由你来决定！");
sysMsg:set(459, 0x15, "今日宗族战已结束，恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。第三名宗族%s获得1个宗族宝箱，本宗族排名第%u");

sysMsg:set(460, 0x45, "%s加入了宗族");
sysMsg:set(461, 0x45, "%s离开了宗族");
sysMsg:set(462, 0x45, "与%s结盟了");
sysMsg:set(463, 0x45, "与%s解盟了");

sysMsg:set(464, 0, "名城-%s");
sysMsg:set(465, 0, "英雄之城");

sysMsg:set(479, 0, "%s\n\t%s");
sysMsg:set(480, 0, "夺城战");
sysMsg:set(481, 0, "守城战");
sysMsg:set(482, 0, "本次夺城战的胜利者是[%s]宗族，恭喜他们获得宗族宝箱*3。非常可惜，[%s]位居第二，获得宗族宝箱*2。[%s]位居第三，获得宗族宝箱*1。");
sysMsg:set(483, 0, "本次夺城战的胜利者是[%s]宗族，恭喜他们获得宗族宝箱*3。非常可惜，[%s]位居第二，获得宗族宝箱*2。");
sysMsg:set(484, 0, "本次夺城战的胜利者是[%s]宗族，恭喜他们获得宗族宝箱*3。");
sysMsg:set(485, 0, "守城战将在次日同时间开放，[%s]宗族的成员会作为防守方驻扎在名城。在夺城战中失利的宗族可在下场守城战中挽回局势，胜利者将取代[%s]宗族的位置。");
sysMsg:set(486, 0, "新一轮的夺城战在次日的同一时间开启。");
sysMsg:set(487, 0, "你的宗族在本次夺城战中取得胜利，获得宗族宝箱*3。[%s]位居第二，获得宗族宝箱*2。[%s]位居第三，获得宗族宝箱*1。");
sysMsg:set(488, 0, "你的宗族在本次夺城战中取得胜利，获得宗族宝箱*3。[%s]位居第二，获得宗族宝箱*2。");
sysMsg:set(489, 0, "你的宗族在本次夺城战中取得胜利，获得宗族宝箱*3。");
sysMsg:set(490, 0, "守城战将在次日同时间开放，你的宗族会以名城所有者的身份参战，原名城NPC不会协助防守。如果守城战中宗祠不幸被攻破，你的防守身份将被获得积分最高的宗族所替代。");
sysMsg:set(491, 0, "新一轮的守城战在次日的同一时间开启。");
sysMsg:set(492, 0, "恭喜，你的宗族成功守住了名城宗祠，获得宗族宝箱*5。");
sysMsg:set(493, 0, "很遗憾，你的宗族防守失利，城池已被宗族[%s]全全控制。[%s]获得宗族宝箱*3，第二名[%s]获得宗族宝箱*2，第三名[%s]获得宗族宝箱*1。");
sysMsg:set(494, 0, "很遗憾，你的宗族防守失利，城池已被宗族[%s]全全控制。[%s]获得宗族宝箱*3，第二名[%s]获得宗族宝箱*2。");
sysMsg:set(495, 0, "很遗憾，你的宗族防守失利，城池已被宗族[%s]全全控制。[%s]获得宗族宝箱*3。");
sysMsg:set(496, 0, "新一轮的守城战将在次日的同一时间开启，你的宗族会以攻击方的身份参战。");
sysMsg:set(497, 0, "恭喜，你的宗族成功夺取了[%s]控制下的宗祠，接下英雄之城的所有权，并获得宗族宝箱*3。有惊无险，[%s]位居第二，获得宗族宝箱*2。[%s]位居第三，获得宗族宝箱*1。");
sysMsg:set(498, 0, "恭喜，你的宗族成功夺取了[%s]控制下的宗祠，接下英雄之城的所有权，并获得宗族宝箱*3。有惊无险，[%s]位居第二，获得宗族宝箱*2。");
sysMsg:set(499, 0, "恭喜，你的宗族成功夺取了[%s]控制下的宗祠，接下英雄之城的所有权，并获得宗族宝箱*3。");
sysMsg:set(500, 0, "新一轮的守城战将在次日的同一时间开启。你的宗族会以名城所有者的身份参战，原名城NPC不会协助防守，如果守城战中宗祠不幸被攻破，你的防守身份将被获得积分最高的宗族所替代。");
sysMsg:set(501, 0, "很遗憾，你的宗族攻取失利，名城已成为宗族[%s]的囊中之物。[%s]位居第二，获得宗族宝箱*2。[%s]位居第三，获得宗族宝箱*1。");
sysMsg:set(502, 0, "很遗憾，你的宗族攻取失利，名城已成为宗族[%s]的囊中之物。[%s]位居第二，获得宗族宝箱*2。");
sysMsg:set(503, 0, "很遗憾，你的宗族攻取失利，名城已成为宗族[%s]的囊中之物。");
sysMsg:set(504, 0, "很遗憾，宗族[%s]防守成功，并获得宗族宝箱*5。新一轮的守城战将在次日的同一时间开启，你的宗族仍然有机会夺取名城。");
sysMsg:set(505, 0, "很遗憾，宗族[%s]防守成功，并获得宗族宝箱*5。新一轮的夺城战将在次日的同一时间开启，你的宗族仍然有机会夺取名城。");
sysMsg:set(506, 0, "很遗憾，英雄之城没有被攻破。");

sysMsg:set(510, 0x25, "今日夺城战已结束，英雄之城被攻破。恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。第三名宗族%s获得1个宗族宝箱。");
sysMsg:set(511, 0x25, "今日夺城战已结束，英雄之城被攻破。恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。");
sysMsg:set(512, 0x25, "今日夺城战已结束，英雄之城被攻破。恭喜宗族%s夺得第一，获得3个宗族宝箱。");
sysMsg:set(513, 0x25, "今日夺城战已结束，英雄之城未被攻破。");
sysMsg:set(514, 0x25, "今日守城战已结束，恭喜宗族%s防守成功，获得5个宗族宝箱。");
sysMsg:set(515, 0x25, "今日守城战已结束，名城[%s]被攻破。恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。第三名宗族%s获得1个宗族宝箱。");
sysMsg:set(516, 0x25, "今日守城战已结束，名城[%s]被攻破。恭喜宗族%s夺得第一，获得3个宗族宝箱。第二名宗族%s获得2个宗族宝箱。");
sysMsg:set(517, 0x25, "今日守城战已结束，名城[%s]被攻破。恭喜宗族%s夺得第一，获得3个宗族宝箱。");

sysMsg:set(518, 0x35, "你不能攻击城门，还有名将在防守。");
sysMsg:set(519, 0x35, "你不能攻击宗祠，还有名将在防守。");

sysMsg:set(520, 0, "夺城战战败");
sysMsg:set(521, 0, "夺城战胜利");
sysMsg:set(522, 0, "守城战胜利");
sysMsg:set(523, 0, "守城战夺城成功");
sysMsg:set(524, 0, "守城战战败");
sysMsg:set(525, 0, "夺城战失败");
sysMsg:set(526, 0, "守城战失利");

sysMsg:set(527, 0x16, "名城争夺战还有2分钟就将打响，请参加战役的各位勇士提前做好准备。");
sysMsg:set(528, 0x16, "名城争夺战还有1分钟就将打响，请参加战役的各位勇士提前做好准备。");
sysMsg:set(529, 0x16, "名城争夺战已开始。");
sysMsg:set(530, 0, "你在本次名城争夺战中获得%u积分，兑换为%u经验，已加到角色总经验中。");

sysMsg:set(540, 0, "参与竞技场得潜力保护符");
sysMsg:set(541, 0, "今天你在竞技场英勇奋战了十场，你的顽强精神感动了上天，获得了潜力保护符一张。可以在日常—设施—潜力洗炼中用潜力提升符提升潜力值时保证失败不下跌。");

sysMsg:set(545, 0, "演武场奖励");
sysMsg:set(546, 0, "由于你在之前在演武场闯关中表现突出，特此奖励你%u礼券。在今后的演武场中打通的层数越多，奖励的礼券也越多。期待着你的活跃！");

sysMsg:set(700, 0x16, "第%u届%s蜀山传奇会外围赛即将开始，离报名结束还有%u分钟，请尽快报名。")
sysMsg:set(701, 0x15, "第%u届%s蜀山传奇会外围赛顺利开始，参赛者可关注自己的赛事。从周二32强赛阶段至决赛，每赛事可进行1次投注。")
sysMsg:set(702, 0x15, "恭喜%s顺利入围第%u届%s蜀山传奇会%s。")
sysMsg:set(703, 0x15, "%s蜀山传奇会%s比赛即将开始，离投注结束还有%u分钟，请尽快投注。")
sysMsg:set(704, 0x15, "%s蜀山传奇会%s比赛第%u轮开始，各位勇士可前去观赛，观赛事者知天下。")
sysMsg:set(705, 0x15, "恭喜[p:%u:%s]获得第%u届%s蜀山传奇会冠军荣誉，并且得到奖励: %s")

sysMsg:set(710, 0, "恭喜入围蜀山传奇会32强")
sysMsg:set(711, 0, "恭喜入围第%u届蜀山传奇会32强！你的成绩%u胜%u败。32强进16强晋级赛将于明日12:15开始第一轮，祝你成功！\n因为你获得3场以上的胜利所以额外获得2张小银票。")
sysMsg:set(712, 0, "恭喜入围第%u届蜀山传奇会32强！你的成绩%u胜%u败。32强进16强晋级赛将于明日12:15开始第一轮，祝你成功！")
sysMsg:set(713, 0, "未入围蜀山传奇会")
sysMsg:set(714, 0, "很遗憾，未入围第%u届蜀山传奇会32强，你的成绩%u胜%u败，你超越了%.2f%%的参赛者。\n你可以关注明日00:00-12:15的32强赛事投注。\n因为你获得3场以上的胜利所以额外获得2张小银票。")
sysMsg:set(715, 0, "很遗憾，未入围第%u届蜀山传奇会32强，你的成绩%u胜%u败，你超越了%.2f%%的参赛者。\n你可以关注明日00:00-12:15的32强赛事投注。")

sysMsg:set(716, 0, "蜀山传奇会%s第%u轮胜利")
sysMsg:set(717, 0, "第%u届%s蜀山传奇会%s第%u轮，恭喜你击败对手 %s 取得胜利！\n请继续加油，保持胜利状态，下一轮比赛将在%02u:%02u开始。")
sysMsg:set(718, 0, "蜀山传奇会%s第%u轮战败")
sysMsg:set(719, 0, "第%u届%s蜀山传奇会%s第%u轮，你的对手 %s 击败了你！\n建议你对将领、装备或阵型进行调整，达到最佳状态来迎接下一轮的比赛，下一轮比赛将在%02u:%02u开始，预祝你成功！")
sysMsg:set(720, 0, "第%u届%s蜀山传奇会成功晋级%s")
sysMsg:set(721, 0, "第%u届%s蜀山传奇会%s第%u轮，你顺利击败对手 %s，以%u胜%u败的成绩，晋级成功！（本轮比赛共有%u名玩家对你进行投注），下场比赛将于明日%02u:%02u开始第一轮，祝你成功！")
sysMsg:set(722, 0, "第%u届%s蜀山传奇会未能晋级%s")
sysMsg:set(723, 0, "第%u届%s蜀山传奇会%s，你的对手 %s击败了你，你以%u胜%u败的成绩，未能晋级。（本轮比赛共有%u名玩家对你进行投注），颁奖将于本周六比赛结束后进行。")
sysMsg:set(724, 0, "获得第%u届%s蜀山传奇会冠军")
sysMsg:set(725, 0, "在决赛中，你顺利击败对手 %s，以%u胜%u败的成绩，获得第%u届%s蜀山传奇会冠军（本轮比赛共有%u名玩家对你进行投注），特此颁给你%s称号和冠军奖励。")
sysMsg:set(726, 0, "获得第%u届%s蜀山传奇会亚军")
sysMsg:set(727, 0, "在决赛中，你的对手 %s 击败了你，以%u胜%u败的成绩，获得第%u届%s蜀山传奇会亚军（本轮比赛共有%u名玩家对你进行投注），特此颁给亚军奖励。")
sysMsg:set(728, 0, "第%u届%s蜀山传奇会颁奖")
sysMsg:set(729, 0, "谢谢你参与第%u届%s蜀山传奇会，并获得%s的荣耀，特此颁给你%s。")

sysMsg:set(730, 0, "%s 竞猜成功")
sysMsg:set(731, 0, "你在 %s 赛中，投注 %s %u银币，他成功晋级，你竞猜成功！获得双倍投注额 %u 银币")
sysMsg:set(732, 0, "%s 竞猜上届冠军成功")
sysMsg:set(733, 0, "你在 %s 赛中，投注上届冠军 %s %u银币，他成功晋级，你竞猜成功！共获得 %u 银币\n*注：投注上届冠军，收益减半")
sysMsg:set(734, 0, "%s 竞猜失败")
sysMsg:set(735, 0, "你在 %s 赛中，投注 %s %u银币，他未能晋级，竞猜失败！失去全部投注额。")

sysMsg:set(780, 0, "全球")
sysMsg:set(781, 0, "三十二强")
sysMsg:set(782, 0, "十六强")
sysMsg:set(783, 0, "八强")
sysMsg:set(784, 0, "四强")
sysMsg:set(785, 0, "决赛")

sysMsg:set(2000, 0, "修炼洞府被抢占")
sysMsg:set(2001, 0, "剑仙 %s 见你的修炼洞府灵气浓郁,便蛮横地占为己有,你无奈之下去了无主之地")
sysMsg:set(2002, 0, "火种制作成功")
sysMsg:set(2003, 0, "火种制作失败，没有相关物品")

