sysMsg:set(10, 0x20, "[p:%u:%s] 招募了散仙 [f:%u:%s]")
sysMsg:set(11, 0x20, "[p:%u:%s] 解雇了散仙 [f:%u:%s]")

sysMsg:set(100, 0x35, "获得经验值%llu")
sysMsg:set(101, 0x35, "升到了%u级")
sysMsg:set(102, 0x35, "获得了[4:%u]x%u")
sysMsg:set(103, 0x35, "获得了[4:%u]")
sysMsg:set(104, 0x35, "使用了[4:%u]")
sysMsg:set(105, 0x35, "获得荣誉%u")
sysMsg:set(106, 0x35, "花费了荣誉%u")
sysMsg:set(107, 0x35, "接受任务[5:%u]")
sysMsg:set(108, 0x35, "任务失败")
sysMsg:set(109, 0x35, "完成任务[5:%u]")
sysMsg:set(110, 0x35, "获得散仙[f:%u:%s]")
sysMsg:set(111, 0x35, "已解雇散仙[f:%u:%s]")
sysMsg:set(112, 0x35, "出价成功")
sysMsg:set(113, 0x35, "出价被超过")
sysMsg:set(114, 0x35, "背包已满")
sysMsg:set(115, 0x35, "物品已放入九疑鼎")
sysMsg:set(116, 0x35, "已出售物品")
sysMsg:set(117, 0x35, "加入了仙界至尊战队「%s」")
sysMsg:set(118, 0x35, "该物品无法出售")
sysMsg:set(119, 0x35, "已发送申请加入「%s」")
sysMsg:set(120, 0x35, "创建帮派成功")
sysMsg:set(121, 0x35, "加入了帮派「%s」")
sysMsg:set(122, 0x35, "帮派被解散")
sysMsg:set(124, 0x35, "已退出帮派")
sysMsg:set(125, 0x35, "已被从帮派中移除")
sysMsg:set(126, 0x35, "帮派职位变更")
sysMsg:set(128, 0x35, "帮主职位移交")
sysMsg:set(129, 0x35, "成为了帮主")
sysMsg:set(130, 0x35, "获得了%u英雄岛积分")
sysMsg:set(131, 0x35, "获得了%u点仙界至尊积分")
sysMsg:set(132, 0x35, "添加好友成功")
sysMsg:set(133, 0x35, "添加好友失败")
sysMsg:set(134, 0x35, "删除好友成功")
sysMsg:set(135, 0x35, "添加黑名单成功")
sysMsg:set(136, 0x35, "添加黑名单失败")
sysMsg:set(137, 0x35, "有新的邮件")
sysMsg:set(138, 0x35, "邮件发送成功")
sysMsg:set(139, 0x35, "邮件删除成功")
sysMsg:set(140, 0x35, "邮箱已满")
sysMsg:set(141, 0x35, "已进入战场")
sysMsg:set(142, 0x35, "已退出战场")
sysMsg:set(144, 0x35, "已被[p:%u:%s]击败回城")
sysMsg:set(145, 0x35, "消耗%u点兽神感应")
sysMsg:set(146, 0x35, "获得兽神感应+%u")
sysMsg:set(147, 0x35, "获得状态「%s」")
sysMsg:set(148, 0x35, "消耗仙缘%u")
sysMsg:set(149, 0x35, "获得仙石%u")
sysMsg:set(150, 0x35, "消费仙石%u")
sysMsg:set(151, 0x35, "获得银币%u")
sysMsg:set(152, 0x35, "消费银币%u")
sysMsg:set(153, 0x35, "已被从仙界至尊战队踢出")
sysMsg:set(154, 0x35, "仙界至尊战队被解散")
sysMsg:set(155, 0x35, "获得礼券%u")
sysMsg:set(156, 0x35, "消费礼券%u")
sysMsg:set(157, 0x35, "消耗凤髓%u")
sysMsg:set(158, 0x35, "消耗龙元%u")
sysMsg:set(159, 0x35, "获得龙元%u")
sysMsg:set(160, 0x35, "获得凤髓%u")
sysMsg:set(161, 0x35, "获得仙缘%u")
sysMsg:set(162, 0x35, "学会[7:%u%u]")
sysMsg:set(163, 0x35, "消费龙魂%u")
sysMsg:set(164, 0x35, "获得龙魂%u")
sysMsg:set(165, 0x35, "消费帮派贡献%u")
sysMsg:set(166, 0x35, "获得帮派贡献%u")
sysMsg:set(167, 0x35, "获得天劫积分%u")
sysMsg:set(168, 0x35, "获得天劫贡献%u")
sysMsg:set(169, 1, "获得天劫积分%u")
sysMsg:set(170, 1, "获得天劫贡献%u")
sysMsg:set(171, 0x35, "不能放入九疑鼎")
sysMsg:set(172, 0x35, "不能出售物品")
sysMsg:set(173, 0x35, "获得末日之战血印%u")
sysMsg:set(174, 1, "获得末日之战血印%u")
sysMsg:set(175, 0x35, "获得仙蕴精华%u")
sysMsg:set(176, 1, "获得仙蕴精华%u")
sysMsg:set(177, 0x35, "消耗仙蕴精华%u")
sysMsg:set(178, 1, "消耗仙蕴精华%u")
sysMsg:set(179, 0x35, "创建仙界至尊战队成功")
sysMsg:set(180, 0x35, "在仙界传奇被 %s 挑战成功！")

sysMsg:set(181, 0x35, "未通过防沉迷认证，获得经验值减半")
sysMsg:set(182, 0x35, "未通过防沉迷认证，获得银币减半%u")
sysMsg:set(183, 0x35, "未通过防沉迷认证，获得减半铜钱%u")
sysMsg:set(184, 0x35, "未通过防沉迷认证，没有获得收益")

sysMsg:set(185, 0x35, "您获得%u点声望")
sysMsg:set(186, 0x35, "您消费%u点声望")

sysMsg:set(187, 0x35, "该玩家已经加入其它队伍，请邀请其它玩家参与")
sysMsg:set(188, 0x35, "您的队伍已满，无法再次邀请")
sysMsg:set(189, 0x35, "您当前已经加入队伍，无法重复加取，请尝试退出小队后再添加")
sysMsg:set(190, 0x35, "礼包发送成功")
sysMsg:set(191, 0x35, "获得仙魄%u")
sysMsg:set(192, 0x35, "消耗仙魄%u")
sysMsg:set(193, 1, "您获得镇魔值%u")
sysMsg:set(194, 0x35, "获得镇魔值%u")
sysMsg:set(195, 0x35, "获得玄天瑞露%u")
sysMsg:set(196, 0x35, "消耗玄天瑞露%u")

sysMsg:set(1000, 1, "[f:%u:%s]获得经验值%llu")
sysMsg:set(1001, 1, "[f:%u:%s]升级了，等级提升到了%u")
sysMsg:set(1002, 1, "您获得了[4:%u]x%u")
sysMsg:set(1003, 1, "您获得了[4:%u]")
sysMsg:set(1004, 1, "您使用了[4:%u]")
sysMsg:set(1005, 1, "您获得%u点荣誉")
sysMsg:set(1006, 1, "您消费%u点荣誉")
sysMsg:set(1007, 1, "您接取了任务[5:%u]")
sysMsg:set(1008, 1, "任务[5:%u]失败了")
sysMsg:set(1009, 1, "您完成了任务[5:%u]")
sysMsg:set(1010, 1, "您招募了散仙[f:%u:%s]")
sysMsg:set(1011, 1, "您解雇了散仙[f:%u:%s]")
sysMsg:set(1012, 1, "您对[f:%u:%s]的竞拍成功")
sysMsg:set(1013, 1, "您对[f:%u:%s]的竞价被超过了")
sysMsg:set(1014, 1, "您的背包已满，无法再获得物品")
sysMsg:set(1015, 1, "物品成功加入九疑鼎")
sysMsg:set(1016, 1, "出售物品成功")
sysMsg:set(1017, 1, "您加入了仙界至尊战队「%s」")
sysMsg:set(1018, 1, "物品[4:%u]不可出售")
sysMsg:set(1019, 1, "申请加入「%s」成功")
sysMsg:set(1020, 1, "创建帮派「%s」成功")
sysMsg:set(1021, 1, "您加入了帮派「%s」")
sysMsg:set(1022, 1, "您解散了帮派「%s」")
sysMsg:set(1023, 1, "您所在的帮派「%s」被解散了")
sysMsg:set(1024, 1, "您退出了帮派「%s」")
sysMsg:set(1025, 1, "您被[p:%u:%s]从「%s」移除了")
sysMsg:set(1026, 1, "您被提升到「%s」")
sysMsg:set(1027, 1, "您被降为「%s」")
sysMsg:set(1028, 1, "您将帮主位置转让给了[p:%u:%s]")
sysMsg:set(1029, 1, "[p:%u:%s]将帮主的位置转让给您了，您成为了「%s」的帮主")
sysMsg:set(1030, 1, "您获得了%u英雄岛积分")
sysMsg:set(1031, 1, "您获得了%u点仙界至尊积分")
sysMsg:set(1032, 1, "您将[p:%u:%s]添加到好友名单")
sysMsg:set(1033, 1, "添加好友[p:%u:%s]失败")
sysMsg:set(1034, 1, "您从好友名单中移除了[p:%u:%s]")
sysMsg:set(1035, 1, "您将[p:%u:%s]添加到黑名单")
sysMsg:set(1036, 1, "添加[p:%u:%s]到黑名单失败")
sysMsg:set(1037, 1, "您收到新的邮件")
sysMsg:set(1040, 1, "您的信箱已满，无法接收更多邮件")
sysMsg:set(1041, 1, "您加入了阵营战，为[3:%u]出战")
sysMsg:set(1042, 1, "您离开了阵营战场")
sysMsg:set(1043, 1, "您在决斗中战胜了[p:%u:%s]")
sysMsg:set(1044, 1, "[p:%u:%s]在决斗中战胜了您")
sysMsg:set(1045, 1, "您消耗%u点兽神感应")
sysMsg:set(1046, 1, "您获得%u点兽神感应")
sysMsg:set(1047, 1, "您获得了「%s」效果")
sysMsg:set(1048, 1, "您消耗%u仙缘")
sysMsg:set(1049, 1, "您获得%u仙石")
sysMsg:set(1050, 1, "您消费%u仙石")
sysMsg:set(1051, 1, "您获得%u银币")
sysMsg:set(1052, 1, "您消费%u银币")
sysMsg:set(1053, 1, "您被[p:%u:%s]从仙界至尊战队「%s」踢出了")
sysMsg:set(1054, 1, "您解散了仙界至尊战队「%s」")
sysMsg:set(1055, 1, "您获得%u礼券")
sysMsg:set(1056, 1, "您消费%u礼券")
sysMsg:set(1057, 1, "您消耗%u凤髓")
sysMsg:set(1058, 1, "您消耗%u龙元")
sysMsg:set(1059, 1, "您获得%u龙元")
sysMsg:set(1060, 1, "您获得%u凤髓")
sysMsg:set(1061, 1, "您获得%u仙缘")
sysMsg:set(1062, 1, "[f:%u:%s]学会了[7:%u%u]")
sysMsg:set(1063, 1, "您消费%u龙魂")
sysMsg:set(1064, 1, "您获得%u龙魂")
sysMsg:set(1065, 1, "您消费%u帮派贡献")
sysMsg:set(1066, 1, "您获得%u帮派贡献")
sysMsg:set(1067, 1, "您获得%u仙魄")
sysMsg:set(1068, 1, "您消耗%u仙魄")
sysMsg:set(1069, 1, "您获得%u玄天瑞露")
sysMsg:set(1070, 1, "您消耗%u玄天瑞露")

sysMsg:set(1076, 0x35, "你已离开仙界至尊「%s」战队！")
sysMsg:set(1077, 0x35, "战队长职位移交成功！")
sysMsg:set(1078, 0x35, "你已成为仙界至尊「%s」战队长！")
sysMsg:set(1079, 1, "您创建仙界至尊战队「%s」成功")
sysMsg:set(1080, 1, "您在仙界传奇被 %s 挑战成功！")
sysMsg:set(1081, 1, "您未通过防沉迷认证，获得经验值减半")
sysMsg:set(1082, 1, "您未通过防沉迷认证，获得银币减半%u")
sysMsg:set(1083, 1, "您未通过防沉迷认证，获得减半铜钱%u")
sysMsg:set(1084, 1, "您未通过防沉迷认证，没有获得收益")

sysMsg:set(1090, 1, "您获得%u点声望")
sysMsg:set(1091, 1, "您消费%u点声望")

sysMsg:set(1092, 0x1, "QQ大厅特权额外获得%u经验")
sysMsg:set(1093, 0x35, "QQ大厅特权额外获得%u经验")
sysMsg:set(1094, 0x1, "3366特权额外获得%u经验")
sysMsg:set(1095, 0x35, "3366特权额外获得%u经验")
sysMsg:set(1096, 0x1, "QQ空间特权额外获得%u经验")
sysMsg:set(1097, 0x35, "QQ空间特权额外获得%u经验")
sysMsg:set(1098, 0x1, "朋友网特权额外获得%u经验")
sysMsg:set(1099, 0x35, "朋友网特权额外获得%u经验")
sysMsg:set(4006, 1, "好友的礼物箱已经满了，无法接受更多的礼物了，快去提醒好友接受礼物吧！")
sysMsg:set(4007, 1, "每天只能为同一个好友赠送一次礼物哦！")
sysMsg:set(4008, 1, "赠送成功")
sysMsg:set(4009, 1, "赠送失败，好友等级还不足40级")


sysMsg:set(200, 0, "竞拍成功")
sysMsg:set(201, 0, "散仙名: %s\n请确认并接收散仙。")
sysMsg:set(202, 0, "竞拍价被超越")
sysMsg:set(203, 0, "您参与竞拍的散仙 %s 出价已经被超过。\n您之前出价的%u银币已经被退还。")
sysMsg:set(204, 0, "您的 %s 已经自动完成，请回到任务npc处交付并领取丰厚奖励。\n祝您游戏愉快！")
sysMsg:set(205, 0, "")
sysMsg:set(206, 0, "")
sysMsg:set(207, 0, "来自 [p:%u:%s] 的好友邀请")
sysMsg:set(208, 0, "[p:%u:%s] 邀请您成为好友。\n是否接受邀请？")
sysMsg:set(210, 0, "经验循环任务")
sysMsg:set(211, 0, "对方队伍已满或您已在队伍中")
sysMsg:set(212, 0, "您已经接受了邀请")
sysMsg:set(213, 0, "您已经拒绝了邀请")
sysMsg:set(214, 0x66, "玩家 [p:%u:%s] 使用了【角色更名卡】将自己的名字改为 [p:%u:%s] ，特此公告！")
sysMsg:set(215, 0x45, "玩家 [p:%u:%s] 使用了【角色更名卡】将自己的名字改为 [p:%u:%s] ，特此公告！")
sysMsg:set(216, 0, "玩家[p:%u:%s]使用了【角色更名卡】将自己的名字改为[p:%u:%s]，特此公告！")
sysMsg:set(217, 0, "角色更名通知")
sysMsg:set(218, 0, "来自 [p:%u:%s] 的光棍节组队邀请")
sysMsg:set(219, 0, "[p:%u:%s] 邀请您结伴同渡光棍节，是否加入？")
sysMsg:set(220, 0, "来自 [p:%u:%s] 的组队邀请")
sysMsg:set(221, 0, "[p:%u:%s] 邀请您结伴参与情义罗盘，是否加入？")
sysMsg:set(222, 0, "")
sysMsg:set(223, 0, "玩家 「%s」 申请加入帮派")
sysMsg:set(224, 0, "玩家 「%s」 申请加入您的帮派，请在帮派审请面板里查看。\n祝您游戏愉快！")
sysMsg:set(225, 0, "加入帮派的申请通过")
sysMsg:set(226, 0, "您的申请已被批准，恭喜加入帮派 「%s」。\n祝您游戏愉快！")
sysMsg:set(227, 0, "加入帮派的申请被拒绝")
sysMsg:set(228, 0, "您加入帮派 「%s」 的申请已被拒绝，请重新申请加入其他帮派。\n祝您游戏愉快！")
sysMsg:set(229, 0, "您已经被开除出帮派 「%s」")
sysMsg:set(230, 0, "很遗憾您已被开除出帮派 「%s」，您可以重新申请加入或创建帮派。\n祝您游戏愉快！")
sysMsg:set(231, 0, "击退强敌的奖励")
sysMsg:set(232, 0, "在本次帮派战中，您表现优异，获得累计 %u 经验\n在本次战斗%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(233, 0, "在本次帮派战中，您表现优异，获得高级挂机加速符、 %s、%s 和 累计 %u 经验\n在本次战斗%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(234, 0, "帮派奖励分配")
sysMsg:set(235, 0, "帮主给您分配了一些奖励物品，去帮派仓库查看吧！")
sysMsg:set(236, 0, "散仙经验返还提示")
sysMsg:set(237, 0, "%u级的散仙[f:%u:%s]离开之后，将自己一半经验值转为经验丹及60%的修为值转为修为丹赠送给您，请点击接受获取")

sysMsg:set(238, 0x66, "蜀山论剑即将开始，请各位玩家去斗剑擂台报名！")
sysMsg:set(239, 0x66, "蜀山论剑还剩%u分钟就要打响，请尽快报名！")

sysMsg:set(240, 0x66, "阵营战即将开始，请各位玩家去斗剑擂台报名！")
sysMsg:set(241, 0x66, "阵营战还剩%u分钟就要打响，请尽快报名！")
sysMsg:set(242, 0x66, "帮派战即将打响，大家快去报名啊！")
sysMsg:set(243, 0x66, "帮派战还有%u分钟就要打响，请尽快报名！")
sysMsg:set(244, 0x17, "[1:%u]对您说:我正在蜀山的[2:%u]，您有兴趣的话就快来找我吧。")
sysMsg:set(245, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n哥正无所事事，有没有人放马过来啊。")
sysMsg:set(246, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n哥等的不是寂寞，是收服。")
sysMsg:set(247, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n您们都怕了吗，哥只能孤独求败了吗。")
sysMsg:set(248, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n哥就是想看看，到底有没有人愿意在我面前大显身手。")
sysMsg:set(249, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n天下英雄，惟使君与操耳。我已在此，使君何在？")
sysMsg:set(250, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n您若想要太平盛世，就别来惹我！")
sysMsg:set(251, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n姐等了好久了，怎么还没有人来啊，您们都别打酱油了。")
sysMsg:set(252, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n姐就是不想再宅在这里了，怎么就没个人成全下呢。")
sysMsg:set(253, 0x17, "[1:%u]在蜀山的[2:%u]喊道:\n妾身在此已千年之久，望有心人士快快寻来。")

sysMsg:set(254, 0, "首次充值有礼")
sysMsg:set(255, 0, "亲爱的玩家您好：\n感谢您对《蜀山传奇》的热情支持，您的首次充值礼包可以点击下方接受领取。在接受礼物的时候请为背包预留足够的空间哦。首次充值礼包内含：高级挂机加速符x2，太乙精金x10，五行真金x10，补髓益元丹x2，凝神易筋丹x2，让您畅游蜀山剑侠的世界，谱写自己传奇。")

sysMsg:set(256, 0, "VIP充值有礼")
sysMsg:set(257, 0, "亲爱的玩家您好：\n感谢您支持《蜀山传奇》，请点击下方接受领取您的 [4:%u]。在接受礼物的时候请为背包预留足够的空间哦。")

sysMsg:set(259, 0x16, "发生在[2:%u]的阵营战已结束，最终不相上下打成平手。双方所有参战玩家都将获得一定经验加成奖励。")
sysMsg:set(260, 0x16, "发生在[2:%u]的阵营战已结束，[3:%u]赢得了胜利。双方所有参战玩家都将获得一定经验加成奖励。")
sysMsg:set(261, 0, "阵营奖励")
sysMsg:set(262, 0, "感谢您参加今日的阵营战，您的神勇使门派取得了最终胜利，也为您赢得 %u 荣誉与 %u 个高级挂机加速符。您赢了%u场，输了%u场。最高连胜%u场")
sysMsg:set(263, 0, "感谢您参加今日的阵营战，虽然您的门派输掉了阵营战，但您的英勇表现仍然为您赢得了 %u 荣誉与 %u 个初级挂机加速符。您赢了%u场，输了%u场。最高连胜%u场")
sysMsg:set(264, 0, "感谢您参加今日的阵营战，双方僵持良久不相上下，您的奋战为您赢得 %u 荣誉与 %u 个初级挂机加速符。您赢了%u场，输了%u场。最高连胜%u场")

sysMsg:set(265, 0x17, "世界BOSS目前伤害排名：第一名[p:%u:%s] %u%%、第二名[p:%u:%s] %u%%、第三名[p:%u:%s] %u%%")
sysMsg:set(266, 0x17, "世界BOSS目前伤害排名：第一名[p:%u:%s] %u%%、第二名[p:%u:%s] %u%%")
sysMsg:set(267, 0x17, "世界BOSS目前伤害排名：第一名[p:%u:%s] %u%%")
sysMsg:set(268, 0, "蜀山论剑奖励")
sysMsg:set(269, 0, "您在本次蜀山论剑中，共获胜 %u 场，失败 %u 场，最高达到 %u 连杀，完成 %u 个成就（成就荣誉 %u )，共获得荣誉 %u ；您的荣誉徽章为 %u 级，可额外获得 %u 荣誉以及相应道具奖励！")

sysMsg:set(270, 0x17, "[p:%u:%s]历尽了千难万险，在副本\"%s\"第%u层获得了%s")
sysMsg:set(271, 0x17, "[p:%u:%s]幸运地从[4:%u]中开出了[4:%u]")
sysMsg:set(272, 0x17, "恭喜[p:%u:%s]首次打败\"%s\"的最终Boss，通关胜利！")

sysMsg:set(275, 0x27, "[p:%u:%s]强化[4:%u]到+%u成功！")

sysMsg:set(276, 0, "在本次帮派战中，您表现优异，获得高级挂机加速符、 %s 和 累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(278, 0, "在本次帮派战中，您表现优异，获得%s和累计 %u 经验\n在本次击退%s中伤害最高的前三名：\n第1名「%s」 %.1f%%\n第2名「%s」 %.1f%%\n第3名「%s」 %.1f%%\n我的排名：第%u名")
sysMsg:set(279, 0x17, "今日帮派战%s的第1名是[p:%u:%s]，他将获得%s、%s。排名第2的是[p:%u:%s]，排名第3的是[p:%u:%s]。")
sysMsg:set(280, 0, "恭喜您在帮派战中，身先士卒，第一个对%s造成伤害，特此奖励您50银币")
sysMsg:set(281, 0, "恭喜您在帮派战中，身先士卒，第一个对%s造成伤害，特此奖励您%s")
sysMsg:set(282, 0x17, "[p:%u:%s]身先士卒，第一个对%s造成伤害，获得特殊奖励。")

sysMsg:set(283, 0, "蓝钻贵族每日寻宝令")
sysMsg:set(284, 0, "通过有游戏内蓝钻按钮开通蓝钻会员每日都可领取寻宝令，还有更多精彩特权（每日礼包，购买仙石8折优惠，vip特权专享）等你来体验。")
sysMsg:set(285, 0, "黄钻会员每日寻宝令")
sysMsg:set(286, 0, "通过有游戏内黄钻按钮开通黄钻会员每日都可领取寻宝令，还有更多精彩特权（每日礼包，购买仙石8折优惠，vip特权专享）等你来体验。")
sysMsg:set(287, 0, "QQ会员每日寻宝令")
sysMsg:set(288, 0, "通过有游戏内QQ会员按钮开通QQ会员每日都可领取寻宝令，还有更多精彩特权（每日礼包，购买仙石8折优惠，vip特权专享）等你来体验。")

sysMsg:set(289, 0, "蜀山论剑荣誉王奖励")
sysMsg:set(290, 0, "恭喜您获得了本次蜀山论剑的荣誉王，可额外获得宝箱大礼一份，请注意接收！")
sysMsg:set(291, 0, "蜀山论剑连杀王奖励")
sysMsg:set(292, 0, "恭喜您获得了本次蜀山论剑的连杀王，可额外获得宝箱大礼一份，请注意接收！")
sysMsg:set(293, 0x17, "恭喜[p:%u:%s]在本次蜀山论剑中获得【%u】荣誉，获得本次蜀山论剑荣誉王！富有四海，万人称颂！")
sysMsg:set(294, 0x17, "恭喜[p:%u:%s]在本次蜀山论剑中达到【%u】连杀，获得本次蜀山论剑连杀王！论剑天下，谁与争锋！")
sysMsg:set(295, 0x27, "恭喜玩家[p:%u:%s]在水晶宫探宝时获得了[4:%u]x1，真是人品大爆发啊！")
sysMsg:set(296, 0, "金蛇献瑞 聚福兆祥")
sysMsg:set(297, 0, "恭喜您参加此次活动，请点击领取您的奖励。此次是第 %u 次（一共可领取 %u 次）")
sysMsg:set(298, 0, "金蛇献瑞活动额外奖励")
sysMsg:set(299, 0, "您好，本邮件是金蛇献瑞，聚福兆祥活动领完%u次奖励之后的额外奖励，请查收！")
sysMsg:set(300, 0x17, "恭喜[p:%u:%s]从女娲石盘中获得了【%u】礼券！大家一起来沾沾他的福气吧～")

sysMsg:set(304, 0, "交易成功,背包已满")
sysMsg:set(305, 0, "交易失败,背包已满")
sysMsg:set(306, 0, "您有%d件物品需要接受!")

sysMsg:set(307, 0, "购买成功")
sysMsg:set(308, 0, "您成功购买了%s")
sysMsg:set(309, 0, "寄售失败")
sysMsg:set(310, 0, "您撤销了寄售物品%s")
sysMsg:set(311, 0, "您的寄售时间已到，请收回物品")
sysMsg:set(312, 0, "寄售成功")
sysMsg:set(313, 0, "")
sysMsg:set(314, 0, "恭喜，您成功将%s出售给%s，所得%u仙石已入账，无需邮件接取。")

-- 斗剑场（315-332 339 - 342）
sysMsg:set(315, 0, "经验")
sysMsg:set(316, 0, "银币")
sysMsg:set(317, 0, "礼券")
sysMsg:set(339, 0, "")
sysMsg:set(356, 0, "荣誉")

sysMsg:set(340, 0, "绿色%s宝箱")
sysMsg:set(341, 0, "蓝色%s宝箱")
sysMsg:set(342, 0, "紫色%s宝箱")
sysMsg:set(357, 0, "橙色%s宝箱")
sysMsg:set(358, 0x17, "[p:%u:%s] 成为了今日的跨服斗剑场霸主，夺得【跨服第一】之名，获得了[4:%u]")

sysMsg:set(318, 0, "斗剑场邮件")
sysMsg:set(319, 0, "%s在斗剑场对您发起挑战，经过一番苦战，您不幸被打败。%s抢走了您的%s，抢走%u%s。")
sysMsg:set(320, 0, "恭喜您到了30级，现在可以进入斗剑场与其他玩家进行竞技了。点击最下方工具栏中的“斗剑”按钮进入竞技。斗剑场内的所有战斗都不会有任何损耗，并且还有经验、礼券、银币宝箱等丰厚奖励。")
sysMsg:set(321, 0, "恭喜您进阶到高级斗剑场，适应等级50级以上。您的排名在新的斗剑场中将被重新排序。")
sysMsg:set(325, 0, "恭喜您保住了斗剑场第%u名的名次，今天您获得奖励：[4:%u]x%u\n请在点击接受前确保背包留出足够的空间。\n斗剑场名次越高奖励越好，祝您玩得开心！")

sysMsg:set(326, 0, "%s")
sysMsg:set(327, 0, "")
sysMsg:set(328, 0, "")
sysMsg:set(329, 0, "")
sysMsg:set(330, 0x17, "[p:%u:%s] 成为了今日的斗剑场霸主，夺得【天下第一】之名,获得了[4:%u], 第 2 名至第 10 名分别获得相应奖励")
sysMsg:set(331, 0x27, "")
sysMsg:set(332, 0x27, "")
sysMsg:set(333, 0, "")
sysMsg:set(334, 0x17, "[p:%u:%s] 成为了今日的斗剑场霸主，夺得【天下第一】之名")

sysMsg:set(322, 0x27, "%s在斗剑场连胜%d场，势不可挡。")
sysMsg:set(323, 0x27, "%s挑战斗剑场第一名%s成功，顺利登顶全服榜首！")
sysMsg:set(324, 0x27, "%s成功地守护住了自己的第一名霸主地位！")

-- 奖励系统
sysMsg:set(335, 0x27, "")
sysMsg:set(336, 0x27, "")
sysMsg:set(337, 0x27, "")
sysMsg:set(338, 0x27, "")
sysMsg:set(343, 0, "")
sysMsg:set(344, 0x27, "")
sysMsg:set(345, 0x27, "")
sysMsg:set(346, 0, "")

sysMsg:set(347, 0x27, "[p:%u:%s]成功将[p:%u:%s]击败")

sysMsg:set(348, 0, "帮派邀请")
sysMsg:set(349, 0, "%s邀请您加入帮派%s")
sysMsg:set(350, 0, "帮派结盟")
sysMsg:set(351, 0, "%s的帮主%s恳请与您结盟，您是否允诺？结盟后您的帮派将多一个朋友，在双方帮派战开放期间可进入城内参与战斗。")
sysMsg:set(352, 0, "%s的帮主%s同意了您的请求。")
sysMsg:set(353, 0, "%s的帮主%s拒绝了您的请求。")
sysMsg:set(354, 0, "%s的帮主%s与您解除同盟关系。")
sysMsg:set(355, 0, "帮派解盟")

sysMsg:set(360, 0, "")
sysMsg:set(361, 0, "")
sysMsg:set(362, 0x27, "")
sysMsg:set(363, 0, "")
sysMsg:set(364, 0, "")
sysMsg:set(365, 0, "弹劾帮主通过")
sysMsg:set(366, 0, "%s弹劾帮主%s成功，成为%s帮新任帮主。")

sysMsg:set(370, 0x27, "")
sysMsg:set(371, 0x27, "")

sysMsg:set(375, 0x27, "")
sysMsg:set(376, 0x27, "")


sysMsg:set(10000, 0, " [p:%u:%s] ")
sysMsg:set(10001, 0, " [f:%u:%s] ")
sysMsg:set(10002, 0, " [4:%u]")
sysMsg:set(10003, 0, " [4:%u]x%u")

sysMsg:set(500, 1, "")
sysMsg:set(600, 1, "查询玩家: (%llu) %s  等级: %u")
sysMsg:set(601, 1, "所在地点: %s %s")
sysMsg:set(602, 1, "仙石: %u  礼券: %u")
sysMsg:set(603, 1, "银币: %u")
sysMsg:set(604, 1, "%u - [f:%u:%s]  等级: %u  潜力: %g")
sysMsg:set(609, 1, "国家: %u");
sysMsg:set(610, 1, "测试攻击 %s(%u) 第%u层，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(611, 1, "测试攻击 %s，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(611, 1, "测试 %s 攻击 %s，一共战斗 %u 场，胜利 %u 场，胜率 %g%%")
sysMsg:set(612, 1, "是否在线: %s")
sysMsg:set(613, 1, "免费副本次数: %u, 收费副本次数: %u")
sysMsg:set(614, 1, "免费阵图次数: %u, 收费阵图次数: %u")
sysMsg:set(620, 1, "当前在线人数: %u");
sysMsg:set(621, 1, "目标据点[0x%x]不可达");
sysMsg:set(622, 1, "所在线程: 0x%x");

sysMsg:set(623, 1, "玩家战力: %u")
sysMsg:set(624, 1, "散仙[%u|%s]: %u")
sysMsg:set(625, 1, "仙宠[%s]: %u")
sysMsg:set(626, 1, "仙宠[%s]:战力 %u\n生命:%u\n物理攻击:%u\n法术攻击:%u\n物理防御:%u\n法术防御:%u\n身法:%u\n灵压:%u\n暴击:%u\n暴击伤害:%u\n破击:%u\n法术抵抗:%u\n命中:%u\n躲避:%u\n反击:%u\n坚韧:%u\n")
sysMsg:set(627, 1, "散仙[%s]: 基础:%u,装备:%u,技能:%u,心法:%u,第二元神:%u,帮派:%u,仙宠:%u,宝具:%u,阵法:%u")
sysMsg:set(628, 1, "散仙[%s]:战力 %u\n物理攻击:%u\n法术攻击:%u\n物理防御:%u\n法术防御:%u\n生命:%u\n坚韧值:%u\n身法:%u\n命中值:%u\n躲避值:%u\n暴击值:%u\n破击值:%u\n反击值:%u\n法术抵抗值:%u\n入场灵气值:%u\n灵气上限:%u\n暴击率:%u\n坚韧率:%u\n命中率:%u\n躲避率:%u\n暴击伤害:%u\n破击率:%u\n反击率:%u\n法术抵抗率:%u\n")

sysMsg:set(400, 0, "来自 [p:%u:%s] 的结拜邀请")
sysMsg:set(401, 0, "亲爱的玩家，您的好友[p:%u:%s]正在申请与您结拜，成为结拜好友后，就可以与好友尽情对酒，提升豪饮，增强战斗力啦。")
sysMsg:set(402, 0, "结拜回复")
sysMsg:set(403, 0, "非常遗憾，您的好友[p:%u:%s]拒绝了你的结拜邀请。不要灰心，天下之大，何愁找不到知己？")
sysMsg:set(404, 0, "结拜成功")
sysMsg:set(405, 0, "邮件内容：恭喜这位剑侠，您已经成功与[p:%u:%s]结拜啦，不要忘了常与好友对对酒哦~")
sysMsg:set(406, 0, "散仙修炼");
sysMsg:set(407, 0, "您的散仙%s已完成修炼，花费%u仙石，获得了%u点经验。");
sysMsg:set(408, 0, "您的散仙%s已完成修炼，花费%u银币，获得了%u点经验。");
sysMsg:set(409, 0, "您的散仙%s已完成修炼，花费%u仙石，获得了%u点经验。返还仙石%u。");

sysMsg:set(410, 0, "您的散仙%s已完成修炼，花费%u银币，获得了%u点经验。返还银币%u。");
sysMsg:set(411, 0, "")
sysMsg:set(412, 0, "")
sysMsg:set(413, 0, "")
sysMsg:set(414, 0, "")
sysMsg:set(415, 0, "")
sysMsg:set(416, 0x35, "")

sysMsg:set(417, 0x16, "玫瑰精灵：传说中貌美如花，沉鱼落雁，倾国倾城的我玫瑰精灵还有%u分钟就来了哦！大家准备好迎接我了吗？嘻嘻！")
sysMsg:set(418, 0x16, "玫瑰精灵：呜呜呜！你们这群老是喜欢替我摸骨的坏人！人家不和你们玩了啦！我要回家告诉麻麻去！")
sysMsg:set(419, 0x16, "[p:%u:%s]找到玫瑰精灵后猥琐的偷偷摸了她一把，玫瑰精灵吓得丢出玫瑰精灵之心*%u后惊慌失措的逃走了！")
sysMsg:set(420, 0, "玫瑰榜排名奖励")
sysMsg:set(421, 0, "恭喜您在玫瑰精灵闹蜀山活动中排名第%u名，获得排名奖励，附件是您本次活动排名奖励内容，请注意查收，谢谢！")
sysMsg:set(422, 0x16, "[p:%u:%s]登上了玫瑰榜头名，看来他离玫瑰精灵称号不远啦！")
sysMsg:set(423, 0x16, "玫瑰精灵：我来啦！大家不许欺负我哦！快来找我吧，找到我的人有好东东赠送哦!")

sysMsg:set(424, 0x35, "")

sysMsg:set(425, 0x35, "")

sysMsg:set(426, 0x35, "")
sysMsg:set(427, 0x35, "")
sysMsg:set(428, 0x35, "")
sysMsg:set(429, 0x45, "")
sysMsg:set(430, 0x45, "%s捐献了%u银币")
sysMsg:set(431, 0x35, "")

sysMsg:set(440, 0, "")
sysMsg:set(441, 0, "")
sysMsg:set(442, 0, "")
sysMsg:set(443, 0, "")
sysMsg:set(444, 0, "")
sysMsg:set(445, 0, "")
sysMsg:set(446, 0x35, "")
sysMsg:set(447, 0, "")
sysMsg:set(448, 0x25, "")
sysMsg:set(449, 0x25, "")
sysMsg:set(450, 0x25, "")
sysMsg:set(451, 0x25, "")
sysMsg:set(452, 0, "")
sysMsg:set(453, 0, "")
sysMsg:set(454, 0, "")
sysMsg:set(455, 0, "")
sysMsg:set(456, 0x26, "")
sysMsg:set(457, 0x26, "")
sysMsg:set(458, 0x25, "")
sysMsg:set(459, 0x25, "")

sysMsg:set(460, 0x45, "%s加入了帮派");
sysMsg:set(461, 0x45, "%s离开了帮派");
sysMsg:set(462, 0x45, "与%s结盟了");
sysMsg:set(463, 0x45, "与%s解盟了");

sysMsg:set(464, 0, "")
sysMsg:set(465, 0, "")

sysMsg:set(479, 0, "")
sysMsg:set(480, 0, "")
sysMsg:set(481, 0, "")
sysMsg:set(482, 0, "")
sysMsg:set(483, 0, "")
sysMsg:set(484, 0, "")
sysMsg:set(485, 0, "")
sysMsg:set(486, 0, "")
sysMsg:set(487, 0, "")
sysMsg:set(488, 0, "")
sysMsg:set(489, 0, "")
sysMsg:set(490, 0, "")
sysMsg:set(491, 0, "")
sysMsg:set(492, 0, "")
sysMsg:set(493, 0, "")
sysMsg:set(494, 0, "")
sysMsg:set(495, 0, "")
sysMsg:set(496, 0, "")
sysMsg:set(497, 0, "")
sysMsg:set(498, 0, "")
sysMsg:set(499, 0, "")
sysMsg:set(500, 0, "")
sysMsg:set(501, 0, "")
sysMsg:set(502, 0, "")
sysMsg:set(503, 0, "")
sysMsg:set(504, 0, "")
sysMsg:set(505, 0, "")
sysMsg:set(506, 0, "")

sysMsg:set(510, 0x25, "")
sysMsg:set(511, 0x25, "")
sysMsg:set(512, 0x25, "")
sysMsg:set(513, 0x25, "")
sysMsg:set(514, 0x25, "")
sysMsg:set(515, 0x25, "")
sysMsg:set(516, 0x25, "")
sysMsg:set(517, 0x25, "")

sysMsg:set(518, 0x35, "")
sysMsg:set(519, 0x35, "")

sysMsg:set(520, 0, "")
sysMsg:set(521, 0, "")
sysMsg:set(522, 0, "")
sysMsg:set(523, 0, "")
sysMsg:set(524, 0, "")
sysMsg:set(525, 0, "")
sysMsg:set(526, 0, "")

sysMsg:set(527, 0x26, "")
sysMsg:set(528, 0x26, "")
sysMsg:set(529, 0x26, "")
sysMsg:set(530, 0, "")

sysMsg:set(531, 0, "帮派新成员加入")
sysMsg:set(532, 0, "玩家[%s]成功加入帮派, 请在帮派成员列表中查看。 \n祝您游戏愉快！")

sysMsg:set(540, 0, "")
sysMsg:set(541, 0, "")

sysMsg:set(545, 0, "")
sysMsg:set(546, 0, "")
sysMsg:set(547, 0x66, "%u分钟后世界BOSS即将出现在某个神秘的地方")
sysMsg:set(548, 0x16, "玩家[p:%u:%s]已经将世界BOSS[1:%u]的血量消耗至 %u%%");
sysMsg:set(549, 0x66, "世界BOSS已经神秘地出现在[2:%u]，大家快快行动起来，把这万恶之源揪出来，杀死它，会有惊喜哦！！！")
sysMsg:set(550, 0x27, "世界BOSS[1:%u]说: 我很后悔啊，做BOSS为什么要那么高调呢？不过你们也别太得意，我会再回来的。。。");
sysMsg:set(551, 0x35, "世界BOSS已经消失");
sysMsg:set(552, 0x16, "玩家[p:%u:%s]在[2:%u]打败世界BOSS第%u个元神 [1:%u]");
sysMsg:set(553, 0x27, "世界BOSS[1:%u]说: 你们以为这么简单就可以杀死我吗？我的真身被尘封了几百年，终于得见天日，我会把你们都撕成碎片，哈哈哈！！！");
sysMsg:set(554, 0x16, "世界BOSS[1:%u]横空出世，在[2:%u]掀起腥风血雨，大家快快行动起来，把[1:%u]消灭，会有惊喜哦！！！")
sysMsg:set(557, 0x16, "世界BOSS奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u, [4:%u]x%u");
sysMsg:set(555, 0, "自动副本掉落物品")
sysMsg:set(556, 0, "在自动副本时掉落的物品无法放入包裹，以邮件的形式发送给玩家，请查收!")
sysMsg:set(558, 0x27, "世界BOSS奖励，第4名~第10名获得了: [4:%u]x%u, [4:%u]x%u");
sysMsg:set(571, 0x27, "世界BOSS奖励，第11名~第20名获得了: [4:%u]x%u, [4:%u]x%u");
sysMsg:set(559, 0x27, "世界BOSS击杀奖励，[p:%u:%s]获得了: [4:%u]x%u, %u银币");
sysMsg:set(560, 0x27, "世界BOSS幸运奖励，[p:%u:%s]获得了: [4:%u]x%u");
sysMsg:set(561, 0x27, "世界BOSS幸运奖励，[p:%u:%s]获得了: [4:%u]");
sysMsg:set(562, 0, "世界BOSS幸运奖励");
sysMsg:set(563, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得幸运奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(564, 0, "世界BOSS伤害排名奖励");
sysMsg:set(565, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得伤害排名奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(566, 0, "世界BOSS击杀奖励");
sysMsg:set(567, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得击杀奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(568, 0, "世界BOSS击退奖励");
sysMsg:set(569, 0, "感谢您参加今日的世界boss活动，经过您的奋勇战斗，世界boss被击退，您获得击退奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(570, 0x16, "世界BOSS[1:%u]说: 哈哈！你们太无能了！！！平平安安，又到整点！！！不陪你们玩了，我妈喊我回家吃饭了！！！");
sysMsg:set(578, 0, "世界BOSS伤害奖励");
sysMsg:set(579, 0, "恭喜您在本次世界Boss的击退过程中对Boss造成了%u（%u.%u%%）的伤害，为了感谢您在此次世界Boss战中的英勇表现，您将获得Boss珍藏的神秘宝箱2个。请点击“接受物品”按钮领取奖励。");
sysMsg:set(580, 0x27, "您对Boss造成的伤害超过1%，获得神秘宝箱2个。");

sysMsg:set(572, 0x16, "剑仙：嘿嘿，我躲好了！我不会告诉你们我藏在哪儿，但是我可以告诉你们我藏身地点名字的一个字[12:%u]。最快找到我的前10个玩家我会给双份奖励哦！");
sysMsg:set(573, 0x16, "剑仙:不行！这里不安全了，我要换个地方重新躲起来！我不会告诉你们我躲在哪儿的！老规矩，提示你们我藏身地点的一个字[12:%u]。前10个找到我的双倍奖励咯！");
sysMsg:set(574, 0x16, " [p:%u:%s] 第%u个找到了剑仙，赢得了双份奖励！");
sysMsg:set(575, 0x16, "捉迷藏活动即将开始。各位剑侠们做好准备哦，前10个找到剑仙的剑侠将会获得双份奖励。");
sysMsg:set(576, 0x16, "[p:%u:%s] 向新人献上%d朵百合花。");
--sysMsg:set(577, 0x16, "恭喜[p:%u:%s] 侠士在%s门后找到新人，全服热闹值增加500！");
sysMsg:set(577, 0x16, "新人被发现啦！！ 就躲在 %s 门后，恭喜[p:%u:%s] 找到了新人，全服热闹值增加500！");

sysMsg:set(700, 0x16, "")
sysMsg:set(701, 0x15, "")
sysMsg:set(702, 0x15, "")
sysMsg:set(703, 0x15, "")
sysMsg:set(704, 0x15, "")
sysMsg:set(705, 0x15, "")

sysMsg:set(709, 0, "")
sysMsg:set(710, 0, "天榜")
sysMsg:set(711, 0, "地榜")
sysMsg:set(712, 0, "仙界第一%s赛成功晋级%s")
sysMsg:set(713, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，获得了%d点龙魂，并成功晋级%s！（龙魂自动发放无需领取）")
sysMsg:set(714, 0, "仙界第一%s赛不幸淘汰")
sysMsg:set(715, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，获得了%d点龙魂，不幸被淘汰。（龙魂自动发放无需领取）")

sysMsg:set(716, 0, "仙界至尊%s赛成功晋级%s")
sysMsg:set(717, 0, "感谢您的战队【%s】参加第%d届仙界至尊斗剑大会，您的战队在本届的%s赛中取得%d胜%d负的成绩，获得了%d点龙魂，并成功晋级%s！（龙魂自动发放无需领取）")
sysMsg:set(718, 0, "仙界至尊%s赛不幸淘汰")
sysMsg:set(719, 0, "感谢您的战队【%s】参加第%d届仙界至尊斗剑大会，您的战队在本届的%s赛中取得%d胜%d负的成绩，获得了%d点龙魂，不幸被淘汰。（龙魂自动发放无需领取）")
sysMsg:set(720, 0, "仙界第一%s赛%s成功晋级")
sysMsg:set(721, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，并成功晋级！")
sysMsg:set(722, 0, "仙界第一%s赛%s不幸淘汰")
sysMsg:set(723, 0, "感谢您参加第%d届仙界第一斗剑大会，您在本届的%s赛中取得%d胜%d负的成绩，不幸被淘汰，您排名奖励将会在周日仙界第一斗剑大会结束时发放！")
sysMsg:set(724, 0, "仙界第一%s排名奖励")
sysMsg:set(725, 0, "感谢您参加第%d届仙界第一斗剑大会，根据您在本届比赛中排名，获得了%d点龙魂，及宝箱奖励，请点击“接受物品”按钮领取宝箱。（龙魂自动发放无需领取）")
sysMsg:set(726, 0, "")
sysMsg:set(727, 0, "")
sysMsg:set(728, 0, "")
sysMsg:set(729, 0, "")

sysMsg:set(730, 0, "仙界第一%s赛 %s 晋级")
sysMsg:set(731, 0, "感谢您关注第%d届仙界第一斗剑大会，您在本届的%s赛中支持的选手 %s 成功晋级，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(732, 0, "仙界第一%s赛 %s 未能晋级")
sysMsg:set(733, 0, "感谢您关注第%d届仙界第一斗剑大会，您在本届的%s赛中支持的选手 %s 未能晋级！")
sysMsg:set(734, 0, "")

sysMsg:set(735, 0, "当前世界BOSS血量：%u")

sysMsg:set(736, 0, "场外活动奖励")
sysMsg:set(737, 0, "由于您支持的选手获得%u名，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(738, 0, "由于您最后一击补刀，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(739, 0, "活动人气奖励")
sysMsg:set(740, 0, "恭喜您在仙界第一斗剑大会比赛中，人气爆满，获得一份惊喜奖励！")
sysMsg:set(741, 0, "请您将辉煌秘典传于我")

sysMsg:set(780, 0, "全球")
sysMsg:set(781, 0, "入围")
sysMsg:set(782, 0, "32强")
sysMsg:set(783, 0, "16强")
sysMsg:set(784, 0, "8强")
sysMsg:set(785, 0, "4强")
sysMsg:set(786, 0, "半决")
sysMsg:set(787, 0, "决")

sysMsg:set(788, 0x35, "鼓舞失败！")
sysMsg:set(789, 0x35, "鼓舞成功！")
sysMsg:set(790, 0, "仙界至尊%s赛 %s 成功晋级")
sysMsg:set(791, 0, "感谢您的战队【%s】参加第%d届仙界至尊斗剑大会，您的战队在本届的%s赛中取得%d胜%d负的成绩，并成功晋级！")
sysMsg:set(792, 0, "仙界至尊%s赛 %s 不幸淘汰")
sysMsg:set(793, 0, "感谢您的战队【%s】参加第%d届仙界至尊斗剑大会，您的战队在本届的%s赛中取得%d胜%d负的成绩，不幸被淘汰！")
sysMsg:set(794, 0, "仙界至尊%s排名奖励")
sysMsg:set(795, 0, "感谢您的战队【%s】参加第%d届仙界至尊斗剑大会，根据您的战队在本届比赛中排名，获得了%d点龙魂，及宝箱奖励，请点击“接受物品”按钮领取宝箱。（龙魂自动发放无需领取）")
sysMsg:set(796, 0, "仙界至尊%s赛 %s 晋级")
sysMsg:set(797, 0, "感谢您关注第%d届仙界至尊斗剑大会，您在本届的%s赛中支持的至尊 %s 成功晋级，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(798, 0, "仙界至尊%s赛 %s 未能晋级")
sysMsg:set(799, 0, "感谢您关注第%d届仙界至尊斗剑大会，您在本届的%s赛中支持的至尊 %s 未能晋级！")

sysMsg:set(910, 0, "亲爱的玩家，您在月老祠购买的定情信物消耗%u仙石，现在仙石已经退回您的账户中，请及时查看。")
sysMsg:set(911, 0, "亲爱的玩家，您预约的婚礼，消耗%u仙石，现在仙石已经退回您的账户中，请及时查看。")
sysMsg:set(912, 0, "亲爱的玩家，您预约的婚礼，消耗%u仙石，因为您主动取消婚礼，现在返还80%的仙石，仙石已经退回您的账户中，请及时查看。")
sysMsg:set(913, 0, "亲爱的玩家，您双方离婚中，消耗仙石250，现在仙石已经退回您的账户中，请及时查看。")
sysMsg:set(914, 0, "亲爱的玩家，您发起的征婚，消耗50仙石， 现在仙石已经退回您的账户中，请及时查看。")
sysMsg:set(915, 0, "亲爱的玩家，您已经成功离婚，\n今后天南海北，一人独闯。 您的夫妻宠物如今保留了[f:FF6666:%u的成长值与%u的品质值]（夫妻亲密度）跟随着您，如果下次您再遇到了有缘人，再次开启夫妻家园的时候，您的宠物成长值与品质值将会保留下来。")
sysMsg:set(916, 0, "%s")
sysMsg:set(917, 0, "亲爱的玩家，非常抱歉因为服务器的超时，影响到了您的婚礼。由于错过了婚礼时间，我们取消了你的婚礼，并按照取消婚礼给您返还了仙石，请及时查收邮件。现在您可以重新预约婚礼了。希望您在蜀山度过一段愉快的时光。")
sysMsg:set(918, 0, "亲爱的玩家，非常抱歉因为服务器的超时，影响到了您的婚礼。由于错过了婚礼时间，我们取消了你的婚礼，并按照取消婚礼给您返还了仙石，请及时查收邮件。现在您可以重新预约婚礼了。希望您在蜀山度过一段愉快的时光。")
sysMsg:set(918, 1, "获得一条好吃的白鱼，增加宠物成长值1")
sysMsg:set(921, 0x35, "获得一条好吃的白鱼，增加宠物成长值1")
sysMsg:set(919, 1, "获得一条美味的七星鱼，增加宠物成长值2")
sysMsg:set(922, 0x35, "获得一条美味的七星鱼，增加宠物成长值2")
sysMsg:set(920, 1, "获得一条珍馐的金锦鱼，增加宠物成长值3")
sysMsg:set(923, 0x35, "获得一条珍馐的金锦鱼，增加宠物成长值3")
sysMsg:set(925, 1, "获得一个记忆碎片，增加宠物副本一次")
sysMsg:set(924, 0x35, "获得一个记忆碎片，增加宠物副本一次")
sysMsg:set(926, 1, "恭喜你成功通关夫妻重复副本，增加宠物成长值5,夫妻亲密度5")
sysMsg:set(927, 0x35, "恭喜你成功通关夫妻重复副本，增加宠物成长值5,夫妻亲密度5")
sysMsg:set(928, 0x35, "邀请成功")
sysMsg:set(929, 1, "恭喜剑侠获得一个千年古迹，增加宠物成长值7")
sysMsg:set(930, 0x35, "恭喜剑侠获得一个千年古迹，增加宠物成长值7")
sysMsg:set(931, 1, "恭喜剑侠获得一个万年古迹，增加宠物成长值10")
sysMsg:set(932, 0x35, "恭喜剑侠获得一个万年古迹，增加宠物成长值10")

--天元神兽活动
sysMsg:set(940, 0x45, "%s神情亢奋，激动的向%s竖起大拇指，感谢他为帮派做出的贡献")
sysMsg:set(941, 0x45, "%s脸若寒霜，怒视眼前的%s，大声嚷嚷着督促他赶紧去干活为帮派做贡献")
sysMsg:set(942, 0x45, "天元神兽需要加入帮派,请快加入帮派吧")
sysMsg:set(943, 0x45, "不在天元神兽活动期间内")
sysMsg:set(944, 0x45, "额外充值奖励")
sysMsg:set(945, 0x45, "附件是天元神兽活动期间给与您的额外奖励,请注意查收.")
sysMsg:set(946, 0x45, "天元神兽个人排行奖励")
sysMsg:set(947, 0x45, "天元神兽帮派排行奖励")
sysMsg:set(948, 0x45, "天元神兽贡献奖励 ")
sysMsg:set(949, 0x45, "亲爱的剑侠，您所在的帮派在天元神兽活动神兽阶数达到%s期，附件是发送给您的神兽贡献奖励，请注意核对查收。感谢您的支持，祝您游戏愉快！")
sysMsg:set(950, 0x45, "恭喜您所在的帮派在天元兽神的活动中排名第%u名，对应的帮派奖励奖励将直接发放，无需邮件接收，请注意查看。")
sysMsg:set(951, 0x45, "恭喜您在天元神兽活动中个人积分榜上排名第%u名，附件是发放给您的排名奖励，请注意查收！谢谢。")
sysMsg:set(952, 0x27, "%s帮派在帮主%s的带领下将帮派神兽培养至%s，其所在帮派成员将会在活动结束后获得神兽赐福阶数奖励，并将拥有限购资格。")
sysMsg:set(953, 0x16, "[p:%u:%s]受天地造化气运所钟，获得稀有橙色卡牌[f:%u:%s]，大家一起来膜拜他吧！")
sysMsg:set(954, 0x16, "[p:%u:%s]经过不懈努力把卡牌[f:%u:%s]升到80级，大家一起来膜拜他吧！")

--拜火祭天活动
sysMsg:set(955, 0x45, "拜火祭天奖励")
sysMsg:set(956, 0x45, "火神祝融对%s的虔诚非常满意，收到帮派篝火宝箱1个.")
sysMsg:set(957, 0x45, "你受到了火神祝融的祝福，收到帮派篝火宝箱%u个.")
sysMsg:set(958, 0x46, "火神祝融对%s帮派祭起的篝火不屑一顾,本次将只对添加3次柴火的帮众发放贡献奖励。已通过邮件发放，注意查收！")
sysMsg:set(959, 0x46, "火神祝融对%s帮派祭起的篝火差强人意,帮派所有成员获得帮派篝火宝箱1个。已通过邮件发放，注意查收！")
sysMsg:set(960, 0x46, "火神祝融对%s帮派祭起的篝火比较满意,帮派所有成员获得帮派篝火宝箱2个。已通过邮件发放，注意查收！")
sysMsg:set(961, 0x46, "火神祝融对%s帮派祭起的篝火非常满意,帮派所有成员获得帮派篝火宝箱3个。已通过邮件发放，注意查收！")
sysMsg:set(962, 0x46, "火神祝融对%s帮派祭起的篝火欣喜若狂,帮派所有成员获得帮派篝火宝箱4个。已通过邮件发放，注意查收！")

--帮派Boss活动
sysMsg:set(963, 0x45, "%s帮帮派BOSS还剩10分钟即将开启，请大家做好准备！")
sysMsg:set(964, 0x45, "%s帮帮派BOSS还剩5分钟即将开启，请大家做好准备！")
sysMsg:set(965, 0x45, "%s帮帮派BOSS已经出现，请%s帮各位成员赶快击杀。")
sysMsg:set(966, 0x45, "玩家[p:%u:%s]已经将帮派BOSS[1:%u]的血量消耗至 %u%%");
sysMsg:set(967, 0, "帮派BOSS幸运奖励");
sysMsg:set(968, 0, "感谢您参加今日的帮派boss活动，经过您的奋勇战斗，您获得幸运奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(969, 0, "帮派BOSS伤害排名奖励");
sysMsg:set(970, 0, "感谢您参加今日的帮派boss活动，经过您的奋勇战斗，帮派boss被击退，您获得伤害排名奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(971, 0, "帮派BOSS击杀奖励");
sysMsg:set(972, 0, "感谢您参加今日的帮派boss活动，经过您的奋勇战斗，帮派boss被击退，您获得击杀奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(973, 0, "帮派BOSS击退奖励");
sysMsg:set(974, 0, "感谢您参加今日的帮派boss活动，经过您的奋勇战斗，帮派boss被击退，您获得击退奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(975, 0, "帮派BOSS秘密奖励");
sysMsg:set(976, 0, "感谢您参加今日的帮派boss活动，经过您的奋勇战斗，帮派boss元神被击退，您获得秘密奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(977, 0x45, "%s在击杀帮派BOSS的战斗中福至心灵，获得帮派BOSS幸运礼包X1. 已通过邮件发放,注意查收！");
sysMsg:set(978, 0x45, "在本次击杀帮派BOSS伤害贡献中，%s获得帮派BOSS伤害第%u礼包,已通过邮件发放,注意查收！");
sysMsg:set(979, 0x45, "%s完成对帮派BOSS的最后一击，获得击杀礼包，已通过邮件发放,注意查收！");
sysMsg:set(980, 0, "帮派BOSS异常补偿");
sysMsg:set(981, 0, "感谢您参加今日的帮派boss活动，由于服务器异常，您获得补偿奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(982, 0x45, "帮派BOSS[1:%u]说: 我很后悔啊，做BOSS为什么要那么高调呢？不过你们也别太得意，我会再回来的。。。");
sysMsg:set(983, 0x45, "%s帮%s预约%u点开启帮派BOSS，请各位帮众留意时间，及时击杀获取丰厚奖励！");

--帮派副本
sysMsg:set(800, 0, "帮派副本通关奖励");
sysMsg:set(801, 0, "帮派副本通关奖励。");
sysMsg:set(805, 0x16, "%s 成为了全服第一个夺得谪仙深渊第%u层的帮派。");
sysMsg:set(806, 0x45, "%s 开启了帮派副本，大家赶紧传送前往吧。");
sysMsg:set(807, 0x45, "%s 关闭了帮派副本。");
--帮派副本End
--仙界传奇(跨服服战)
sysMsg:set(808, 0, "仙界传奇斗剑大会成员选拔赛")
sysMsg:set(809, 0, "感谢您参与第%u届仙界传奇斗剑大会，您在本服务器中脱颖而出，成为代表服务器出战的10名成员之一，为了服务器荣誉而战吧！")
sysMsg:set(810, 0, "仙界传奇%s %s赛成功晋级")
sysMsg:set(811, 0, "感谢您参加第%u届仙界传奇斗剑大会，您的%u服务器队伍在本届的%s赛中取得%u胜%u负的成绩，获得了%u点龙魂，并成功晋级%s！（龙魂自动发放无需领取）")
sysMsg:set(812, 0, "感谢您关注第%u届仙界传奇斗剑大会，您的%u服务器队伍在本届的%s赛中取得%u胜%u负的成绩，并成功晋级%s，由于你参与了祭剑行为，获得了%u点龙魂的奖励！（龙魂自动发放无需领取）")
sysMsg:set(813, 0, "仙界传奇%s %s赛不幸淘汰")
sysMsg:set(814, 0, "感谢您参加第%u届仙界传奇斗剑大会，您的%u服务器队伍在本届的%s赛中取得%u胜%u负的成绩，获得了%u点龙魂，不幸被淘汰。（龙魂自动发放无需领取）")
sysMsg:set(815, 0, "感谢您参加第%u届仙界传奇斗剑大会，您的%u服务器队伍在本届的%s赛中取得%u胜%u负的成绩，不幸被淘汰，由于你参与了祭剑行为，获得了%u点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(816, 0, "感谢您参加第%u届仙界传奇斗剑大会，您的%u服务器队伍在本届的%s赛中取得%d胜%d负的成绩，并成功晋级！")
sysMsg:set(817, 0, "感谢您参加第%u届仙界传奇斗剑大会，您的%u服务器队伍在本届的%s赛中取得%d胜%d负的成绩，不幸被淘汰，您的服务器排名奖励将会在周日仙界传奇斗剑大会结束时发放！")
sysMsg:set(818, 0, "仙界传奇%s排名奖励")
sysMsg:set(819, 0, "感谢您参加第%d届仙界传奇斗剑大会，根据您的%u服务器队伍在本届比赛中排名，获得了%d点龙魂，及宝箱奖励，请点击“接受物品”按钮领取宝箱。（龙魂自动发放无需领取）")
sysMsg:set(820, 0, "感谢您关注第%u届仙界传奇斗剑大会，由于您参与了祭剑行为，根据您的%u服务器队伍在本届比赛中排名，获得了%u点龙魂奖励（龙魂自动发放无需领取）")
sysMsg:set(821, 0, "仙界传奇%s赛%u服务器晋级")
sysMsg:set(822, 0, "感谢您关注第%d届仙界传奇斗剑大会，您在本届的%s赛中支持的%s%u服务器队伍成功晋级，您获得了%d点龙魂。（龙魂自动发放无需领取）")
sysMsg:set(823, 0, "仙界传奇%s赛%u服务器未能晋级")
sysMsg:set(824, 0, "感谢您关注第%d届仙界传奇斗剑大会，您在本届的%s赛中支持的%s%u服务器队伍未能晋级！")
sysMsg:set(825, 0, "仙界传奇斗剑大会成员选拔赛")
sysMsg:set(826, 0, "感谢您参加第%u届仙界传奇斗剑大会，您在本服务器中脱颖而出，成为代表服务器出战的10名成员之一，为了服务器荣誉而战吧！")

sysMsg:set(827, 0, "跨服充值排名")
sysMsg:set(828, 0, "    亲爱的[p:%u:%s]，您在跨服充值排行活动中共充值仙石：%u，排名第%u名。\n前三名充值的玩家以及充值数量分别为：\n%s    感谢您对蜀山传奇的支持，希望您能在蜀山传奇中度过一段愉快的时光。")
sysMsg:set(829, 0, "跨服充值排名奖励")
sysMsg:set(830, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，本次活动您共充值仙石：%u仙石，附件是发送给您的排名奖励，请注意查收。感谢您对蜀山的支持，祝您游戏愉快！")
sysMsg:set(831, 0, "跨服充值刻度返利")
sysMsg:set(832, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中充值额度达到%u仙石，附件是您的充值刻度奖励，还请注意核对查收，谢谢！")
sysMsg:set(833, 0, "跨服充值排名第一奖励")
sysMsg:set(834, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中获得了排名第一，您将获得拥有私人定制法宝的机会。请您在收到系统邮件后，准备好您的个人游戏ID、大区、QQ号码等信息联系我们的官方企业QQ：800006119。联系到我们的客服后会有相应的安排让您和我们的技术人员直接联系，方便您提出您的造型需求。感谢您的支持，祝您游戏愉快！")
sysMsg:set(835, 0 , "第%u名：[p:%u:%s]：%u\n");
sysMsg:set(836, 0, "跨服充值排名第二奖励")
sysMsg:set(837, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中获得了排名第二，您将获得拥有私人定制称号卡的机会。请您在收到系统邮件后，准备好您的个人游戏ID、大区、QQ号码等信息联系我们的官方企业QQ：800006119。联系到我们的客服后会有相应的安排让您和我们的技术人员直接联系，方便您提出您的造型需求。感谢您的支持，祝您游戏愉快！")
sysMsg:set(838, 0, "跨服充值排名实物奖励")
sysMsg:set(839, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，获得我们的实物奖励—订制变身法宝+总充值量10%仙石+水晶相框+鼠标垫+马克杯+U盘，请在工作日期间联系QQ：800006119提供您的邮寄地址以便我们为您发放实物奖励及返利仙石。谢谢！")
sysMsg:set(840, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，获得我们的实物奖励—称号卡+总充值量8%仙石+水晶相框+鼠标垫+马克杯+U盘，请在工作日期间联系QQ：800006119提供您的邮寄地址以便我们为您发放实物奖励及返利仙石。谢谢！")
sysMsg:set(841, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，获得我们的实物奖励—总充值量5%仙石+水晶相框+鼠标垫+马克杯+U盘，请在工作日期间联系QQ：800006119提供您的邮寄地址以便我们为您发放实物奖励及返利仙石。谢谢！")
sysMsg:set(842, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，获得我们的实物奖励—水晶相框+鼠标垫+马克杯+U盘，请在工作日期间联系QQ：800006119提供您的邮寄地址以便我们为您发放实物奖励。谢谢！")
sysMsg:set(843, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，获得我们的实物奖励—水晶相框+鼠标垫+ U盘，请在工作日期间联系QQ：800006119提供您的邮寄地址以便我们为您发放实物奖励。谢谢！")
sysMsg:set(844, 0, "亲爱的[p:%u:%s]，恭喜您在跨服充值排行活动中排名第%u名，获得我们的实物奖励—水晶相框，请在工作日期间联系QQ：800006119提供您的邮寄地址以便我们为您发放实物奖励。谢谢！")

sysMsg:set(870, 1, "活动%u积分！")
sysMsg:set(871, 0, "天榜")
sysMsg:set(872, 0, "地榜")
sysMsg:set(873, 0, "金榜")
sysMsg:set(874, 0, "银榜")
sysMsg:set(875, 0, "星榜")
sysMsg:set(876, 0, "月榜")
sysMsg:set(878, 0, "胜")
sysMsg:set(879, 0, "负")

sysMsg:set(880, 0, "%s邮件提示")
sysMsg:set(881, 0, "单职业竞技")
sysMsg:set(882, 0, "策略风暴竞技")
sysMsg:set(883, 0, "全明星竞技")
sysMsg:set(884, 0, "逆转乾坤")
sysMsg:set(885, 0, "人气达人")

sysMsg:set(886, 0, "在刚刚结束的%s筛选赛中, 您经过不断的努力成功进入%s，获得了参加%s淘汰赛资格。")
sysMsg:set(887, 0, "在刚刚结束的%s筛选赛中, 您不幸落败，请继续努力，希望能在下一届活动中取得更好的名次。")
sysMsg:set(888, 0, "简报：%s")
sysMsg:set(889, 0, "%s VS %s %s")
sysMsg:set(890, 0, "在刚刚结束的%s决赛中，您经过艰难的战斗最终成功获得了%s活动的第%d名，希望再接再厉能够在接下来的活动中取得更好的名次。")

sysMsg:set(891, 0, "单职业活动奖励")
sysMsg:set(892, 0, "在本次活动中，您获得积分排名第%d名的奖励")
sysMsg:set(893, 0, "队伍%d VS 队伍%d %s")
sysMsg:set(894, 0, "在本次活动中，您获得积分排名第%d名的奖励以及 7天限时称号“儒尊”")
sysMsg:set(895, 0, "在本次活动中，您获得积分排名第%d名的奖励以及 7天限时称号“释尊”")
sysMsg:set(896, 0, "在本次活动中，您获得积分排名第%d名的奖励以及 7天限时称号“道尊”")

sysMsg:set(1071, 1, "不能放入九疑鼎")
sysMsg:set(1072, 1, "不能出售物品")

sysMsg:set(2000, 0, "修炼洞府被抢占")
sysMsg:set(2001, 0, "剑仙 %s 见您的修炼洞府灵气浓郁,便蛮横地占为己有,您无奈之下去了无主之地")
sysMsg:set(2002, 0, "火种制作成功")
sysMsg:set(2003, 0, "火种制作失败，没有相关物品")

sysMsg:set(2004, 0x35, "[f:%u:%s]获得修为值%u")
sysMsg:set(2005, 1, "[f:%u:%s]获得修为值%u")
sysMsg:set(2006, 0x35, "[f:%u:%s]消耗修为值%u")
sysMsg:set(2007, 1, "[f:%u:%s]消耗修为值%u")
sysMsg:set(2008, 0x35, "修为不够，可以通过修炼来得到修为值")

sysMsg:set(2010, 0, "散仙增益心法散功返还")
sysMsg:set(2011, 0, "%u级的散仙[f:%u:%s]将%d阶心法[%s-%d级]散功之后，将您修炼此心法的心法书和所消耗总修为的60%转为一些修为丹赠送给您。请点击接受获取修为丹")
sysMsg:set(2012, 0, "散仙技能心法散功返还")
sysMsg:set(2013, 0, "%u级的散仙[f:%u:%s]将%d阶心法[%s-%d级]散功之后，将修炼此心法的心法书和所消耗总修为、技能符文熔炼值和玄天瑞露值的60%转为一些修为丹和熔炼诀和玄天瑞露赠送给您。请点击接受获取心法书、修为丹、熔炼诀和玄天瑞露")
sysMsg:set(2014, 0, "技能符文散功返还")
sysMsg:set(2015, 0, "%u级的散仙[f:%u:%s]将[%s]的技能符文散功之后，所消耗技能符文熔炼值的60%转为一些熔炼诀赠送给您。请点击接受获取熔炼诀")

sysMsg:set(2016, 0, "散仙星辰返还")
sysMsg:set(2017, 0, "%u级的散仙[f:%u:%s]离开之后，将自己镶嵌在星阵上的宝石和60%的星辰转为星辰旗赠送给您，请点击接受获取!")
sysMsg:set(2018, 0x35, "[f:%u:%s]消耗真元值%u")
sysMsg:set(2019, 1, "[f:%u:%s]消耗真元值%u")
sysMsg:set(2020, 1, "获得真元值%u")
sysMsg:set(2021, 0x35, "获得真元值%u")
sysMsg:set(2022, 1, "获得欢乐值%u")
sysMsg:set(2023, 0x35, "获得欢乐值%u")
sysMsg:set(2024, 1, "获得江湖值%u")
sysMsg:set(2025, 0x35, "获得江湖值%u")
sysMsg:set(2026, 0x35, "帮助许愿成功！")
sysMsg:set(2027, 1, "获得剑心值%u")
sysMsg:set(2028, 0x35, "获得剑心值%u")
sysMsg:set(2029, 0, "散仙剑心返还")
sysMsg:set(2030, 0, "%u级的散仙[f:%u:%s]离开之后，将自己60%的剑心值转为剑心石或剑心王玉赠送给您，请点击接受获取!")
sysMsg:set(2031, 0, "技能进阶散功返还")
sysMsg:set(2032, 0, "%u级的散仙[f:%u:%s]将[%s]的技能进阶散功之后，所消耗玄天瑞露值的60%转为一些凝露仙鼎或凝露玉盅或凝露宝瓶赠送给您。请点击接受获取")
sysMsg:set(2033, 0, "%u级的散仙[f:%u:%s]将[%s]的技能品阶散功之后，所消耗玄天瑞露值的60%过低，将不会进行返还。")
sysMsg:set(2034, 0x35, "获得欧冶精粹")
sysMsg:set(2035, 1, "获得欧冶精粹")

sysMsg:set(2100, 0, "阵法升级失败，该阵法不可升级")
sysMsg:set(2101, 0, "阵法升级失败，物品 [%s] 不足")
sysMsg:set(2102, 0x35, "保存阵型成功")
sysMsg:set(2103, 0x35, "不可重复学习同一个阵法")
sysMsg:set(2104, 0x35, "学会新阵法 %s")
sysMsg:set(2105, 0, "散仙修为返还提示")
sysMsg:set(2106, 0, "%u级的散仙[f:%u:%s]将%d阶心法[%s-%d级]散功之后，将您修炼此心法的心法书和所消耗总修为的60%转为一些修为丹赠送给您。请点击接受获取修为丹")
sysMsg:set(2107, 0x35, "今日可接师门任务已满")
sysMsg:set(2108, 0x35, "今日可接衙门任务已满")
sysMsg:set(2109, 0x35, "等级未到，当前等级: %u, 所需等级: %u")

sysMsg:set(2110, 0, "国庆充值送大礼奖励")
sysMsg:set(2111, 0, "恭喜您获得【国庆充值送大礼】活动奖励，感谢您对我们游戏的支持。")
sysMsg:set(2112, 0, "国庆在线大礼包奖励")
sysMsg:set(2113, 0, "恭喜您今日在线累计时间达到4小时，获得【国庆在线大礼包】活动奖励，感谢您对我们游戏的支持。")
sysMsg:set(2114, 0, "!!!亲送橙装咯!!!")
sysMsg:set(2115, 0, "VIP橙装大礼包")

sysMsg:set(2116, 0x66, "英雄岛活动已经结束了！")
sysMsg:set(2117, 0x66, "英雄岛即将在%u分钟后开始！")
sysMsg:set(2118, 0x66, "英雄岛活动已开始，欢迎大家参加！")
sysMsg:set(2119, 0x35, "获得神兽元神增益效果")

sysMsg:set(2120, 0, "新手成长礼包")
sysMsg:set(2121, 0, "恭喜您达到30级!\n  修炼之路才刚刚开始,蜀山团队特别赠送您一套镶嵌了宝石的30级主将紫装,助您斩妖除魔!请点击接受物品领取奖励！\n 30级开放功能：斗剑场、帮派科技、交易；\n 40级开放功能：阵营战、英雄岛（即将开放）")

sysMsg:set(2122, 0, "万圣节登陆送活动")
sysMsg:set(2123, 0, "恭喜您获得万圣节登陆送活动奖励50礼券，请点击接受物品领取奖励！\n 10/29--11/1\n 活动期间内，每日登陆可以领取一次登陆奖励50礼券；\n 活动期间内，连续三天登陆可以领取100礼券、南瓜型稀有装扮（头部）。\n 更多游戏内容请登录论坛查询：http://sobar.soso.com/b/3007483_1226")
sysMsg:set(2124, 0, "万圣节登陆送活动")
sysMsg:set(2125, 0, "恭喜您获得万圣节连续三天登陆送活动奖励100礼券、南瓜型稀有装扮（头部），请点击接受物品领取奖励！\n 10/29--11/1 \n 活动期间内，每日登陆可以领取一次登陆奖励50礼券；\n 活动期间内，连续三天登陆可以领取100礼券、南瓜型稀有装扮（头部）。\n 更多游戏内容请登录论坛查询：http://sobar.soso.com/b/3007483_1226")

sysMsg:set(2126, 0, "装备强8 宝石送")
sysMsg:set(2127, 0, "恭喜您获得补髓益元丹X5、凝神易筋丹X5奖励，请点击接受物品领取奖励！\n 10/29--11/1 \n 活动期间内，只要将任意一件装备强化到8级就可以获得补髓益元丹X5、凝神易筋丹X5的奖励。\n 注：\n 1.每强化一件装备到8获得一次奖励，强化N件装备达到8级，可以N次奖励。\n 2.同一件装备只能获得一次奖励，装备由8级降到7级，再次强化到8级将不能再次获得奖励。")

sysMsg:set(2130, 0x35, "获得盘古之力增益效果")
sysMsg:set(2131, 0x35, "获得玲珑宝塔增益效果")
sysMsg:set(2132, 0x35, "获得混元灵怒增益效果")
sysMsg:set(2133, 0x35, "获得五行禁阵增益效果")
sysMsg:set(2134, 0x35, "使用了妙手回春技能")

sysMsg:set(2140, 0x36, "[p:%u:%s]挑战你失败，被你打的狼狈而逃")
sysMsg:set(2141, 0x36, "[p:%u:%s]挑战了你，你不幸落败")

sysMsg:set(2143, 0x36, "你挑战了[p:%u:%s]，你不幸落败")
sysMsg:set(2144, 0x36, "你挑战了[p:%u:%s]成功，被你打的狼狈而逃")

sysMsg:set(2142, 0x27, "[p:%u:%s]获得称号[t:0:%u]")

sysMsg:set(2200, 0x27, "[p:%u:%s]将[f:%u:%s]潜力洗到1.5！")
sysMsg:set(2201, 0x27, "[p:%u:%s]将[f:%u:%s]资质洗到7！")
sysMsg:set(2203, 0x27, "[p:%u:%s]将[4:%u]的附加属性洗炼至橙色！")
sysMsg:set(2204, 0x27, "[p:%u:%s]在[8:%u]秘境中经历千难万险获得[4:%u]！")

sysMsg:set(2205, 0, "光棍法宝补偿")
sysMsg:set(2206, 0, "亲爱的玩家,由于光棍法宝出现的无视防御的BUG,我们对此深表歉意,特此依据强化等级做出相应补偿,感谢您对蜀山传奇的支持,祝您游戏愉快!  1级： 五行真金x1、凝神易经丹x5、补髓益元丹x5\n 2级： 五行真金x2、凝神易经丹x5、补髓益元丹x5\n 3级： 五行真金x3、凝神易经丹x5、补髓益元丹x5\n 4级： 五行真金x5、凝神易经丹x5、补髓益元丹x5\n 5级： 五行真金x10、凝神易经丹x5、补髓益元丹x5\n 6级： 五行精金x10、凝神易经丹x5、补髓益元丹x5\n 7级： 五行精金x20、凝神易经丹x5、补髓益元丹x5\n 8级： 五行精金x30、凝神易经丹x5、补髓益元丹x5")

sysMsg:set(2207, 0, "注册七日奖励")
sysMsg:set(2208, 0, "这是您的在注册七日登录第%u天补偿，请查收！")

sysMsg:set(2210, 0x66, "帮派战报名已经开启，据报名截止还有%u分钟，请点击帮派按钮进行参与。") 
sysMsg:set(2211, 0x16, "帮派战报名已经结束。帮派战报名时间为每天20点30分-20点40分。")
sysMsg:set(2212, 0x55, "您的下一个交战帮会为：%s，请尽快对出战阵容做出调整。")
sysMsg:set(2213, 0,    "帮派战每周奖励")
sysMsg:set(2214, 0,    "本周帮派战已经结束，您的帮派本周累计获得%u分，表现出色。个人宝箱奖励已经通过本邮件发送，注意查收。同时额外奖励给帮派的宝箱已经发放到帮派仓库。")
sysMsg:set(2215, 0x55, "今天帮会战，您所在帮会报名人数少于%u人，报名失败，无法参加帮会战。")
sysMsg:set(2216, 0x55, "您被帮会管理者调整至玉珠峰战役。")
sysMsg:set(2217, 0x55, "您被帮会管理者调整至光明顶战役。")
sysMsg:set(2218, 0x55, "您被帮会管理者调整至十王峰战役。")
sysMsg:set(2219, 0x55, "您被帮会管理者调整至万佛顶战役。")
sysMsg:set(2220, 0x55, "您被帮会管理者调整至祝融峰战役。")
sysMsg:set(2221, 0x55, "您被帮会管理者调整至玉虚顶战役。")
sysMsg:set(2222, 0x16, "今天帮会战已经结束。%s")
sysMsg:set(2223, 0,    "经过激烈的争夺，截止目前，帮会战本周排名前六名的帮派为：第一名：%s")
sysMsg:set(2224, 0,    "、第二名：%s")
sysMsg:set(2225, 0,    "、第三名：%s")
sysMsg:set(2226, 0,    "、第四名：%s")
sysMsg:set(2227, 0,    "、第五名：%s")
sysMsg:set(2228, 0,    "、第六名：%s")
sysMsg:set(2229, 0,    "。")
sysMsg:set(2230, 0x55, "对不起，报名失败，一场战役单方最多%u人参加，请尝试参加其他战役。")
sysMsg:set(2233, 0x55, "您的帮派本轮轮空，本轮直接获得%u分。")
sysMsg:set(2234, 0x55, "调整失败，一场战役单方最多%u人参加，请参加其他战役。")
sysMsg:set(2235, 0x55, "对不起，退出失败。帮派战期间，无法主动离开帮派。")
sysMsg:set(2236, 0,    "帮派战每日奖励")
sysMsg:set(2237, 0,    "今日帮派战已经结束，您的帮派今日获得%u分，表现出色，个人宝箱奖励已经通过本邮件发放，注意查收。")
sysMsg:set(2238, 0,    "帮派战排名奖励")
sysMsg:set(2239, 0,    "本周帮派战已经结束，您的帮派本周表现出色，在所有帮派中排名第%u，帮派得到的宝箱奖励已经发放到您所在的帮派仓库内。")
sysMsg:set(2240, 0,    "帮派仓库空间不足")
sysMsg:set(2241, 0,    "今天是帮派战最后一天，系统将会在今日帮派战结束后发放奖励至帮派仓库，为确保您能正常的接收奖励，请确保帮派仓库至少留出25个物品空间。")
sysMsg:set(2242, 0x35, "获得%u帮派贡献度")
sysMsg:set(2243, 0x36, "你已不在此副本所在据点")
sysMsg:set(2244, 0x36, "你已不在此阵图所在据点")

sysMsg:set(2310, 0, "英雄岛前三奖励")
sysMsg:set(2311, 0, "恭喜您称霸英雄岛，获得[英雄遗迹]x1")
sysMsg:set(2312, 0x27, "今日英雄岛结束")
sysMsg:set(2313, 0x27, "第%u名：[p:%u:%s]，获得%u声望和[英雄遗迹]x%u")
sysMsg:set(2314, 0x16, "英雄殿堂被一股奇特的漩涡包围，在那里的剑侠都被冲刷至英雄岛各地。。。")
sysMsg:set(2315, 0, "恭喜您称霸英雄岛，获得[英雄遗迹]x2")

sysMsg:set(2316, 0, "英雄岛前五名奖励")
sysMsg:set(2317, 0, "本日英雄岛活动已全部结束，您在活动中的总积分为%u，排名为%u，可获得奖励：英雄遗迹×%u，声望%u，礼券%u。")
sysMsg:set(2318, 0, "第%u轮英雄岛奖励")
sysMsg:set(2319, 0, "第%u轮英雄岛活动已经结束，您在活动中的积分为%u，可获得%u声望，根据您的身份排名，可获得额外奖励：英雄岛绿色宝箱x%u，英雄岛蓝色宝箱×%u，英雄岛紫色宝箱×%u。")
sysMsg:set(2326, 0x27, "第%u名：[p:%u:%s]，英雄岛积分%u，获得[英雄遗迹]x%u，声望%u，礼券%u！")
sysMsg:set(2327, 0x27, "英雄岛据点[%s]被%s身份玩家占领，据点上的%s身份玩家获得积分100，英雄岛据点宝箱×%u")
sysMsg:set(2328, 0, "英雄岛据点占领奖励")
sysMsg:set(2329, 0, "您在第%u轮英雄岛活动，占领了据点%s，获得100积分，英雄岛据点宝箱x%u，请注意查收！")

--sysMsg:set(2320, 0, "春节充值%u仙石返礼")
--sysMsg:set(2321, 0, "感谢您参加春节充值返礼活动，请点击“接受物品”按钮获取奖励")
--sysMsg:set(2320, 0, "蜀山嘉年华充值%u仙石返礼")
--sysMsg:set(2321, 0, "感谢您参加蜀山嘉年华充值返礼活动，请点击“接受物品”按钮获取奖励")
--sysMsg:set(2320, 0, "伏魔壁现，道破天劫%u仙石奖励")
--sysMsg:set(2321, 0, "伏魔壁现，道破天劫奖励")
sysMsg:set(2320, 0, "充值返礼%u仙石")
sysMsg:set(2321, 0, "恭喜您获得了%u仙石充值返礼")

sysMsg:set(2322, 0, "出生前七天充值%u仙石返礼")
sysMsg:set(2323, 0, "感谢您参加出生前七天充值返礼活动，请点击“接受物品”按钮获取奖励")

sysMsg:set(2324, 0, "六一棒棒糖")
sysMsg:set(2325, 0, "六一棒棒糖")

sysMsg:set(2330, 0x27, "[p:%u:%s]将[f:%u:%s]的天赋洗炼至橙色属性")

sysMsg:set(2331, 0, "情人节活动奖励")
sysMsg:set(2332, 0, "恭喜您，获得情人节活动称号卡奖励")

sysMsg:set(2333, 0, "修炼地变更")
sysMsg:set(2334, 0, "你被[p:%u:%s]战败并被移动到无主之地")

sysMsg:set(2335, 0, "开服五大活动")
sysMsg:set(2336, 0, "活动一：首次充值拿大礼\n\t\t角色首次在游戏里充值，将会获得【首次充值礼包】。\n活动二：新手成长礼包\n\t\t人物等级达到30级，我们就将送您一个新手成长礼包\n活动三：新人冲级赛\n\t\t开服之日起7天后，等级排行榜前10位的玩家将会得到100-1000不等的礼券\n活动四：散仙召集令\n\t\t成功招募到任意橙色散仙，都将获得1000礼券奖励\n活动五：【VIP橙装大礼包】大奉送\n\t\t等级达到40级后（包含40级），可以获得一个【VIP橙装大礼包】。\n\t\t\t\t<a target=\"_blank\" href=\"http://gamebbs.qq.com/cgi-bin/data/cgi_bbs_content.cgi?groupid=264:30921&messageid=27&page=0\"><b>]]]]]]点击查看活动详情[[[[[[</b></a>")

sysMsg:set(2343, 0, "活动一：首次充值拿大礼\n\t\t角色首次在游戏里充值，将会获得【首次充值礼包】。\n活动二：新手成长礼包\n\t\t人物等级达到30级，我们就将送您一个新手成长礼包\n活动三：新人冲级赛\n\t\t开服之日起7天后，等级排行榜前10位的玩家将会得到100-1000不等的礼券\n活动四：散仙召集令\n\t\t成功招募到任意橙色散仙，都将获得1000礼券奖励\n活动五：【VIP橙装大礼包】大奉送\n\t\t等级达到40级后（包含40级），可以获得一个【VIP橙装大礼包】。\n\t\t\t\t<a target=\"_blank\" href=\"http://bbs.soletower.net/tw/viewthread.php?tid=226887&extra=page%3D1\"><b>]]]]]]点击查看活动详情[[[[[[</b></a>")
sysMsg:set(2337, 0x27, "[p:%u:%s] 施展诸天归元禁锢之法，成功将锁妖塔第%u层妖物封印。")
sysMsg:set(2338, 0x27, "[p:%u:%s] 成功击败锁妖塔第%u层的镇妖者[p:%u:%s]，获得了[4:%u]。")

sysMsg:set(2339, 0x35, "删除密友成功")
sysMsg:set(2340, 1, "您从密友名单中移除了[p:%u:%s]")
sysMsg:set(2341, 0x35, "添加密友成功")
sysMsg:set(2342, 1, "您将[p:%u:%s]添加到密友名单")

sysMsg:set(2350, 1, "当前系统时间：%u/%u/%u %u:%u:%u 星期%u")
sysMsg:set(2351, 0x27, "[p:%u:%s]使用了先天灵石获得了[4:%u]，[4:%u]，[4:%u]")
sysMsg:set(2352, 0x27, "[p:%u:%s]使用了先天灵石获得了[4:%u]x6")

sysMsg:set(2353, 1, "-心魔");

sysMsg:set(2354, 0, "风雷罗盘的意志")
sysMsg:set(2355, 0, "我认可了您的能力，这个称号是属于你的")

sysMsg:set(2356, 0, "棒棒糖的意志")
sysMsg:set(2357, 0, "我认可了您的能力，这个称号是属于你的")

sysMsg:set(2358, 0, "恭喜您在蜀山大寻宝活动中夺宝排行第%u名")
sysMsg:set(2359, 0, "恭喜您成为夺宝排行第%u名！此刻正有无数宵小对您拥有的宝物和荣耀虎视眈眈，保住当前名次或者再加把劲即可获得永久属性仙丹及绝版专属称号“多宝仙君”哦！（点击界面右侧秘境按钮可前往寻宝）")

sysMsg:set(2360, 0, "寻宝排行榜奖励")
sysMsg:set(2361, 0, "尊敬的%s大大，您好！恭喜您在蜀山大寻宝活动中勇夺第%u名，您可以点击右侧“接受物品”按钮领取奖励，并至物品栏查收。请继续支持我们的游戏，更多活动请关注蜀山传奇官网ss.xy.com")

sysMsg:set(2362, 0, "夺宝排行名次变更")
sysMsg:set(2363, 0, "在争夺天才地宝的激烈过程中，您被%s一剑斩落云端，夺宝排名降至%u名！赶快重整旗鼓，向着永久属性仙丹及绝版专属称号更近一步吧！（点击界面右侧秘境按钮可前往寻宝）")

sysMsg:set(2364, 0, "寻宝次数奖励")
sysMsg:set(2365, 0, "您获得了蜀山大寻宝奖励（點擊界面右側秘境按鈕可继续前往尋寶）")

sysMsg:set(2366, 0, "七日目标QB大奖")
sysMsg:set(2367, 0, "恭喜您获得七日目标%uQB大奖，卡号%s密码%s。建议您立刻充值QB购买仙石享受更精彩的蜀山游戏世界")

sysMsg:set(2368, 0, "新手注册邀请好友抽奖")
sysMsg:set(2369, 0, "恭喜您在新手注册邀请好友抽奖活动中获得%uQB大奖，卡号%s密码%s。建议您立刻充值QB购买仙石享受更精彩的蜀山游戏世界!")

sysMsg:set(2370, 0, "好友邀请抽奖QB大奖")
sysMsg:set(2371, 0, "恭喜您在好友邀请抽奖中获得%uQB大奖，卡号%s密码%s。建议您立刻充值QB购买仙石享受更精彩的蜀山游戏世界!")

sysMsg:set(2372, 0, "蜀山天涯录奖励")
sysMsg:set(2373, 0, "恭喜您进入蜀山天涯录排名，获得蜀山天涯录排名奖励点击“接受物品”按钮领取奖励。")

sysMsg:set(2380, 0, "QQGAME在线奖励")
sysMsg:set(2381, 0, "QQGAME在线奖励")

sysMsg:set(2382, 0, "QQ大厅登录奖励")
sysMsg:set(2383, 0, "QQ大厅登录奖励")

sysMsg:set(3000, 1, "提升主将活动");
sysMsg:set(3001, 1, "您在【提升主将得好礼】活动中，成功将主将潜力提升至1.3资质提升至6.8，恭喜您获得奖励200礼券，蓝色法宝五火神雷，请点击右侧“接受物品”领取奖励，感谢您对我们游戏的支持。");

sysMsg:set(3002, 0, "7.13活动")
sysMsg:set(3003, 0, "心法技能改版返还")
sysMsg:set(3004, 0, "散仙%s原有的技能心法将保留，但会失去增益属性，且装备时不再消耗元神力，附件中有与其属性相同的心法，及升级至对应等级需要的修为丹，您可以学习他恢复到和以前一样的属性")

sysMsg:set(4000, 0, "君子争上游活动")
sysMsg:set(4001, 0, "%s")
sysMsg:set(4002, 0, "君子争上游奖励，恭喜你在15名之内了")
sysMsg:set(4003, 0, "君子争上游奖励，恭喜你较昨日前进了%u名")

sysMsg:set(4004, 0, "[4:%u]")
sysMsg:set(4005, 0, "神秘礼物-[4:%u]x%u")
sysMsg:set(4006, 0, "储值返仙石还剩%u天！")
sysMsg:set(4007, 0, "储值返仙石还剩最后%u天！！！此活动仅在开服举办，机会难得，错过即不在！")
sysMsg:set(4008, 0, "冲级奖励");
sysMsg:set(4009, 0, "恭喜你达到%u级，奖励%u礼券！");

sysMsg:set(4010, 0x35, "你正在战斗中，不能与好友斗剑")
sysMsg:set(4011, 0x35, "发送斗剑邀请成功")
sysMsg:set(4012, 0x35, "目标玩家正在战斗中，不能与你斗剑")
--sysMsg:set(4013, 0x35, "[p:%u:%s]向你发出斗剑邀请，是否接受？")
sysMsg:set(4014, 0x35, "对方拒绝了邀请请求")
sysMsg:set(4015, 0x35, "目标玩家正在战斗中，不能与你斗剑")
sysMsg:set(4016, 0x35, "你正在3分钟冷却中，不能与好友斗剑")
sysMsg:set(4017, 0x35, "对方正在3分钟冷却中，不能与你斗剑")
sysMsg:set(4018, 0, "新人冲级赛奖励")
sysMsg:set(4019, 0, "您在【新人冲级赛】活动中，达到等级排行第%u，恭喜您获得奖励%u礼券，感谢您对我们游戏的支持！")

sysMsg:set(4020, 0, "七夕活动排名奖励")
sysMsg:set(4021, 0, "恭喜您和 %s 在七夕活动中的姻缘录排名第%u，获得了姻缘录第%u名奖励，请点击“接受物品”按钮领取")
sysMsg:set(4022, 0, "七夕活动姻缘奖励")
sysMsg:set(4023, 0, "恭喜您和 %s 在七夕成就一段美好姻缘，各获得了姻缘奖励，请点击“接受物品”按钮领取")
sysMsg:set(4024, 0, "七夕活动积分奖励")
sysMsg:set(4025, 0, "恭喜您在七夕活动中达到了%u积分，获得了相应积分奖励，请点击“接受物品”按钮领取")

sysMsg:set(4026, 0, "充值排行第%u名奖励")
sysMsg:set(4027, 0, "充值排行第%u名奖励")
sysMsg:set(4028, 0, "宝典")

sysMsg:set(4029, 0, "[4:1530]补偿")
sysMsg:set(4030, 0, "这是您的“[4:1530]”强化【%u】级，熔炼值【%u】获得了如下的补偿，请查收！")

sysMsg:set(4031, 0, "月饼活动奖励")
sysMsg:set(4032, 0, "恭喜您在月饼活动中食用月饼最多，获得了称号卡：皎月剑仙，请点击“接受物品”按钮领取")
sysMsg:set(4033, 0x16, "充值排行第%u名: [p:%u:%s], 充值额度: %u")
sysMsg:set(4034, 0x16, "消费排行第%u名: [p:%u:%s], 消费额度: %u")
sysMsg:set(4040, 0, "镇妖封神 修仙夺宝")
sysMsg:set(4041, 0, "活动期间将锁妖塔封印至50层、60层即可获得奖励。奖励只可获得一次，不可重复领取")
sysMsg:set(9999, 0, "var: %d")

sysMsg:set(4050, 0, "万圣节活动排名奖励")
sysMsg:set(4051, 0, "恭喜您和 %s 在万圣节活动中的奇境冒险排名第%u，获得了奇境冒险第%u名奖励，请点击“接受物品”按钮领取")
sysMsg:set(4052, 0, "万圣节活动冒险资格奖励")
sysMsg:set(4053, 0, "恭喜您和 %s 在万圣节活动中寻到了给力的搭档，各获得了冒险资格奖励，请点击“接受物品”按钮领取")
sysMsg:set(4054, 0, "万圣节活动积分奖励")
sysMsg:set(4055, 0, "恭喜您在万圣节活动中达到了%u积分，获得了相应积分奖励，请点击“接受物品”按钮领取")
sysMsg:set(4056, 0, "七夕活动排名奖励")
sysMsg:set(4057, 0, "恭喜您和 %s 在七夕活动中的姻缘录排名第%u，获得了第%u名奖励，请点击“接受物品”按钮领取")
sysMsg:set(4058, 0, "七夕活动姻缘奖励")
sysMsg:set(4059, 0, "恭喜您和 %s 在七夕成就一段美好姻缘，获得了相应奖励，请点击“接受物品”按钮领取")

sysMsg:set(4060, 0x27, "[p:%u:%s]使用了通灵神石获得了[4:%u]，[4:%u]，[4:%u]")
sysMsg:set(4061, 0x27, "[p:%u:%s]使用了通灵神石获得了[4:%u]x6")
sysMsg:set(4062, 0, "逍遥嘉年华活动奖励")
sysMsg:set(4063, 0, "恭喜您在逍遥嘉年华活动中使用逍遥嘉年华礼包最多，获得了称号卡：逍遥仙，请点击“接受物品”按钮领取")
sysMsg:set(4064, 0, "金蛇得宝称号奖励")
sysMsg:set(4065, 0, "恭喜您获得了称号卡：金蛇郎君，请点击“接受物品”按钮领取，祝您游戏愉快！")

sysMsg:set(4066, 0, "七夕活动积分奖励")
sysMsg:set(4067, 0, "恭喜您在七夕活动中达到了%u积分，获得了相应积分奖励，请点击“接受物品”按钮领取")

sysMsg:set(4070, 0, "孤月大师赠送的钜子装备")
sysMsg:set(4071, 0, "这是墨家钜子曾经用过的装备，现在我将它赠送给你，希望对你有所帮助。点击“接受物品”按钮领取。")

sysMsg:set(4072, 0, "墨家修为异常补偿")
sysMsg:set(4073, 0, "墨家修为异常补偿。")

sysMsg:set(4098, 0, "大地的守护");
sysMsg:set(4099, 0, "恭喜您，得到了大地之神的庇佑，并获取节日套装—-大地的守护！点击“接受物品”按钮领取。");
sysMsg:set(4100, 0, "12.%u QQ大厅在线奖励");
sysMsg:set(4101, 0, "12.%u QQ大厅在线奖励");
sysMsg:set(4102, 0, "圣诞节登录奖励");
sysMsg:set(4103, 0, "祝您圣诞快乐！点击“接受物品”按钮领取。");

sysMsg:set(4104, 0, "玩《蜀山传奇》，每日登录拿奖励");
sysMsg:set(4105, 0, "亲爱的玩家，活动期间，通过活动入口每天登录蜀山传奇可获得《蜀山传奇》大礼包1个。礼包每日只能领取一次。");
sysMsg:set(4106, 0, "玩《蜀山传奇》达到40级拿奖励");
sysMsg:set(4107, 0, "亲爱的玩家，您在活动期间达到40级，特奖励您成就礼包一个。祝您游戏愉快！");

--sysMsg:set(4108, 0, "开学快乐");
--sysMsg:set(4109, 0, "又到了一年一度的开学季，恭喜您得到了超级大队长的青睐，并获取节日套装—-五道杠！点击“接受物品”按钮领取。");
--sysMsg:set(4108, 0, "中秋节快乐");
--sysMsg:set(4109, 0, "又到了一年一度的中秋节，蜀山运营团队全体工作人员将在这阖家欢乐的日子，送您一份美味可口的月饼，请注意查收附件。");
--sysMsg:set(4108, 0, "七夕节日套装");
--sysMsg:set(4109, 0, "又一年中国情人节，此时此刻的你是否和爱人相互幸福依偎?是否依然形单影只?人生际遇不同，遭遇也不尽相同，在此祝愿蜀山所有的有情人能够长长久久。同时也祝愿形单影只的剑侠能够早日寻找到自己的另一半！附件是我们赠送给您的节日装备——星月相伴戒，请注意查收哦！");
sysMsg:set(4108, 0, "中秋节节日套装");
sysMsg:set(4109, 0, "今年中秋节嫦娥姐姐和法海去约会了，吴刚和天蓬元帅去看来自星星的你了，大家都很忙，哈哈，终于轮到我玉兔来露脸啦！做为绿叶的我终于当主角了！这里代忙碌的人祝大家中秋节快乐！");

sysMsg:set(4112, 0, "沙滩城堡大赛活动积分奖励");
sysMsg:set(4113, 0, "恭喜您在沙滩城堡大赛活动中达到了积分:%u, 请领取奖励,祝您游戏愉快！");
sysMsg:set(4114, 0, "沙滩城堡大赛活动积分排名奖励");
sysMsg:set(4115, 0, "恭喜您和搭档[%s]在沙滩城堡大赛活动中获得了第%u名, 请领取奖励，祝您游戏愉快！");

sysMsg:set(4116, 0, "灵宝概率测试:[4:%u] 随机%u次 绿色个数%u, 蓝色个数%u, 紫色个数%u, 橙色个数%u, 1条技能的灵宝数%u， 2条技能的灵宝数%u");

sysMsg:set(4117, 0x35, "获得了[e:%u:%s]")
sysMsg:set(4118, 1, "您获得了[e:%u:%s]")
sysMsg:set(4120, 0, "福禄仙师称号奖励");
sysMsg:set(4121, 0, "恭喜您获得了称号-福禄仙师，祝您游戏愉快！");
sysMsg:set(4122, 0, "九天龙王称号奖励");
sysMsg:set(4123, 0, "恭喜您获得了称号-九天龙王，祝您游戏愉快！");
sysMsg:set(4124, 0, "放弃唤灵返还");
sysMsg:set(4125, 0, "放弃唤灵返还，请点击“接受物品”按钮获得道具。");
sysMsg:set(4126, 0, "新年快乐——节日套装“福到”来");
sysMsg:set(4127, 0, "蜀山传奇祝所有玩家新年快乐～请点击“接受物品”按钮领取节日套装“福到”");
sysMsg:set(4128, 0, "情人节快乐——送节日套装");
sysMsg:set(4129, 0, "蜀山传奇祝天下有情人终成眷属～请点击“接受物品”按钮领取节日套装“恋人之链”");
sysMsg:set(4130, 0, "剑侠秘籍XXX")
sysMsg:set(4131, 0, "剑侠秘籍XXXXXXXXXXXXXXX")

sysMsg:set(4132, 0x35, "出现暴击，运行周天重数+%u！")
sysMsg:set(4133, 0x27, "恭喜玩家[p:%u:%s]获得灵宠[f:%u:%s]，战力飙升，斗剑场又能虐人了！")
sysMsg:set(4134, 1, "您获得了灵宠[f:%u:%s]")
sysMsg:set(4135, 0x27, "恭喜玩家[p:%u:%s]成功将灵宠[f:%u:%s]的根骨提升至[9:1:%u]，傲视蜀山无宠可挡！")
sysMsg:set(4136, 0x66, "辉煌秘典已传于[p:%u:%s]")
sysMsg:set(4137, 0x66, "辉煌秘典已传于[p:%u:%s]")
sysMsg:set(4138, 0x66, "辉煌秘典已传于[p:%u:%s]")
sysMsg:set(4139, 0x27, "恭喜玩家[p:%u:%s]获得了橙色灵宠[f:%u:%s]，天上地下，唯我独尊！")

sysMsg:set(4140, 0, "灵宠功能上线活动");
sysMsg:set(4141, 0, "恭喜您获得系统赠送的灵宠蛋一个，请点击“接受物品”按钮领取。");
sysMsg:set(4142, 0, "愚人节活动");
sysMsg:set(4143, 0, "恭喜你在愚人节活动中使用愚公宝箱最多，获得称号：逗你玩儿，请点击“接受物品”按钮领取。");

sysMsg:set(4145, 0, "2013.%u.%u 人气排行榜奖励");
sysMsg:set(4146, 0, "截止至2013.%u.%u，有%u人对您表示崇拜。您因此获得\"名震蜀山\"称号，为期一周。");
sysMsg:set(4147, 0x16, "恭喜[p:%u:%s]在上一周人气榜名列第一位，获得\"名震蜀山\"称号，滔滔江水般的崇拜使他成功做到了小弟千万，名震蜀山！")

sysMsg:set(4148, 0x35, "恭喜，回答正确！")
sysMsg:set(4149, 0x35, "Sorry，回答错误！")
sysMsg:set(4150, 0x35, "Sorry，回答超时！")
sysMsg:set(4151, 0 , "峨眉天下秀活动");
sysMsg:set(4152, 0 , "恭喜你在峨眉天下秀活动中使用峨眉秘宝最多，获得称号：\"金顶佛光\"，请点击“接受物品”按钮领取。");
--sysMsg:set(4153, 0 , "大地守护神");
--sysMsg:set(4154, 0 , "大地选择了您，只有您才配得上\"大地守护神\"这个神圣的称号,请点击“接受物品”按钮领取。");
--sysMsg:set(4153, 0 , "儿童节快乐");
--sysMsg:set(4154, 0 , "活动期间内您使用\"棒棒糖\"的数量位列全服第一，专属【圣斗士】称号卡只属于快乐的你！祝儿童节快乐！");
--sysMsg:set(4153, 0 , "昆仑天下雄");
--sysMsg:set(4154, 0 , "恭喜你在昆仑天下雄活动中使用昆仑秘宝最多，获得称号：\"万山之祖\"，请点击“接受物品”按钮领取。");
sysMsg:set(4153, 0 , "追月之旅");
sysMsg:set(4154, 0 , "恭喜你在追月之旅活动中使用月饼最多，获得称号：\"皓月之星\"，请点击“接受物品”按钮领取。");

sysMsg:set(4155, 0x27, "玩家[p:%u:%s]日积月累，终于合成了[e:%u:%s]x%u！")
sysMsg:set(4156, 0x27, "玩家[p:%u:%s]千锤百炼，终于淬炼了[e:%u:%s]x%u！")
sysMsg:set(4157, 0x17, "恭喜玩家[p:%u:%s]将灵宠的内丹[e:%u:%s]升至%u级，圆满无暇，亘古不朽！")
sysMsg:set(4158, 0x27, "[p:%u:%s]集齐了[4:%u]，即将御器高飞，遨游三界！")
sysMsg:set(4159, 0x27, "[p:%u:%s]获得了[4:%u]，仙运奇佳，战力又增！")
sysMsg:set(4160, 0x27, "[p:%u:%s]得到了上古灵侍[e:%u:%s]，即将开始大杀四方啦！")
sysMsg:set(4161, 0x35, "培养暴击！")
sysMsg:set(4162, 0, "灵侍吞噬返还")
sysMsg:set(4163, 0, "您的灵侍被吞噬后，将您在培养过程中用来突破的心血变为灵侍突破符赠送给了你，请点击接受获取！")
sysMsg:set(4164, 0, "周年庆套装");
sysMsg:set(4165, 0, "蜀山传奇3岁啦！3年走来，风雨同舟，一路相伴，幸福有你！在这个特殊的日子里，赠送我的所有小苹果们一件节日套装，感谢各位小苹果们一直以来的支持！也祝各位小苹果们生活愉快，工作顺心！");
sysMsg:set(4166, 0, "魔幻书包奖励");
sysMsg:set(4167, 0, "亲爱的剑侠，恭喜您在本次活动中开启魔幻书包数量达到50，附件为您的奖励，请您注意查收。感谢您对我们的支持！");

sysMsg:set(4173, 0 , "魔幻榜排名奖励");
sysMsg:set(4174, 0 , "亲爱的蜀山剑侠，恭喜您在本次活动中取得了第%u名的好成绩，附件为您本次活动的排名奖励，请您注意查收，谢谢！");
sysMsg:set(4175, 0 , "感恩节礼包活动");
sysMsg:set(4176, 0 , "恭喜你在感恩节礼包活动中使用火鸡礼包最多，获得称号：\"火鸡终结者\"，请点击“接受物品”按钮领取。");
sysMsg:set(4177, 0 , "欢乐大转盘活动");
sysMsg:set(4178, 0 , "恭喜您在欢乐大转盘活动中排名第%u位，获得第%u名排名奖励，请注意查收附件，谢谢！");
sysMsg:set(4179, 0 , "欢乐大转盘活动");
sysMsg:set(4180, 0 , "您在欢乐大转盘活动中共获得积分%u 排名第%u位。\n%s感谢您对蜀山传奇的支持，祝您游戏愉快!");
sysMsg:set(4181, 0 , "第%u名：[p:%u:%s]   累积欢乐值：%u\n");

--末日之战
sysMsg:set(4200, 0, "[1:%u]已经充能%u%%");
sysMsg:set(4201, 0, "%s已经达到%u血印");
sysMsg:set(4202, 0, "帮派技能[2:%u]发动");
sysMsg:set(4203, 0, "血魔[3:%u]本源消失");
sysMsg:set(4204, 0, "血芒魔阵已达到%u%%");
sysMsg:set(4205, 0, "血魔血量被消耗到%u%%");
sysMsg:set(4210, 0x66, "%u分钟后末日之战将开启");
sysMsg:set(4211, 0x16, "仙深渊中发生惊人的异变，一股无比邪恶的力量从中蔓延出来，蜀山将迎来末日的浩劫");
sysMsg:set(4212, 0x66, "血魔出世，蜀山世界面临空前浩劫，剑侠们速速前往阻止血魔炼成血芒魔阵，生灵涂炭。");
sysMsg:set(4213, 0x17, "末日之战已结束\n帮派血印第一名：%s\n帮派血印第二名：%s\n帮派血印第三名：%s\n")

sysMsg:set(4214, 0, "仙界至尊斗剑大会“战队邀请”")
sysMsg:set(4215, 0, "蜀山大侠 [p:%u:%s] 邀请您加入【%s】战队，一起参加仙界至尊斗剑大会！\n是否接受邀请？")

sysMsg:set(4220, 0, "末日之战帮派奖励");
sysMsg:set(4221, 0, "你的帮派在末日之战中排行第%u,帮派血印为%u,与第一名血印相差%u, 奖励已发送到帮派仓库");
sysMsg:set(4222, 0, "末日之战个人血印奖励");
sysMsg:set(4223, 0, "你在末日之战获得血印%u,请接收奖励");
sysMsg:set(4224, 0, "末日之战血魔消灭奖励");
sysMsg:set(4225, 0, "末日之战血魔消灭奖励，点击接受按钮领取奖励");
sysMsg:set(4226, 0, "你的帮派在末日之战中排行第%u,帮派血印为%u,  奖励已发送到帮派仓库");
sysMsg:set(4230, 0, "%s开始为[1:%u]充能");
sysMsg:set(4231, 0, "%s开始采集仙蕴精华");
sysMsg:set(4232, 0, "%s完成了[1:%u]充能");
sysMsg:set(4233, 0, "%s采集%u点仙蕴精华");
sysMsg:set(4234, 0, "%s的充能位被%s帮派抢占");
sysMsg:set(4235, 0, "%s的采集位被%s帮派抢占");

-- 4300 仙界遗迹
sysMsg:set(4300, 0x46, "%s发起了对[13:%u]遗迹的进攻小队，请帮派成员火速加入小队");
sysMsg:set(4301, 0x46, "%s已经解散了对[13:%u]遗迹的攻击小队");
sysMsg:set(4302, 0x35, "进攻[13:%u]遗迹成功");
sysMsg:set(4303, 0x35, "进攻[13:%u]遗迹失败");
sysMsg:set(4304, 0x27, "仙界龙族对仙界遗迹[13:%u]所属帮派赐福，礼物为仙界遗迹宝箱X10");
sysMsg:set(4305, 0, "仙界遗迹结算通知")
sysMsg:set(4306, 0, "今日仙界元气结算完毕，根据您的帮派占领遗迹的情况，帮派得到了%u点元气值，元气值已结算到帮派中")
sysMsg:set(4307, 0, ",同时今天为周末，所有的遗迹又恢复成无人占领状态")
sysMsg:set(4308, 0x46, "本帮派的[13:%u]遗迹不幸被%s帮派攻战");
sysMsg:set(4309, 0x46, "%s发起的对[13:%u]遗迹的攻击小队，已经满员，请队长或者帮主、副帮主下令进攻。");

--4900-4999 回流服务器
sysMsg:set(4900, 0, "战力之王奖励")
--sysMsg:set(4901, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，恭喜您获得奖励new ipad 一台，请联系游戏客服提供您的信息，我们将通过邮寄的方式把奖品送出，感谢您对我们游戏的支持。")
--sysMsg:set(4902, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，恭喜您获得奖励蜀山周边之U盘，请联系游戏客服提供您的信息，我们将通过邮寄的方式把奖品送出，感谢您对我们游戏的支持。")
--sysMsg:set(4903, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，恭喜您获得奖励蜀山周边马克杯，请联系游戏客服提供您的信息，我们将通过邮寄的方式把奖品送出，感谢您对我们游戏的支持。")
--sysMsg:set(4904, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，请接收奖励.")
sysMsg:set(4901, 0, "您在【战力之王】活动中，达到战斗力排行第%u名，获得丰厚奖励, 请注意查收.")

sysMsg:set(4910, 0, "开服7天充值排行奖励")
sysMsg:set(4911, 0, "你在开服7天充值排行活动中,获得第%u名,请接收奖励.")
sysMsg:set(4912, 0, "聚宝盆奖励")
sysMsg:set(4913, 0, "感谢您购买价值%u仙石的聚宝盆,请点击按钮领取您的奖励.此次是第%u次(一共可领取10次)")

sysMsg:set(4914, 0, "御剑特权体验")
sysMsg:set(4915, 0, "恭喜您已经到达%u级，开启御剑特权体验能帮助您获得双倍升级速度，迅速在众多蜀山剑侠中脱颖而出，称霸蜀山！详情请点击主界面上方特权体验活动按钮！")

sysMsg:set(4916, 0, "你未达到开启此活动条件")
sysMsg:set(4917, 0, "购买次数已达上限")
sysMsg:set(4918, 0x35, "消费星辰%u")
sysMsg:set(4919, 0x35, "消费剑心%u")

sysMsg:set(4920, 0, "墨守城规")
sysMsg:set(4921, 0, "本次墨守城规(周六)胜利方为:%s\n 荣誉榜第一帮派为:%s，它将成为墨守城规(周日)的守城方\n您在本次墨守城规活动中获得%u积分\n获得奖励:%u点荣誉，紫色星辰旗x%u\n您的帮派在本次墨守城规活动中共获得%u积分\n获得仙蕴:%u点\n明天20:00将进行墨守城规(周日)活动，您的帮派将加入%s,去%s机关城中的宝物。")
sysMsg:set(4922, 0, "本次墨守城规(周日)胜利方为:%s\n 荣誉榜第一帮派为:%s，\n您在本次墨守城规活动中获得%u积分\n获得奖励:%u点荣誉，紫色星辰旗x%u\n您的帮派在本次墨守城规活动中共获得%u积分\n获得仙蕴:%u点\n下周六20:00将进行墨守城规(周六)活动，您的帮派将加入%s，去%s机关城中的宝物。")
sysMsg:set(4923, 0, "守城帮派联盟")
sysMsg:set(4924, 0, "攻城妖族联盟")
sysMsg:set(4925, 0, "攻城帮派联盟")
sysMsg:set(4926, 0, "争夺")
sysMsg:set(4927, 0, "守护")

sysMsg:set(4930, 0x26, "%s 帮派成功将神魔之树浇灌至九重天，神树福泽满千门")
sysMsg:set(4931, 0x46, "帮派里的神魔之树已经达到%d重天，各位仙侠们可以前去领取神魔之果")
sysMsg:set(4932, 0x46, "帮派里的神魔之树被成功刷出青木之灵，神魔之树有了真灵掉落")
sysMsg:set(4933, 0x46, "帮派里的神魔之树被成功刷出绛紫之灵，神魔之树有了真灵掉落")
sysMsg:set(4934, 0x46, "帮派里的神魔之树被成功刷出橙翼之灵，神魔之树有了真灵掉落")
sysMsg:set(4935, 0x35, "您使用了[4:%u]，机关术经验+%u")
sysMsg:set(4936, 1, "您使用了[4:%u]，机关术经验+%u")
sysMsg:set(4937, 0x27, "玩家[p:%u:%s]经过千锤百炼，终于制造出了橙色机关玉[e:%u:%s]！")
sysMsg:set(4938, 0, "阵营奖励")
sysMsg:set(4939, 0, "尊敬的剑侠，恭喜您通过选择推荐阵营加入峨眉，附件是给您发送的奖励，请注意查收！让我们为峨眉而战吧！")
sysMsg:set(4940, 0, "尊敬的剑侠，恭喜您通过选择推荐阵营加入昆仑，附件是给您发送的奖励，请注意查收！让我们为昆仑而战吧！")
sysMsg:set(4941, 1, "获得了壁凤墨%u")
sysMsg:set(4942, 0x35, "获得了壁凤墨%u")
sysMsg:set(4943, 1, "获得了磐龙墨%u")
sysMsg:set(4944, 0x35, "获得了磐龙墨%u")
sysMsg:set(4949, 1, "您获得%u兽魂")
sysMsg:set(4946, 0x35, "获得兽魂%u")
sysMsg:set(4947, 1, "您消耗%u兽魂")
sysMsg:set(4948, 0x35, "消耗兽魂%u")
sysMsg:set(4945, 0x27, "恭喜玩家[p:%u:%s]人品大爆发，在招财进宝中获得了%u%的高额奖励！")
sysMsg:set(4950, 0, "个人英雄排名奖励");
sysMsg:set(4951, 0, "恭喜您在天书奇缘中的个人积分排名第%u名，获得了积分排名奖励，请注意查收您的附件，谢谢！");
sysMsg:set(4952, 0, "阵营胜利者奖励");
sysMsg:set(4953, 0, "恭喜您所在阵营的帮派夺得了天书，就您和所有的同阵营玩家将获得阵营奖励，请注意查收附件。谢谢！");
sysMsg:set(4954, 0, "个人积分奖励");
sysMsg:set(4955, 0, "恭喜您在天书争夺战活动当中积分达到%u，获得了个人积分奖励，请注意查收附件。谢谢！");
sysMsg:set(4956, 0x27, "「%s」帮派的[p:%u:%s]玩家通过神秘方式为其所在帮派积累了巨量积分");
sysMsg:set(4957, 0x27, "「%s」帮派的[p:%u:%s]玩家使用了第三次付费副本为其所在帮派贡献了大量积分");
sysMsg:set(4958, 0x27, "「%s」帮派的[p:%u:%s]玩家使用了第三次付费阵图为其所在帮派贡献了大量积分");
sysMsg:set(4959, 0x27, "「%s」帮派的[p:%u:%s]玩家使用了1次付费决战之地为其所在帮派贡献了大量积分");
sysMsg:set(4960, 0x46, "[p:%u:%s]神情亢奋，激动的向[p:%u:%s]竖起大拇指，感谢他为帮派做出的贡献");
sysMsg:set(4961, 0x46, "[p:%u:%s]脸若寒霜，怒视眼前的[p:%u:%s]，大声嚷嚷着督促他赶紧去干活为帮派做贡献");
sysMsg:set(4962, 0x27, "峨眉阵营的帮派%s和%s组成的联盟在天书奇缘活动中勇不可挡，为峨眉阵营夺得了天书，所有的峨眉阵营玩家将获得阵营胜利奖励。让我们感谢他们！！");
sysMsg:set(4963, 0x27, "昆仑阵营的帮派%s和%s组成的联盟在天书奇缘活动中勇不可挡，为昆仑阵营夺得了天书，所有的阵营玩家将获得阵营胜利奖励。让我们感谢他们！！");
sysMsg:set(4964, 0, "光棍节排名奖励");
sysMsg:set(4965, 0, "恭喜您和您所在的小队在情义罗盘活动中总积分排名第%u名，附件是您所获得的排名道具奖励，同时获得的强化装备将会直接进入您的背包内，无需通过邮件领取。请注意查收，谢谢！");
sysMsg:set(4968, 0, "末日之战成员积分");
sysMsg:set(4969, 0, "你的帮派在末日之战中排行第%u,帮派血印为%u,以下是您的帮派成员在本次末日之战的表现:\n%s");
sysMsg:set(4970, 0, "[f:%u:%u][f:%u:%s][f:%u:%s][f:%u:%s][f:%u:%u]\n");
sysMsg:set(4971, 0, "%u.%s  %u\n");
sysMsg:set(4972, 0, "七石斗法排名奖励");
sysMsg:set(4973, 0, "恭喜您在七石斗法活动中个人积分排名第%u名，获得了积分排名奖励，请注意查收您的附件，谢谢！");
sysMsg:set(4974, 0, "江湖遗宝");
sysMsg:set(4975, 0, "朋友一生一起走，那些日子不再有！你的好友[p:%u:%s]送您一份礼物，请注意查收！");
sysMsg:set(4976, 0, "朋友一生一起走，那些日子不再有！你的好友[p:%u:%s]送您一份礼物，但您今日已经接受过10次馈赠，因此无法再次获得。不过您最好还是要感谢他哦！");
sysMsg:set(4977, 0, "七石斗法好友请求");
sysMsg:set(4978, 0, "你的QQ好友[p:%u:%s]在【七石斗法】中遇到了麻烦，需要你的帮助，是否赠予TA一次免费重玩机会？");
sysMsg:set(4979, 0, "七石斗法请求反馈");
sysMsg:set(4980, 0, "你的QQ好友[p:%u:%s]赠送了一次免费七石斗法机会给你，去感谢一下TA吧");
sysMsg:set(4981, 0, "情义罗盘活动排名奖励");

--结婚进行时
sysMsg:set(4183, 0 , "全服热闹值奖励");
sysMsg:set(4184, 0 , "\n您的个人热闹值为%d，这是新人向您馈赠的礼物：");
sysMsg:set(4185, 0 , "\n您所在的服务器，烟花热闹值为%d，这是您的奖励：");
sysMsg:set(4186, 0 , "\n经过各位的努力，攻破了%d扇门，因此您得到了%d个[4:%u]，");
sysMsg:set(4187, 0 , "\n在闹洞房活动中，您是第一个找到新人的，这是您的奖励：");
sysMsg:set(4188, 0 , "\n在闹洞房活动中，你们成功施展爱意绵绵蹑云逐月功，没有被捣乱的玩家找到，这是您的奖励：");
sysMsg:set(4189, 0 , "[4:%u] * %d ,");
sysMsg:set(4190, 0 , "热热闹闹迎新人，开开心心送进门。在婚礼活动中，%s");
sysMsg:set(4191, 0 , "长长久久砸彩蛋");
sysMsg:set(4192, 0 , "俗话说得好，能吃是福。恭喜您在婚礼活动中连吃九桌，并且成功砸中彩蛋，这是您得到的彩蛋奖励：");
sysMsg:set(4193, 0 , "\n您所在的服务器，热闹值爆棚，这是新人向您馈赠的礼物：");
sysMsg:set(4194, 0 , "婚礼套餐");
sysMsg:set(4195, 0 , "婚礼将至，您预约的婚礼礼包这就为您派发。点燃烟花，抛洒百合，让您的婚礼更加热闹吧！");
sysMsg:set(4196, 0 , "烟花热闹值奖励");
sysMsg:set(4197, 0x16 , "%s与%s举办的，规格为%s的婚礼开始啦");
sysMsg:set(4198, 0x16 , "%s与%s举办的，规格为%s的婚礼拜堂还有5分钟就要开始啦");
sysMsg:set(4199, 0x16 , "%s与%s举办的，规格为%s的婚礼拜堂现在已经开始啦");
sysMsg:set(4899, 0x16 , "%s与%s举办的，规格为%s的婚礼已经开始啦,快去参加吧");

--天劫消息
sysMsg:set(5000, 0x16, "[p:%u:%s] 升级到%u级,天地为之颤动");
sysMsg:set(5001, 0x16, "神秘声音：流星陨落，划破天际，正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征六界轮回的阵法将唤来终结世界的力量。");
sysMsg:set(5002, 0x16, "%u分钟后天劫事件将开启");
sysMsg:set(5003, 0x16, "[p:%u:%s] 成为了积分榜的第一名");
--第一个事件
sysMsg:set(5010, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5011, 0x16, "[11:%u:%u]的线索已经收集了 %u%%");
sysMsg:set(5012, 0x27, "[p:%u:%s]在[2:%u]杀死了[1:%u]");
sysMsg:set(5013, 0x16, "神秘声音：[11:%u:%u]的线索已经全部收集，这次混乱乃是劫兆，天劫将至，剑侠们请继续平息混乱，寻找破劫之法。");
sysMsg:set(5014, 0x16, "混乱暂时被平息了，但天劫依旧存在，剑侠们请寻找破劫之法。");
--第二个事件
sysMsg:set(5020, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5021, 0x16, "[11:%u:%u]已经恢复 %u%%");
sysMsg:set(5022, 0x16, "神秘声音：神器已经解封，但他的能量还不稳定，剑侠们请维持神器的法力，这将是破劫关键。");
sysMsg:set(5023, 0x16, "神器已经稳定了，但还需要更多的能量才能发挥破劫的作用，剑侠们请继续维持他的法力迎接天劫。");
--第三个事件
sysMsg:set(5030, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5031, 0x16, "[11:%u:%u]已经冲破了 %u%%");
sysMsg:set(5032, 0x16, "神秘声音：[11:%u:%u]已经冲破，但不知为何他并未消失，并变得更为强大，剑侠们请速速破阵，拯救苍生，渡过天劫。");
sysMsg:set(5033, 0x16, "[11:%u:%u]的法力渐渐虚弱，但仍有复苏之象，剑侠们请保持对天雷残阵的攻势，决不能让天劫降临。");
sysMsg:set(5034, 0x27, "[p:%u:%s]打破[11:%u:%u]第%u层");
--第四个事件
sysMsg:set(5040, 0x16, "神秘声音：正邪之战，将蔓延至每一个角落，失落的神器重现凡间，象征末日毁灭的阵法将唤来终结世界的力量。");
sysMsg:set(5041, 0x16, "不！！！！！！！！！！！这不可能！！！！！！！！啊！！！！！！！！！！！！");
--奖励和邮件
sysMsg:set(5050, 0x27, "天劫积分排名奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u");
sysMsg:set(5051, 0x27, "天劫贡献排名奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u, [4:%u]x%u");
sysMsg:set(5052, 0,    "天劫排名奖励");
sysMsg:set(5053, 0, "感谢您参加今日的天劫事件活动，您获得排名奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5054, 0,    "天劫积分奖励");
sysMsg:set(5055, 0, "感谢您参加今日的天劫事件活动，您获得积分奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5056, 0,    "天劫贡献奖励");
sysMsg:set(5057, 0, "感谢您参加天劫活动，您获得贡献奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5058, 0,    "天劫等级奖励");
sysMsg:set(5059, 0, "天劫活动结束，您等级大于天劫等级,获得了奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5060, 0x27, "天劫BOSS伤害排名奖励，第%u名[p:%u:%s]获得了: [4:%u]x%u，贡献:%u");
sysMsg:set(5061, 0,    "劫数事件渡过奖励");
sysMsg:set(5062, 0, "感谢您参加今日的天劫事件活动，您获得劫数渡过奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5063, 0,    "天劫称号卡奖励");
sysMsg:set(5064, 0, "感谢您参加天劫活动，您获得称号卡奖励，请点击“接受物品”按钮获取奖励。");
sysMsg:set(5065, 0,    "天劫贡献排名特殊奖励");
sysMsg:set(5066, 0, "感谢您参加天劫事件活动，您获得贡献排名特殊奖励，请点击“接受物品”按钮获取奖励。");
--特殊天劫的4个提示
--sysMsg:set(5067, 0x16, "神秘声音：蜀山各地突然出现了河妖的身影，剑侠们速速前往将其平息祸乱，查明事情缘由。");
--sysMsg:set(5068, 0x16, "神秘声音：金刚皇者和他的小伙伴们在到达蜀山时，被河神重创，需要广大仙友的祝福才能恢复，剑侠们请赶紧帮助他们 。");
--sysMsg:set(5069, 0x16, "使者已经恢复 %u%%");
--sysMsg:set(5070, 0x16, "神秘声音：金刚皇者已经恢复元气，但他还需要更多祝福，来治疗他的小伙伴。");
--sysMsg:set(5071, 0x16, "神秘声音：金刚皇者感谢蜀山剑侠的救助，并告知了一个惊人的事实，河神的法力已积攒了上万年，唯有带有神秘力量的 金刚伏魔诀才可将其封印，剑侠们请帮助他们。");
--sysMsg:set(5072, 0x16, "南疆上空突然出现一嗜童阵，意图将整个蜀山纳入妖兽的控制，剑侠们速速前往阻止嗜睡魔猿的阴谋。");
--sysMsg:set(5073, 0x16, "嗜童无数！！哈哈哈哈哈哈哈！");
--sysMsg:set(5074, 0x16, "河神被金刚皇者[p:%u:%s]成功封印，蜀山大陆顺利度过了儿童劫，感谢你[p:%u:%s]，祝儿童节快乐！");
--sysMsg:set(5075, 0x16, "神秘声音：[11:%u:%u]的线索已经全部收集，所有线索均指向南疆，但蜀山各地小鬼肆虐，剑侠们请先平息祸乱。");
--sysMsg:set(5076, 0x16, "妖兽数量锐减，残党均逃向南疆，而此时南疆上空出现一漩涡秘境，无尽的妖孽从其中涌出，同时有一股神秘的势力正在 与他们交战，剑侠们请速速消灭小鬼头，寻找事情的真相。");
--sysMsg:set(5077, 0x16, "神秘声音：[11:%u:%u]已经冲破，但不知为何他并未消失，并变得更为强大，剑侠们请速速破阵，拯救苍生，渡过天劫。 ");
--sysMsg:set(5078, 0x16, "[11:%u:%u]的法力渐渐虚弱，但仍有复苏之象，剑侠们请保持对[11:%u:%u]的攻势，决不能让小鬼的阴谋得逞。");
sysMsg:set(5067, 0x16, "神秘声音：蜀山各地突然出现了邪恶势力的身影，剑侠们速速前往将其平息祸乱，查明事情缘由。");
sysMsg:set(5068, 0x16, "神秘声音：济世皇者带领麾下剑仙前来支援时，被无天偷袭重伤，需要广大仙友的祝福才能恢复，剑侠们请速速前往帮助。");
sysMsg:set(5069, 0x16, "使者已经恢复 %u%%");
sysMsg:set(5070, 0x16, "神秘声音：济世皇者已经恢复元气，但他还需要更多祝福，来治疗麾下的剑仙们。");
sysMsg:set(5071, 0x16, "神秘声音：济世皇者感谢蜀山剑侠的救助，并告知了一个惊人的事实，无天的法力已积攒了上万年，唯有带有神秘力量的普天同庆录才可将其封印，剑侠们请帮助他们。");
sysMsg:set(5072, 0x16, "峨眉金顶上空突然出现一灭灵邪阵，意图灭绝整个蜀山世界的生灵，剑侠们速速前往阻止无天的阴谋。");
sysMsg:set(5073, 0x16, "邪灵灭世！！哈哈哈哈哈哈哈！");
sysMsg:set(5074, 0x16, "无天被济世皇者[p:%u:%s]成功封印，蜀山大陆顺利度过了国庆劫，感谢你[p:%u:%s]，祝国庆节快乐！");
sysMsg:set(5075, 0x16, "神秘声音：[11:%u:%u]的线索已经全部收集，所有线索均指向峨眉金顶，但蜀山各地邪灵肆虐，请剑侠们先平息祸乱。");
sysMsg:set(5076, 0x16, "邪恶势力成员数量锐减，残党均逃向峨眉金顶，而此时峨眉金顶上空出现一无边邪气，无尽的邪灵从其中涌出，同时有一股神秘的势力正在与他们交战，剑侠们请速速消灭邪灵，寻找事情的真相。");
sysMsg:set(5077, 0x16, "神秘声音：[11:%u:%u]已经冲破，但不知为何他并未消失，并变得更为强大，剑侠们请速速破阵，拯救苍生，渡过天劫。");
sysMsg:set(5078, 0x16, "[11:%u:%u]的法力渐渐虚弱，但仍有复苏之象，剑侠们请保持对[11:%u:%u]的攻势，决不能让邪灵的阴谋得逞。");

--消费太酬宾
sysMsg:set(5100, 0, "商城消费返礼");
sysMsg:set(5101, 0, "商城消费返礼");
sysMsg:set(5102, 0, "你在商城消费大酬宾活动中消费了%u仙石,获得返礼%u礼券");
sysMsg:set(5103, 0, "商城消费返利提示");
sysMsg:set(5104, 0, "您在商城消费返礼活动中消费达到%u仙石，您将在10月24日收到返还的%u礼券，11月24日收到返还的%u礼券");

sysMsg:set(5110, 0, "沙滩城堡大赛活动排名");
sysMsg:set(5111, 0, "您所在小队在沙滩城堡大赛活动中共获得积分%u 排名第%u位\n\n%s");
sysMsg:set(5112, 0, "第%u名：[p:%u:%s]\n        [p:%u:%s]\n活动积分 ：%u\n\n");
sysMsg:set(5113, 0, "%s感谢您对蜀山传奇的支持，祝您游戏快乐!");
sysMsg:set(5114, 0, "圣诞节快乐!");
sysMsg:set(5115, 0, "圣诞节到了，祝您圣诞节快乐!附件是送给您的圣诞礼物，请注意 查收！");
sysMsg:set(5120, 0x27, "[4:%u]")
sysMsg:set(5121, 0x27, "玩家[p:%u:%s] 击杀了 [f:%u:%s] 获得了 %s，传为佳话，八方同喜！")
sysMsg:set(5123, 0 , "恭喜你获得混沌魔域降魔录第%u名");
sysMsg:set(5124, 0 , "恭喜你在混沌魔域中获得%u镇魔值，获得了第%u名排名奖励，请点击“接受物品”按钮领取，谢谢！");
sysMsg:set(5125, 0x35, "恭喜你降服[1:%u]！")
sysMsg:set(5126, 0x27, "[p:%u:%s]大显神威，降服了混沌魔域[1:%u]，为正道之楷模！");
sysMsg:set(5127, 0x35, "恭喜你征服了一处混沌魔域！")
sysMsg:set(5128, 0x27, "[p:%u:%s]大显神威，征服了一处混沌魔域，再写蜀山传奇！");
sysMsg:set(5130, 0x35, "邀请发送成功")
sysMsg:set(5133, 1, "[p:%u:%s]向您赠送了%u朵黄色鸢尾,与您的友好度爆增")

sysMsg:set(6000, 0x35, "获得经验值%llu\n御剑特权体验额外经验%u")
sysMsg:set(6001, 1, "[f:%u:%s]获得经验值%llu\n御剑特权体验额外经验%u")
sysMsg:set(6002, 0x35, "[f:%u:%s]获得修为值%u\n御剑特权体验额外修为%u")
sysMsg:set(6003, 1, "[f:%u:%s]获得修为值%u\n御剑特权体验额外修为%u")

sysMsg:set(6005, 0x66, "紫霄之巅将在%u分钟后开启，请准备好迎接挑战！")
sysMsg:set(6006, 0x66, "紫霄之巅已经开始")
sysMsg:set(6007, 0x66, "紫霄之巅已经结束")
sysMsg:set(6008, 0x66, "[p:%u:%s]第一个突破到第二层“奇门三才阵”，已领先一步！")
sysMsg:set(6009, 0x66, "[p:%u:%s]第一个突破到第三层“归元四象阵”，已领先一步！")
sysMsg:set(6010, 0x66, "[p:%u:%s]第一个突破到第四层“颠倒五行阵”，离紫霄之巅越来越近！")
sysMsg:set(6011, 0x66, "[p:%u:%s]第一个突破到第五层“天罡北斗阵”，离紫霄之巅越来越近！")
sysMsg:set(6012, 0x27, "玩家[p:%u:%s]摧枯拉朽，以迅雷不及掩耳盗铃儿响叮当的速度第一个冲上了紫霄之巅，缔造了新的传奇！")
sysMsg:set(6013, 0x27, "玩家[p:%u:%s]勇不可挡，第二个到达紫霄之巅，莫非冥冥中自有定数？")
sysMsg:set(6014, 0x27, "玩家[p:%u:%s]浴血奋战，第三位到达紫霄之巅，看来真是天命难违啊！")
sysMsg:set(6015, 0x27, "[p:%u:%s]获得了5连斩，他势如破竹，气势如虹！")
sysMsg:set(6016, 0x27, "[p:%u:%s]获得了10连斩，他开始大杀特杀了！")
sysMsg:set(6017, 0x27, "[p:%u:%s]获得了20连斩，所有人都在问，谁可以终结他！")
sysMsg:set(6018, 0x27, "[p:%u:%s]获得了30连斩，杀神降世，敌莫敢当！")
sysMsg:set(6021, 0x27, "[p:%u:%s]终结了[p:%u:%s]的%u连斩，出来混迟早要还的！")
sysMsg:set(6022, 0x27, "[p:%u:%s]终结了[p:%u:%s]的%u连斩，阎王让你三更死，谁敢留你到五更！")
sysMsg:set(6023, 0x27, "[p:%u:%s]终结了[p:%u:%s]的%u连斩，这是奇迹！不可思议的奇迹！")

--帮派建筑
sysMsg:set(5200, 1, "查询玩家: %s， 所在帮派 %s.\n帮派建筑等级: ")
sysMsg:set(5201, 1, "仙界元气： %u")
sysMsg:set(5202, 1, "物攻：%u 法攻：%u 身法：%u 生命：%u")

sysMsg:set(5135, 0, "紫霄之巅竞速排名奖励");
sysMsg:set(5136, 0, "恭喜在紫霄之巅活动中竞速排名第%u名，获得竞速排名%u荣誉奖励");
sysMsg:set(5137, 0, "紫霄之巅连斩奖励");
sysMsg:set(5138, 0, "恭喜你在紫霄之巅活动中达成%u连斩，获得%u荣誉奖励");
sysMsg:set(5140, 0, "紫霄之巅奖励结算");
sysMsg:set(5141, 0, "恭喜你在紫霄之巅活动中成功抵达第%u层；竞速排名第%u名；达成%u连斩；战斗胜利%u次；战斗失败%u次。合计获得荣誉%u点，天界牌%u个，经验%lu。期待你在下次活动中再接再厉！");
sysMsg:set(5142, 0, "恭喜你在紫霄之巅活动中成功抵达第%u层；达成%u连斩；战斗胜利%u次；战斗失败%u次。合计获得荣誉%u点，天界牌%u个，经验%lu。期待你在下次活动中再接再厉！");

sysMsg:set(5131, 0, "夺宝奇兵奖励");
sysMsg:set(5132, 0, "恭喜您夺宝奇兵活动中人品爆发，获得[4:%u]x%u，请注意查收您的附件，谢谢！");

sysMsg:set(5134, 0x66, "天啊！[p:%u:%s]已经连续答对5题，简直无法相信，你们信吗？反正我是信了！");
sysMsg:set(5150, 0x66, "10杀！[p:%u:%s]已经连续答对10题，简直亮瞎所有人的钛合金眼啦！");
sysMsg:set(5149, 0x66, "少年！能不能不要这么狠！[p:%u:%s]已经连续答对15题，给条生路行不行！");
sysMsg:set(5148, 0x66, "[p:%u:%s]以%u文采值勇夺挂冠，摘得本日状元郎头衔，获得礼券*200，额外666荣誉，状元宝箱*1，以及限时一天称号：状元郎");
sysMsg:set(5147, 0x66, "[p:%u:%s]以%u文采值勇夺亚军，摘得本日榜眼头衔，获得礼券*150，额外450荣誉，榜眼宝箱*1，以及限时一天称号：榜眼");
sysMsg:set(5139, 0x66, "[p:%u:%s]以%u文采值勇夺季军，摘得本日探花头衔，获得礼券*100，额外300荣誉，探花宝箱*1，以及限时一天称号：探花");
sysMsg:set(5146, 0, "一战成名奖励")
sysMsg:set(5145, 0, "恭喜您以%u文采值获得本日一战成名的第%u名，附件是您的排名奖励，请注意查收，同时荣誉、称号会直接获得！")
sysMsg:set(5144, 0x66, "[p:%u:%s]已经超神！连续20杀！还有谁！到底还有谁能阻挡他！");
sysMsg:set(5143, 1, "获得文采值%u")
--请顺序填写
sysMsg:set(5151, 0, "狂欢世界杯排名奖励");
sysMsg:set(5152, 0, "恭喜您在狂欢世界杯活动中积分排名第%u，积分达到%u分，附件是您的排名奖励，请注意查收，谢谢！");
sysMsg:set(5153, 0, "狂欢世界杯积分奖励");
sysMsg:set(5154, 0, "恭喜您在狂欢世界杯活动当中积分达到%u，获得了个人积分奖励，请注意查收附件。谢谢！");
sysMsg:set(5155, 0x27, "[p:%u:%s] 破解重重符文迷阵，成功打造机关兽 [e:%u:%s]");

sysMsg:set(5156, 0x27, "[p:%u:%s]福星高照，抽取到出双入对套牌，获得洗炼保护符*%u奖励");
sysMsg:set(5157, 0x27, "[p:%u:%s]竟然抽到了三阳开泰组合套牌获得了技能符文熔炼诀*%u奖励");
sysMsg:set(5158, 0x27, "幸福总是来的太突然，[p:%u:%s]竟然抽取到接二连三套牌，获得了法灵精金*%u奖励");
sysMsg:set(5159, 0x27, "天啊!简直不敢相信，[p:%u:%s]抽到了四季如春套牌，获得了五行精金*%u奖励");
sysMsg:set(5160, 0x27, "[p:%u:%s]风情万种的回眸一笑，抽到了五福临门套牌，获得了牛郎*%u奖励，你相信吗？反正我是不敢相信");
sysMsg:set(5161, 0x27, "老豆！陪我出来看上帝，[p:%u:%s]竟然抽到了三英二云套牌，获得了织女*%u奖励");
sysMsg:set(5162, 0x27, "[p:%u:%s]尽显土豪风采，使用一键%u个冰激凌抽奖，获得巨额奖励");

sysMsg:set(5163, 0x45, "金秋摇摇乐排名奖励");
sysMsg:set(5164, 0x45, "恭喜您在金秋摇摇乐活动中脱颖而出，以总积分%u的成绩获得了第%u名，附件是您的排名奖励，请注意查收，感谢您的支持，祝您游戏愉快！");
sysMsg:set(5165, 0x45, "金秋摇摇乐双倍奖励");
sysMsg:set(5166, 0x45, "您好！恭喜您活跃度达到%u点，此次为您本日首次达到该刻度，因此您将获得双倍活跃度奖励，附件是您活跃度首次双倍奖励的内容，请注意查收，谢谢！");
sysMsg:set(5167, 0x45, "金秋摇摇乐活跃奖励");
sysMsg:set(5168, 0x45, "您好！恭喜您活跃度达到%u点，附件是您获得的活跃度奖励，请注意查收，谢谢！");
sysMsg:set(5169, 0x27, "[p:%u:%s]被馅饼砸中，抽取到二龙戏珠套牌，获得太乙精金*%u奖励");


sysMsg:set(5170, 0x66, "一战成名活动将在15分钟后开启，请注意参加!");
sysMsg:set(5171, 0x66, "一战成名活动将在10分钟后开启，请注意参加!");
sysMsg:set(5172, 0x66, "一战成名活动将在5分钟后开启，请注意参加!");
sysMsg:set(5173, 0x66, "一战成名活动已经开始，请点击上方图标进入参加!");

sysMsg:set(5203, 0x66, "浪漫满屋！[p:%u:%s]对[p:%u:%s]使用了%u个999朵玫瑰，并深情的对他/她说：%s");
sysMsg:set(5204, 0x66, "目前在玫瑰俏佳人活动中，[p:%u:%s]以%u点魅力值雄踞榜首，[p:%u:%s]和[p:%u:%s]分别占据俏佳人阳光男榜榜首。看来他们离大奖又进一步了！");
sysMsg:set(5205, 0x66, "[p:%u:%s]向您送上了%u个19玫瑰，浓浓的情意是否能够打动你内心那根弦？！快去回应TA吧！");
sysMsg:set(5206, 0x66, "[p:%u:%s]以%u点魅力值荣登魅力榜榜首！");
sysMsg:set(5207, 0x66, "[p:%u:%s]收到了%u个玫瑰荣登阳光男榜榜首！");
sysMsg:set(5208, 0x66, "[p:%u:%s]收到了%u个玫瑰荣登俏佳人榜榜首！");
sysMsg:set(5209, 0x66, "您收到%u个19玫瑰");
sysMsg:set(5210, 0x66, "您收到%u个99玫瑰");
sysMsg:set(5211, 0x66, "您收到%u个999玫瑰");
sysMsg:set(5212, 0x66, "[p:%u:%s]向您送上了%u个99玫瑰，浓浓的情意是否能够打动你内心那根弦？！快去回应TA吧！");
sysMsg:set(5213, 0x66, "[p:%u:%s]向您送上了%u个999玫瑰，浓浓的情意是否能够打动你内心那根弦？！快去回应TA吧！");
sysMsg:set(5214, 0x66, "魅力榜排行奖励");
sysMsg:set(5215, 0x66, "恭喜您在玫瑰俏佳人活动中魅力榜排名第%u名，获得排行奖励，附件是您本次获得的奖励，请注意查收！");
sysMsg:set(5216, 0x66, "俏佳人榜排行奖励");
sysMsg:set(5217, 0x66, "恭喜您在玫瑰俏佳人活动中俏佳人榜排名第%u名，获得排行奖励，附件是您本次获得的奖励，请注意查收！");
sysMsg:set(5218, 0x66, "阳光男榜榜排行奖励");
sysMsg:set(5219, 0x66, "恭喜您在玫瑰俏佳人活动中阳光男榜排名第%u名，获得排行奖励，附件是您本次获得的奖励，请注意查收！");
sysMsg:set(5220, 0x66, "魅力积分奖");
sysMsg:set(5221, 0x66, "恭喜您魅力值达到%u点，获得积分奖励，附件为您获得的奖励内容，请注意查收，谢谢");
sysMsg:set(5222, 0x27, "[p:%u:%s]对[p:%u:%s]使用了%u个玫瑰！");
sysMsg:set(5223, 0x66, "[p:%u:%s]对[p:%u:%s]使用了%u个19朵玫瑰，情意绵绵的气息开始弥漫~");
sysMsg:set(5224, 0x66, "羡慕嫉妒恨！[p:%u:%s]对[p:%u:%s]使用了%u个99朵玫瑰，并对她说：%s");
sysMsg:set(5225, 0x66, "恭喜[p:%u:%s]玩家领取了天元神兽每日礼包终极大奖，获得橙色品质灵宠精魄：[f:%u:二级精魄·穷奇](属性:+39.23%暴击)");
sysMsg:set(5226, 0x66, "恭喜[p:%u:%s]玩家领取了天元神兽每日礼包终极大奖，获得橙色品质灵宠精魄：[f:%u:二级精魄·毕方](属性:+176.54%暴击伤害)");
sysMsg:set(5227, 0x66, "恭喜[p:%u:%s]玩家领取了天元神兽每日礼包终极大奖，获得橙色品质灵宠精魄：[f:%u:二级精魄·朱蛤](属性:+39.23%破击)");
sysMsg:set(5228, 0x66, "恭喜[p:%u:%s]玩家领取了天元神兽每日礼包终极大奖，获得橙色品质灵宠精魄：[f:%u:二级精魄·苍狼](属性:+837物理攻击)");
sysMsg:set(5229, 0x66, "恭喜[p:%u:%s]玩家领取了天元神兽每日礼包终极大奖，获得橙色品质灵宠精魄：[f:%u:二级精魄·青鸟](属性:+837法术攻击)");


sysMsg:set(5180, 0, "充值奖励");
sysMsg:set(5181, 0, "恭喜您充值达到对应额度，附件是给您送上的骰子奖励，请注意查收");
sysMsg:set(5182, 0, "消费奖励");
sysMsg:set(5183, 0, "恭喜您消费达到对应额度，附件是给您送上的骰子奖励，请注意查收");
sysMsg:set(5184, 0, "[p:%u:%s] 邀请您结伴参与三人游，是否加入？")
sysMsg:set(5185, 0, "恭喜您和您所在的小队在三人游活动中总积分排名第%u名，附件是您所获得的排名道具奖励。请注意查收，谢谢！");
sysMsg:set(5186, 0, "三人游活动排名奖励");
sysMsg:set(5187, 0, "第一桶金");
sysMsg:set(5188, 0, "恭喜您购买第一桶金%u仙石包，获得了%u礼券的奖励，附件为奖励的礼券，请注意查收！");
sysMsg:set(5189, 0x27, "[p:%u:%s]在第一桶金购买了%u仙石包，获得了100%礼券的高额返利，简直羡慕嫉妒恨啊！");
sysMsg:set(5190, 0x27, "[p:%u:%s]历经壶中界万水千山，成功寻到并击败五星珍妖[f:%u:%s]，获得属性加成和海量经验值。");
sysMsg:set(5191, 0x66, "黯龙王之怒还剩%u分钟就要打响，请做好准备！")
sysMsg:set(5192, 0, "黯龙王之怒活动奖励");
sysMsg:set(5193, 0, "您在黯龙王之怒活动中表现优异，排名第%u名。总共获得声望值%u点，其他奖励请注意查收邮件附件。");
sysMsg:set(5194, 0x35, "您获得%u点功德")
sysMsg:set(5195, 0x66, "XX之塔耐久度少于XX了，请各位侠士注意防护。");
sysMsg:set(5196, 0x66, "寂黯·XX阵耐久度少于XX了，请各位侠士再接再厉。");
sysMsg:set(5197, 0x66, "黯龙异兽发动猛攻，四轮之塔岌岌可危，耐久度下降5%");
sysMsg:set(5198, 0x66, "XX之塔耐久度少于XX了，请各位侠士注意防护。");
sysMsg:set(5199, 1, "您获得%u点功德")

sysMsg:set(5230, 0x66, "购物狂欢节");
sysMsg:set(5231, 0x66, "恭喜您在购物狂欢节中消费达到%u仙石，附件是您获得的返利道具，请注意查收，谢谢！");
sysMsg:set(5232, 0x66, "购物狂欢节排行奖励");
sysMsg:set(5233, 0x66, "恭喜您在购物狂欢节活动中总共消费%u仙石，排名第%u位，附件是您获得的道具返利，相应的仙石/礼券返利您可以通过福禄钱袋进行领取。感谢您的支持，祝您游戏愉快！");

sysMsg:set(5234, 0x66, "三周年分享奖励");
sysMsg:set(5235, 0x66, "亲爱的剑仙，感谢您的分享，以及在过去的时光中对蜀山的支持，附件为您的分享奖励，请您注意查收，谢谢！");
sysMsg:set(5236, 0x66, "终极分享奖励");
sysMsg:set(5237, 0x66, "亲爱的剑侠，感谢您对蜀山及三周年回忆录活动的大力支持，附件为您的分享终极奖励，请您注意查收，谢谢！");

sysMsg:set(5238, 0x27, "[p:%u:%s]玩家触发喜从天降状态，不知他会将这份福利带给全区同仁还是他的帮派兄弟姐妹们呢？");
sysMsg:set(5239, 0x27, "[p:%u:%s]对他的家%s帮派全体成员使用了喜从天降的赐福，并对他们说：%s");
sysMsg:set(5240, 0x27, "[p:%u:%s]大公无私的将自己的喜从天降赐福散播给了全服所有等级达到40级以上的兄弟姐妹们，并对大家说：%s");
sysMsg:set(5241, 0, "[p:%u:%s]的赐福礼包")
sysMsg:set(5242, 0, "您的帮派亲人[p:%u:%s]对您使用了喜从天降赐福，赠送了您一份赐福礼包，祝愿你开心快乐，幸福安康。  ")
sysMsg:set(5243, 0, "[p:%u:%s]使用了喜从天降全服赐福，您收到了一份他送给您的礼包，他祝愿你能够幸福安康，开开心心。  ")
sysMsg:set(5244, 0, "喜从天降排名奖励")
sysMsg:set(5245, 0, "恭喜您在喜从天降活动中排名第%u位，获得排名奖励，附件是排名奖励内容，请注意核对查收，谢谢！")

sysMsg:set(5246, 0, "[p:%u:%s]感谢他们帮派%s帮派的[p:%u:%s]赠送的赐福礼包，兄弟情义无需多言！")
sysMsg:set(5247, 0, "[p:%u:%s]衷心感谢[p:%u:%s]送他的礼包并祝他游戏开心快乐！ ")

sysMsg:set(5250, 0, "青光琉璃盏排名奖励")
sysMsg:set(5251, 0, "恭喜您在青光琉璃盏活动中排名第%u位，附件是您本次活动排名奖励道具内容，请注意查收，谢谢！")

sysMsg:set(5260, 0, "经济套餐奖励")
sysMsg:set(5261, 0, "附件是您经济套餐第%u次奖励，还剩%u次奖励将在后续发放，请注意查收，谢谢")
sysMsg:set(5262, 0, "超值套餐奖励")
sysMsg:set(5263, 0, "附件是您超值套餐第%u次奖励，还剩%u次奖励将在后续发放，请注意查收，谢谢")
sysMsg:set(5264, 0, "豪华套餐奖励")
sysMsg:set(5265, 0, "附件是您豪华套餐第%u次奖励，还剩%u次奖励将在后续发放，请注意查收，谢谢")
--6003~6049 繁体版本占用
--8000~8200 繁体版本占用

