
local Battle_Scene = {
    {0x0, 1},        -- 白堰村
    {0x1, 1},        -- 成都郊外
    {0x2, 1},        -- 成都
    {0x3, 3},        -- 慈云寺
    {0x4, 5},        -- 桂花山
    {0x5, 7},        -- 长沙城外
    {0x6, 1},        -- 长沙
    {0x8, 4},        -- 青螺山
    {0x10, 7},        -- 姑婆岭
    {0x11, 5},        -- 衡山
    {0x12, 7},        -- 百蛮山
    {0x13, 5},        -- 莽苍山
    {0x14, 7},        -- 峨嵋山
    {0x16, 7},        -- 九华山
    {0x17, 5},        -- 庐山
    {0x18, 5},        -- 黄山
    {0x19, 7},        -- 堰荡山
    {0x20, 1},        -- 东海
    {0x23, 5},        -- 罗浮山
    {0x24, 7},        -- 武当山
    {0x25, 5},        -- 青城山
    {0x26, 1},        -- 苏州
    {0x27, 7},        -- 南疆
    {0x28, 4},        -- 昆仑山
    {0x29, 4},        -- 喜马拉雅山
    {0x32, 4},        -- 陷空岛
    {0x34, 3},        -- 峨嵋派
    {0x35, 3},        -- 昆仑派
    {0xFF01, 2},        -- 慈云寺副本
    {0xFF02, 8},        -- 青螺魔宫副本
    {0xFF03, 9},        -- 三尸墓副本
    {0xFF04, 6},        -- 紫云宫副本
    {0xFF05, 10},       -- 月儿岛副本
    {0xFF06, 7},        -- 幻波池副本
    {0xFF08, 2},        -- 南疆魔域副本
    {0xFE01, 11},       -- 阵图
    {0xFD01, 3},        -- 斗剑场
    {0xFD02, 254},      -- 新阵营战(蜀山论剑)
    {0xFC01, 12},       -- 世界Boss
    {0xFD03, 253},      -- 末日之战
}


function getBattleScene()
    return Battle_Scene
end

