
local YellowDiamondAward = {
    --高级挂机加速符x1，银票x1，随机一级宝石x1，七星元木x1
    { {56, 1}, {15, 1}, {5001, 1}, {48, 1} },
    --太乙真金x1，高级挂机加速符x1，银票x1，随机一级宝石x1，七星元木x1
    { {502, 1}, {56, 1}, {15, 1}, {5001, 1}, {48, 1} },
    --太乙真金x3，高级挂机加速符x1，银票x1，随机一级宝石x1，七星元木x1
    { {502, 3}, {56, 1}, {15, 1}, {5001, 1}, {48, 1} },
    --太乙真金x5，修为加速符x1，高级挂机加速符x1，银票x1，随机一级宝石x1，七星元木x1
    { {502, 5}, {57,1}, {56, 1}, {15, 1}, {5001, 1}, {48, 1} },
    --太乙精金x1，修为加速符x1，高级挂机加速符x1，银票x1，随机一级宝石x1，七星元木x1
    { {503, 1}, {57,1}, {56, 1}, {15, 1}, {5001, 1}, {48, 1} },
    --太乙精金x1，修为加速符x2，高级挂机加速符x2，银票x2，随机一级宝石x1，七星元木x1
    { {503, 1}, {57,2}, {56, 2}, {15, 2}, {5001, 1}, {48, 1} },
    --太乙精金x2，修为加速符x3，高级挂机加速符x3，银票x3，随机一级宝石x1，七星元木x1
    { {503, 2}, {57,3}, {56, 3}, {15, 3}, {5001, 1}, {48, 1} }
}

local YearYellowDiamondAward = {
    --混元离土x1，洗炼符x1，银票x1，高级挂机加速符x1
    {51, 1}, {500, 1}, {15, 1}, {56, 1}
}

local YellowDiamondGem = { 5001, 5011, 5021, 5031, 5041, 5051, 5061, 5071, 5081, 5091, 5101, 5111, 5121, 5131, 5141 }

function getYellowDiamondGem()
    return YellowDiamondGem
end

function getYellowDiamondAward(qqvipl)
    return YellowDiamondAward;
end

function getYearYellowDiamondAward()
    return YearYellowDiamondAward;
end

